{
    "B巨蟹座+G白羊座": {
        "girls_horoscope": "白羊座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "42:58",
        "precautions": "尽管羊儿对蟹子来说是站在强势的高位，多少能满足羊儿的领导欲。但羊儿喜欢挑战、新事物的个性可能会致使羊儿见异思迁，让你们的关系不稳定。假如蝎子想要维持下去，就要发挥蝎子攻无不克的本事，对羊儿抱持尊重和呵护的态度，这样目标就很容易达成。蟹子和羊儿两个人在爱情中都是害怕受伤之人，但两个人的表达方式又是截然不同的。白羊座女是主动进攻，为引起对方注意，会常常将对方刺伤；蟹子则是曲线救国，会一味忍让，再痛也不会出声，也许害怕大家都受伤，所以有时还是要相互理解的。蟹子可能不是羊儿的理想标准伴侣，事实上蟹子可能连许下爱的承诺都要考虑再三；往往到了最后都是拒绝别人放弃自己，重新再找一个新对象，开始新的苦恼。",
        "boy_horoscope": "巨蟹座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "内向敏感的巨蟹座配上外向率真的白羊座的话，有点伤脑筋。从两者的恋爱位置来说，羊儿占据着主动位置，这很符合羊儿喜欢挑战的个性。但这样会给敏感的蟹子带来不安全感，会使这段感情不稳定。蟹子大多都是敏感没有感全的，遇事第一反应就是逃避，与凡事向前冲的羊儿正好相反，显得两人很搭调。由于两个人的个性、行为、思想的差距都成对比，因此会衍生出很多问题。如果想要长期发展，羊儿就要拿出对付难题的精神去攻占蟹子。蟹子在遇到自己不能解决的问题，就躲进蟹壳，需要长久的时间才能走出阴影。而羊儿却是越挫越勇，喜欢挑战，两人的处事方式态度截然不同。不要可能会忍受不了蟹子的情绪化，而蟹子又会对羊儿逼他快刀斩乱麻感到痛苦。"
    },
    "B双鱼座+G白羊座": {
        "girls_horoscope": "白羊座",
        "results_rvw": "小吵小闹的一对",
        "paired_proportions": "54:46",
        "precautions": "鱼儿和羊儿在一起的话，那就要多多包容羊儿的粗线条和冲动，对羊儿可以当成一个孩子来宠爱，对羊儿的一些小缺点不要计较那么多。鱼儿敏感由被动，喜欢自缩在自己的梦境中，但鱼儿还是很浪漫的。羊儿是适当收起急冲冲的坏脾气，给鱼儿多些引导，多跟鱼儿讲讲自己的梦想，投其所好，相信鱼儿也会理解羊儿，并会帮助羊儿一起实现梦想。",
        "boy_horoscope": "双鱼座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "双鱼座轮回的结束，白羊座却是开始，结束是另一个阶段的开始，因此你们两个人在冥冥中好像就有某些传承的相连性。这样的组合对鱼儿来说还不错，只要鱼儿你能忍受羊儿的粗线条。鱼儿遇事优柔寡断，喜欢逃避；羊儿则行事冲动。尽管你们两个行事风格差异很大，但性格的互补能使你们相互吸引。恋爱初期，鱼儿的温柔体贴会深深地吸引羊儿，而鱼儿也被羊儿的热情所吸引。可是随着时间推移，鱼儿就有点受不了羊儿的冲动。长此以往下去你们的矛盾就会越来越多，所以你们这对首尾星座要在一起的话，还需要有所改进。"
    },
    "B摩羯座+G摩羯座": {
        "girls_horoscope": "摩羯座",
        "results_rvw": "相处和谐的一对",
        "paired_proportions": "50:50",
        "precautions": "你们都是超现实主义者，不会轻易表达心底最深处的想法，凑在一起真的是半斤八两。你们个性内敛、深沉务实，对感情的表达都是十分含蓄。两个闷葫芦在一起能碰出什么样爱的火花？爱是需要说出来的，迷们得让对方感受到浓浓的爱意，不要让对方一直在猜哑谜。来！勇敢点，大声对他（她）说出“我爱你”！因为你们的性格一样，彼此能互相理解和包容，一旦在一起了，就会互相勉励，是相当稳定的一对。",
        "boy_horoscope": "摩羯座",
        "pairing_idx": "80",
        "longevity_idx": "4",
        "compassion_idx": "4",
        "love_advc": "摩羯和摩羯两个同样性格的人碰在一起，看起来很难搞定，但其实你们相处的格外亲切。你们俩能互相给予踏实的安全感，你懂我，我也了解你，十分默契。由于摩羯不太擅长表达情感，有时会让对方误解。虽然你们都不懂浪漫，但你们却乐在其中，享受彼此才会懂的乐趣。虽然说两个摩羯座的本性很相近，容易产生共鸣，但互补的吸引力就少了，你们的恋爱不会浪漫、不会轰轰烈烈，但能细水长流，绵绵不绝~~你们无论在一起做什么都能步调一致，默契十足，一切尽在不言之中，是一对很好的恋人。"
    },
    "B双子座+G摩羯座": {
        "girls_horoscope": "摩羯座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "60:40",
        "precautions": "因为你们之间的极端差异，摩羯想要和双子天长地久，除了期盼奇迹出现外，最主要的还是得靠自己。摩羯得学会以退为进的策略，不要以为自己什么都是对的，凡事都要做老大。碰上双子，摩羯总是目眩情迷，虽然理智上不接受双子的虎头蛇尾和对人对事没有定性，可依然抗拒不了双子的聪明活泼。因此，摩羯与其在双子后面追的头破血流，不如动点小聪明来俘获双子的芳心。摩羯在双子未用完所有刺探招式之前，不如吊吊双子的胃口，不要给双子反应。还有，即使摩羯对双子有好感，也不要喜形于色，但也不要摆出一副闲人莫近的表情，顺其自然和双子交往就好。如果摩羯认定双子，那摩羯就要接受双子判若两人，前后不一的个性，加倍努力去经营两人的感情。",
        "boy_horoscope": "双子座",
        "pairing_idx": "40",
        "longevity_idx": "2",
        "compassion_idx": "2",
        "love_advc": "风象的双子和土象的摩羯，两个星座一阴一阳，走到一起就是两个极端。当双子和摩羯在一起后，双子往往对摩羯传递的信息是爱理不理，老想着溜走，但没多久又会回头，因为双子无法抗拒摩羯的吸引力。双子有颗像猫一样的好奇心，即使认为摩羯像个怪人，也是忍不住要撩一下摩羯。双子对待爱情的态度是“不在乎天长地久，只在乎曾经拥有”，只享受当下的甜蜜。而摩羯则持相反的看法，摩羯会痛恨那种为恋爱而恋爱的人。不过，双子拥有口吐莲花的口才和旺盛的活力，这两点对摩羯还是充满吸引力的。双子和摩羯的相同之处在于，他们再怎么相爱，也各自希望有自己的空间和时间。"
    },
    "B天秤座+G处女座": {
        "girls_horoscope": "处女座",
        "results_rvw": "小吵小闹的一对",
        "paired_proportions": "46:54",
        "precautions": "处女座在这对组合虽然强势，但表现的不明显，而且秤子模棱两可的态度会让处女座感到困惑，一直在反省自己是否做错了什么。其实秤子很“搞怪”，处女座不能对秤子太好，也不能太好，秤子也不会直接表示，只会偷偷用别的方式去“填补”你的情。天秤座和处女座初相识时，容易被对方吸引，一见钟情。处女座见机行事的作风和天秤座侃侃而谈的交际手段，的确适合。当发生意见不合时，处女座的固执让秤子感到不舒服，秤子由明明想讲道理而变成不理会，你们的感情会岁时间而恶化。秤子认为“结婚和恋爱是不同的”，这观点使家庭型的处女座难以认同，势必要有长期抗战的心理准备。",
        "boy_horoscope": "天秤座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "天秤座和处女座能相互了解，且有不少相通之处。但你们之间的感情发展是模棱两可的，处女座从不主动示爱，只会用行动表示关怀，而秤子若即若离，像爱情又像友情，实在是难以看清实际状况。你们看重顺其自然交往，友情重于爱情，如果有一方想进一步加深关系，那问题就因此而生。天秤座会为处女的拖拖拉拉烦恼，而处女座会为天秤座的扭扭捏捏生气。你们之间的关系着实让人同情。"
    },
    "B射手座+G天蝎座": {
        "girls_horoscope": "天蝎座",
        "results_rvw": "小吵小闹的一对",
        "paired_proportions": "46:54",
        "precautions": "蝎子的想法和做事作风都是实际派的，凡事都会想清楚之后再做，做事有套路和谋略，这对于喜欢做事迅速、不经大脑的射手有很大的帮助，并且用的方式也会让蝎子觉得难受。射手有一点一定要切记：对待蝎子一定要有话直说，但也不要傻乎乎的过于耿直，得有点语言艺术，不要让蝎子陷入难堪。还有蝎子并不是射手想象的那么酷，蝎子的心其实很脆弱，所以不要轻易地去批评蝎子，很多不经意的批评，蝎子都会当真，而且蝎子记性超好，一旦记住，就很难忘记。如果射手真的爱上蝎子，那就请射手收起那颗不安分的玩心，安分守己一点，在爱情方面，蝎子可不是好惹的！",
        "boy_horoscope": "射手座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "射手属火象星座，蝎子属水象星座，射手遇上蝎子，那真的是水深火热啊！蝎子镇静，喜怒不形于色；射手好冲动、外向。这样两个性格反差极大的人能拧在一起吗?其实你们之间并不怎么相干，射手之所以被蝎子吸引完全是因为蝎子的神秘感挑起了兴趣；而蝎子则是被射手的活泼和热情所触动。射手花钱大手大脚，而蝎子偏偏是精打细算的主，在花钱这方面你们没少吵。幸好你们星座邻近的关系，彼此之间的隔阂并不大，只要有耐心，两人还是能相互理解的。但要长久相处，那射手就得必须蝎子的生活步调。"
    },
    "B天秤座+G天蝎座": {
        "girls_horoscope": "天蝎座",
        "results_rvw": "小吵小闹的一对",
        "paired_proportions": "54:46",
        "precautions": "蝎子的位置位于秤子之后，虽然个性相差甚远，但具有天生的理解，至少不会鸡同鸭讲，还有爱的希望。秤子对待任何事情都会持公平客观的态度去解决，而蝎子独善其身，喜欢处心积虑隐藏自己，在没十足把握之前，是不会将自己的心思透露出来，不会像秤子那样广而告之。所以蝎子应该学习秤子那种光明磊落的处事方式，在给予他沉稳的建议时，顺便调整自己的恋爱方式。蝎子虽然号称阴王，但从星座比重来看，秤子重于你。只因你的情绪浓烈容易被秤子掌握，而秤子习惯维持表面的均势。所以在你们的关系中，看起是你占优。但如果你不能放开胸怀，平静的看待秤子活泼的生活方式，那最后受伤的还是蝎子你。你们如果想要长久下去，那两个人在生活细节上就要多一点迁就，互相体谅才有继续的希望。",
        "boy_horoscope": "天秤座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "秤子和蝎子，一个是天生的明星料，一个是有神秘魅力的明星，两个人搭在一起，肯定会光芒四射。在初始阶段，秤子很容易被蝎子那神秘热情所吸引，并沉迷于她强烈的占有欲中。不过时间久了，蝎子这种寸草不留的激情和过分的占有欲，会把让秤子压地透不过气来，想享受自己的生活都不得。相反蝎子对秤子那种四海皆朋友总不分爱情和友情，四处留情的交友态度看不过眼。虽然秤子懂得避重就轻的瞒过蝎子，但是一旦被占有欲和嫉妒心极强的蝎子发现，那结果就可想而知。蝎子的独占欲最好不要施展在秤子身上，毕竟秤子不喜欢自闭的生活。因为你们的人生观和生活方式差异大，所以想要有长远的发展，那就必须互相了解。"
    },
    "B射手座+G水瓶座": {
        "girls_horoscope": "水瓶座",
        "results_rvw": "相濡以沫的一对",
        "paired_proportions": "44:56",
        "precautions": "瓶子遇上射手完全可以放飞自我，自由发挥，可以对自己的目标和意向坚定不移，因为射手会懒得理你。如果瓶子本着爱就是牺牲奉献而配合射手的话，那瓶子会吃力不讨好，还会把自己弄得狼狈不堪。，射手会觉得瓶子活该。射手要忙、要享受的太多，从来不勉强别人迁就自己。射手虽然很欣赏瓶子的思想前卫，但对瓶子缺乏行动力十分不满。但射手得明白，瓶子有自己的一套理论化看法，就算射手事先给瓶子个台阶，瓶子也未必会顺着你思路来走。你们两个相处时不会觉得无聊无趣，但对你们两个重自由的人来说，对于生活上的琐事最好能取得共识，不然，经济问题会让你们很不自由。彼此之间试着去调和一下，那就会更优秀。",
        "boy_horoscope": "射手座",
        "pairing_idx": "90",
        "longevity_idx": "4",
        "compassion_idx": "5",
        "love_advc": "风象星座和火象星座是阳性星座之中的两大元素，两个星座性质相近，是最理想的一种组合之一。射手自由又独立的人生观和瓶子非常相近，都很自由、开放、外向，他们并不会天天黏在一起，都不喜欢无变化的生活，而且生活圈子广泛。瓶子身上有固执的易变性，射手的不确定性，能使两人更好地处理感情波动。俩人之间会彼此尊重，是合则两利、分则独立的类型。"
    },
    "B水瓶座+G狮子座": {
        "girls_horoscope": "狮子座",
        "results_rvw": "相吸相斥的一对",
        "paired_proportions": "50:50",
        "precautions": "瓶子聪明睿智，狮子明艳出色，你们走在一起，可以称得上一对金童玉女。瓶子和狮子在一起后，由于两人性格互补可以相互欣赏。瓶子宽大的包容力可以理解狮子的思想和抱负，两人步调容易一致。在这段恋爱中，狮子在感情中喜欢占主动地位，瓶子在一些事情上也不喜欢让步，所以会产生一些小吵。在爱情里，狮子要注意收敛自己的大小姐脾气，两人若遇到意见相左的时候多听听对方的看法和分析，适当的通融能避免两人剧烈的冲突。",
        "boy_horoscope": "水瓶座",
        "pairing_idx": "60",
        "longevity_idx": "2",
        "compassion_idx": "4",
        "love_advc": "瓶子倾心于狮子明媚的外表，乐观自信的态度。狮子则会被瓶子的神秘所吸引。两人性格相反，但却互补。瓶子缺少狮子热情待人的品质，而狮子缺少瓶子的谦虚。你们前期在一起容易来电，就像磁铁一样相互吸引，又相互排斥。狮子如果陪伴太多，会让瓶子感到束缚；但相处太少，狮子有会感到孤单寂寞，矛盾的心理让狮子不知所措。狮子是自尊心超强的星座，如果瓶子在人前表现的过于随便和不礼貌，就会让狮子心生厌恶。由于你们都是个人性格特别强的星座，所以在碰到意见不合的时候就会各执已见，容易发生争吵。"
    },
    "B巨蟹座+G巨蟹座": {
        "girls_horoscope": "巨蟹座",
        "results_rvw": "相处和谐的一对",
        "paired_proportions": "50:50",
        "precautions": "蟹子太过于敏感和情绪化，他们难以管理自己的感性和情绪，只有去寻找新伴侣，接着新恋情来填充自己的不安全感。他们每次在恋情上都是用情至深，而离开时又是那么的迅速和悄无声息，好比我轻轻的我走了，正如我悄悄的来。蟹子是属于居家肥宅型的，两个蟹子的人在一起，那活动范围就可想而知了，估计两人都蜗居在小城堡里了。这就是您们最需注意的事情了，“气氛”对您们而言极其重要。由于蟹子记性特别好，在吵架时都喜欢翻旧帐，把陈芝麻烂谷子的事情都拿出来吵了又吵，互揭伤疤。小吵怡情，大闹伤感情。还好你们都可以在事后冷静下来。",
        "boy_horoscope": "巨蟹座",
        "pairing_idx": "80",
        "longevity_idx": "4",
        "compassion_idx": "4",
        "love_advc": "两个同为巨蟹座的人，有着相同的特质，无论是行为模式还是观念有极为相似。是相互依赖、相互拥有，合得来的一对。但同时双方都是由月亮来守护，因此情绪也很多变。蟹子的敏感多情，使他们有不必开口，就能察觉别人心事的本领。但有不顺时都喜欢闷在心里不愿倾诉。蟹子渴望安定、居家。渴望建立家庭的想法会在感情进入稳定期的时候更为明显，蟹子认为只有尽快完成结婚生子，人生才能得以圆满。在这一点，两位蟹子是不谋而合的，你们是能够建立令人羡慕的家庭一对。"
    },
    "B射手座+G射手座": {
        "girls_horoscope": "射手座",
        "results_rvw": "相处和谐的一对",
        "paired_proportions": "50:50",
        "precautions": "两个人都天生的自由派，有着一颗不安定的心，因此在对爱情约束的分寸总是拿捏不准。虽说你们都不想碰家庭琐事，但还是得去共同负担和解决。当你们两人的感情生活慢慢趋于平淡时，要记得随时互相协助，给感情注入新鲜度和活力，这样才能克制住你们心中那颗“花心”。射手座的人虽然天性乐观，但情绪不稳定，忍耐度也有限，在遇到挫折或感情低潮时，就会负面情绪满满，不要奢望射手有坚毅的表现。爱情是有要舍弃精神的，你们之间只要能舍弃那么一点儿的自由和自我，给多点忠诚，那你们就很容易成为相知相守的快乐恋人。",
        "boy_horoscope": "射手座",
        "pairing_idx": "80",
        "longevity_idx": "4",
        "compassion_idx": "4",
        "love_advc": "两个人同为火象星座，火象星座的特点就是活泼、开朗，两个同是射手的人一起谈恋爱，犹如脱缰的野马般，是活跃、活力特强的组合，彼此有太多的共同点，所以相处起来特别愉快。在生活中你们都有各自的朋友圈，你们给对彼此的空间都很大，因为你们对爱情的自由度极高，谈起恋爱来是轻松自在。你们的朋友圈如果能合并起来最好，如若不能，那至少给对方保留自己的私人空间。虽然说射手不喜欢被束缚，但并不表示不会管对方，更多时候，他们希望把对方掌握在自己手里，当然这种希望很片面，也很难说清楚。但当两个人在这种片面的欲望升华时，就会造成冲突，关系也就难以维持下去。"
    },
    "B射手座+G巨蟹座": {
        "girls_horoscope": "巨蟹座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "60:40",
        "precautions": "蟹子那种如母爱般的爱恋开始时会令个性有些毛躁的射手感受到恋爱的甜蜜感。但射手玩心太重，对射手来说生活就该自由自在、无羁束；而蟹子总是想牢牢的拴住射手，这样压抑的爱用不了多久，射手将会受不了，甚至认为蟹子是种负担。射手在面对蟹子的情绪化时，特别是负面的情绪，射手总是有无言以对的无力感，若是蟹子以哀怨的眼神看着射手，那射手此时只有一个念头~三十六计走为上计！其实蟹子这么做只是想粘着射手，照顾好你。蟹子想要掌握好射手的心，必须得花费耐心。你们要想相处的好应该培养共同兴趣。蟹子要试着丰富自己的生活，放开自己的个性，这样才能更好的跟射手相处辖区，你们的感情也会上升。虽然蟹子很黏射手，但却不喜欢射手打扰她的私密空间，所以也不要让你的社交生活，干扰到你们的私人感情世界。",
        "boy_horoscope": "射手座",
        "pairing_idx": "40",
        "longevity_idx": "2",
        "compassion_idx": "2",
        "love_advc": "射手是不愿粘家型，家庭观念薄弱；而蟹子是恋家、完全居家型的动物，家庭观念十分之中。这样看，你们两个倒是很符合传统的一内一外的典型。可事实是你们的差距相当大，如果事情不认清的话，就在一起，那两个人就会非常辛苦。蟹子个性内向、保守，射手则开放、好冒险，两个人性格虽大相径庭，但也会相互吸引。射手如果能突破蟹子的内心防线，会表现出温柔和亲密关怀，这种感觉会让蟹子感到很棒。最初，蟹子会被射手的乐观所吸引，但相处时间久了，蟹子会发现射手无法给她最基本的安全感，于是就开始痴缠，这是射手最忌讳的，于是你们就会开始争吵。"
    },
    "B天蝎座+G狮子座": {
        "girls_horoscope": "狮子座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "42:58",
        "precautions": "蝎子和狮子在一起，应该是非常轰轰烈烈的，可惜一个显山露水（狮子），一个寓藏于内（蝎子）。要知道你们两个脾气都很冲，一旦吵起来简直就是天雷勾动地火，一发不可收拾哦。如果狮子已经被蝎子所吸引，那就请狮子一定要心胸更宽广，让蝎子知道你的爱是开朗有温暖的。在你们之间，虽然狮子占了很大的天生优势，但不要低估蝎子，蝎子的潜力可能会超乎想象的强。若狮子能坦白的去面对蝎子，也许能缓解你们之间的对比率。如果能彼此间的关系能沟通好，那你们组成无敌搭档的几率还是很大的。",
        "boy_horoscope": "天蝎座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "你们俩可谓是天王（蝎子）斗地王（狮子），也可以看作是阴王（蝎子）和阳王（狮子），你们都是个性和主导性最强的星座，如果能做到惺惺相惜，相知相融，那威力真的是所有星座里最强大脑组合，没人能敌得过你们。狮子善于辨别事情的真实与虚伪，喜欢揣测对方的心思。可蝎子总会打击狮子的自信。狮子说话和做事，也总喜欢凡事挑明来，这在性格内敛，喜欢静静观察的蝎子眼里，会认为狮子套过于做作、浮夸。而狮子就会认为蝎子有些阴险。如果是这样，那这样的恋爱还有什么好谈？"
    },
    "B天秤座+G天秤座": {
        "girls_horoscope": "天秤座",
        "results_rvw": "相处和谐的一对",
        "paired_proportions": "50:50",
        "precautions": "秤子感情细腻，生活上充满诗情画意。他们性情温和，气质儒雅，但总是带有淡淡忧伤，放在一起看似乎有些矛盾。秤子总是事情的正反两面寻找平衡点，以至于对任何事情都很难下决定，最后还经常把简单的事情搞到复杂化，真是让人伤脑筋。你们也会因要找到两把秤子的平衡点而产生矛盾，解决方法最好就是共用一把秤子去衡量事情。你们只要在衡量天秤上少盘算点得失，彼此多点真诚，用客观心平气和的态度去衡量对方，那会有和谐有多姿多彩的一对。最后要记住多点沟通，因为你们都渴望优质生活容易不切实际，许多事情都要坦白相对才好。",
        "boy_horoscope": "天秤座",
        "pairing_idx": "80",
        "longevity_idx": "4",
        "compassion_idx": "4",
        "love_advc": "两个天秤座的人走到一起，简直就是魅力和品味的大集合。双方能够了解对方想要的优雅的生活环境，舒适的生活品质和愉快的社交圈。所以你们看对方是越看越顺眼，默契又合拍，能配合对方的规律去好好相处。秤子智商极高，很擅长察言观色，能客观判断出事物的是与否，为此在对待对方时会很苛刻。你们知道对方的弱点和有点，这是两个秤子谈恋爱的优势所在，但你们却无法互补不足。秤子感情细腻，喜欢发号施令，在这方面需要多加自制。"
    },
    "B巨蟹座+G处女座": {
        "girls_horoscope": "处女座",
        "results_rvw": "相濡以沫的一对",
        "paired_proportions": "44:56",
        "precautions": "你们两个性格比较内向的星座，所以你们鲜少在热切中开展你们的交往。在刚开始时，蟹子会有所保留，不够信任处女座的感觉。虽然两人一见如故，但彼此之间似乎缺少能让感情升温的一把火。巨蟹座需要安全感和安定感的天性，能够得到处女座的体谅和怜惜；而处女座对于细节方面的挑剔，巨蟹座刚好也能满足。最后，处女座要切记，不要把处女座优秀的头脑分析用在巨蟹座的家人朋友身上，无论处女座的逻辑多精彩，评论多精辟，巨蟹都会跟处女座翻脸。",
        "boy_horoscope": "巨蟹座",
        "pairing_idx": "90",
        "longevity_idx": "4",
        "compassion_idx": "5",
        "love_advc": "巨蟹座属于土象星座，处女座属于水象星座，同属阴性星座，所以俩人在基本上有些类似但又不会太像。俩人在大方向相同，小方向相合，是温馨优雅的一对。巨蟹座和处女座在初次相遇时，会有种奇妙的亲切感，双方虽然不一定赞同对方的观点，但却能了解与体谅且相互鼓励。处女座和巨蟹座在一起时不会感到有太大压力，也许巨蟹座的水相特质给了处女座镇静安定。处女座能放松地开心做自己。蟹子男生喜欢念旧，在蟹子为逝去的美好时光而感伤时，处女座往往能及时给予安慰和鼓励，两个人是能够一起互相扶持走下去的！在恋情上，双方的互动一般都相当合谐，但是处女座的人要舍弃一些小气斤斤计较与啰哩啰嗦的毛病，在巨蟹座的热情慷慨下，彼此都各具本事!在互相学习，互相包容下才能创造出稳实渐进的佳绩。"
    },
    "B白羊座+G双子座": {
        "girls_horoscope": "双子座",
        "results_rvw": "相濡以沫的一对",
        "paired_proportions": "44:50",
        "precautions": "白羊座个性急，脾气坏，双子座喜欢自由。在生活上白羊座男生如果能尊重双子座女生的内心和自由，双子座女生也能体谅白羊座男生的坏脾气，会这样就会少很多冲突。双子座男生是那种行动迅速、脑筋好，个性温顺的类型，和白羊座比是属强势，但白羊座个性也很好强，绝不会甘于落后，所以要注意这一点，懂得适度谦让羊儿。还有双子座在思考方面不要过度跳跃，羊儿如果一追不上，个性火爆的羊儿就会成为一座活火山，这样就会引火自焚了。",
        "boy_horoscope": "白羊座",
        "pairing_idx": "90",
        "longevity_idx": "4",
        "compassion_idx": "5",
        "love_advc": "白羊座属火象，双子座属风象，两者都是同属阳性星座，加上个性也很相近，大家都是乐观一族。由于两个人的生活态度和方式接近，双子和白羊结合更添趣味。白羊有着不死守原则，喜欢求变求新的特性，很迎合双子的口味，两者在一起能激发出新东西。他们的生活和爱情不会乏味，事业上也能携手并进，所以这一对组合在一起会永葆青春。"
    },
    "B双鱼座+G巨蟹座": {
        "girls_horoscope": "巨蟹座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "48:52",
        "precautions": "鱼儿和蟹子能够建立属于自己共同的小天地，你们会全新全意地投入到恋爱当中。你们都是情绪化的星座，对方的一举一动都会牵动彼此的心弦，温柔、感性是你们共同的语言。鱼儿浪漫有不切实际，感情起伏较大，处于主导地位的蟹子就要多发挥自己的踏实稳重，在鱼儿畅享梦游的时候，把鱼儿往现实世界拉一把。你们都非常在意对方，但凡事都有度，凡事不要太抓紧，有时要懂得放松，凡事都太在意的话，时间久了，就会触发矛盾。有问题了就要今早解决，不要憋在心里。两人都是温柔体贴、善解人意的，所以有矛盾都会很容易调和。",
        "boy_horoscope": "双鱼座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "鱼儿和蟹子同是水象星座，在初次见面时就有一见倾心的感觉，相互吸引而心意相通，两个人在一起简直就是天造地设的一对。你们注重感情的交流，在爱情观上，蟹子重视稳定和实际的爱情，鱼儿要求全心全意的照顾和爱情。鱼儿都是温驯谦恭的人，他们就像海绵一样会吸收别人的委屈。鱼儿容易陷入恋爱，这一点跟蟹子是半斤八两。蟹子和鱼儿谈恋爱，鱼儿能感受到蟹子的敏感，能体贴蟹子。鱼儿和蟹子有个共同点，就是都懂得体贴人、善解人意。"
    },
    "B狮子座+G摩羯座": {
        "girls_horoscope": "摩羯座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "40:60",
        "precautions": "你们两个想要长久相处，那律己律人的摩羯就要学会称赞狮子，不需要说违心的话，不需要美丽的辞藻，只需学着表达情感就好。狮子其实是个很容易满足的人，摩羯适时给狮子掌声和夸奖，那狮子会很快乐地为摩羯做每一件事。有时候狮子难免会得意忘形，但他仍旧是很讲道理的，而且狮子的喜怒哀乐都写在脸上，不用摩羯猜来猜去那么辛苦，只要摩羯不要用训教的口吻来教导他，他还是会接受你的建议。两个人在一起生活时，摩羯凡事都会精打细算，喜欢用悲观主义看待事情，什么事情都喜欢埋心里；而狮子喜欢花钱大手大脚，看待事情会从乐观出发，在这点上你们倒是比较互补。跟狮子相处，摩羯只要不灭狮子威风，有事情摊开讲，把话说开了反而对两人都好。就算与狮子争吵，不管场面多火爆，以摩羯冷静的个性，总不会太难看。要知道：别看狮子霸气，其实狮子有着一颗害怕孤独的心，受了伤也得笑嘻嘻的说好。所以摩羯对狮子要懂得包容和迁就。",
        "boy_horoscope": "狮子座",
        "pairing_idx": "40",
        "longevity_idx": "1",
        "compassion_idx": "3",
        "love_advc": "狮子是火象星座之王，摩羯是土象星座之王，因为有谋略和沉得住气被称为万王之王，跟狮子天生是王不见王的局面。两个星座一动一静，个性强悍，且有强烈的企图心，要命的是个个人的想法都非常极端。霸气、阳刚的狮子遇上忧郁严谨的摩羯，除了强烈企图心外，几乎是没有其他交集了。对于狮子作风海派、好大喜功、天生强势架人的性格，喜欢一步一脚印的摩羯来说，可能会看不惯。同样，狮子也觉得摩羯太过于心机，做事太过谨慎。狮子看起来是比较好搞定的一方，因为狮子有什么都会摊开来说，而摩羯一般都是选择逃避话题，有时遇到争执，摩羯看不过眼，处于下风时，表面看来没反应，其实已在心底盘算如何应付，狮子最怕就是这样。你们最后的结果如何，那就要看你们的基础怎样了，你们一个明争，一个暗斗，两人在一起实则是一对异类组合。人生观方法都不相同，唯一的共同点就是都有远大抱负和野心。"
    },
    "B处女座+G天秤座": {
        "girls_horoscope": "天秤座",
        "results_rvw": "小吵小闹的一对",
        "paired_proportions": "54:46",
        "precautions": "在处女座的心里，他们一向认为责任、形式、过程、动机是相辅相成的，不想承担后果的事就不要去做，特别是感情之事。因此，秤子在接近处女座时一定要考虑清楚，自己是否真的喜欢处女座，因为秤子的游戏态度对处女座来说，等同于是在玩弄感情。在处女座的爱情之路上并不容易有好结果，天秤座对处女座来说是个不错的选择。当然成功与否，还是取决处女座的表现。因为处女是个很挑剔尖酸的人，在初相识时，两个人会相谈甚欢，但相处久了，秤子就受不了处女座时常对她们的缺点指指点点。虽然你们都是思考型的人，但论起冷静和分析能力，秤子还是比处女座稍逊一筹，所以秤子千万不要去和处女座争论。只要你们肯坦诚相对，处女座一定会给天秤座很大自由空间，不会绑住秤子。",
        "boy_horoscope": "处女座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "力求内外平衡的风象星座秤子喜欢处女座，很大的原因在于秤子希望处女座的优秀分析能力和实事求是的态度来帮助平衡。秤子渴望别人把她们当女神去爱，秤子喜欢被崇拜。但和处女座在一起后，处女座经常会用自己严格的要求去对待秤子，对于秤子的缺点处女座会直言不讳地批评。这些批评，对秤子来说，就像一盆冷水浇灭了她们对处女座的热情。天秤座和处女座都喜欢理性、和谐的氛围，也都有着文雅的品味，都是崇尚开发智慧的爱美者。两个人有这么多的相同点，很容易让两个人产生认同感。不过，处女座得弄清楚，和秤子是两个不同的典型，要不然的话，当处女座希望秤子给意见时，却发现秤子那鞭辟入里的见解句句逼得处女座～想要逃，偏偏注定要落脚。"
    },
    "B天秤座+G白羊座": {
        "girls_horoscope": "白羊座",
        "results_rvw": "相吸相斥的一对",
        "paired_proportions": "50:50",
        "precautions": "刚开始时，你们会因为对方身上的不同多相互吸引，因为你们能从对方身上发现自己多没有的东西。但在真正交往后，你们才会发现彼此间并没有共同点。总的来说，羊儿和秤子在一起想要相互吸引又不致命的话，就是相互学习，取长补短。秤子虽是一个不善于表达的人，但他的爱意可以深入到你生活中的点点滴滴，对羊儿的撒桥和诉求，有求必应。秤子的优雅和从容也是值得羊儿学习的地方，所以爱上秤子~~也没那么糟！",
        "boy_horoscope": "天秤座",
        "pairing_idx": "60",
        "longevity_idx": "2",
        "compassion_idx": "4",
        "love_advc": "羊儿阳光乐观，做事有目标，永远都有一股冲劲，力求完美。羊儿很欣赏秤子的美感和品味，但又相当受不了秤子的没原则和主张，凡事都要反复思量。而羊儿做事欠缺考虑与急躁的性格，对秤子而言，根本是粗鲁又没大脑的表现。其实秤子凡事反复思量可以看作是办事稳妥，凡事三思而后行，比羊儿多了一份理性和稳重，是一个踏实的男人。但如果不深入了解，那就会产生排斥了。"
    },
    "B水瓶座+G水瓶座": {
        "girls_horoscope": "水瓶座",
        "results_rvw": "相处和谐的一对",
        "paired_proportions": "50:50",
        "precautions": "虽然两个瓶子的人在一起没有明显的强弱关系，但一旦意见相左就可能会出现各执已见的情况。你们的固执可能会让你们为了一件事而辩论一整天，所以遇到这种情况不要分得太清楚，要多为对方着想。你们都是以相敬如宾的相处方式交往，本来热情的火花就不够多，若总是固执已见引起争执的话，你们的感情就有点岌岌可危了。你们的人生观和价值观相近，都会彼此尊重，多为生活注入浪漫，多点甜言蜜语，少点冲突和口角，相信你们会更好。",
        "boy_horoscope": "水瓶座",
        "pairing_idx": "80",
        "longevity_idx": "4",
        "compassion_idx": "4",
        "love_advc": "要说12星座里哪个星座最了解水瓶座，那当然是水瓶座自己了。两个水瓶座的人相遇，就像是透过镜子看自己一样的了解对方，你们的关系就像相识多年的老朋友一样，虽然平淡如水却可以情意长久。瓶子天马行空的奇思妙想也只有同是瓶子可以一起畅想。瓶子才华横溢，喜欢自由自在、无拘无束。两个瓶子凑在一起这些特点就更加明显突出了，你们都有大胆的想象力，共同的爱情观。只是，时间一久，可能会因疏忽而缺少一点爱的火花，这点要特别注意。"
    },
    "B双子座+G水瓶座": {
        "girls_horoscope": "水瓶座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "52:48",
        "precautions": "双子座和水瓶座都是风象星座，在各方面的感觉都很神似。所以初次相识时，会很容易就对对方产生好感，并急速堕入爱河。双子和瓶子在一起，两人都能对彼此敞开心胸接纳对方，而且会给双方保留很大的空间，不会让爱情成为束缚。两人默契十足在各方面上的配合都堪称最佳拍档。但如果想维持两人长久的关系还得靠经营，无论生活中多忙碌，都要记得为彼此预留多点时间。双子和瓶子都是不缺伴侣的类型，若是不多留点时间给对方，为对方留个爱的位置，等到目标越来越远时，就可能会掉头而去！",
        "boy_horoscope": "双子座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "双子座和水瓶座在某些方面是很相像，两人都具有很好的人缘，有极具时代感和新潮。两个同是风象星座的人相遇，可以特征表现的淋漓尽致，所以两人在初见之时便很投缘，像一对无话不说的朋友，有说不完的话。两人是亦师亦友，爱情和友谊共存共荣，彼此信任、互相尊重的完美组合。别的星座和你们交朋友时，通常都会不知如何是好，因为彼此之间态势总是有点暧昧；但双子和瓶子普遍都能在开放、自然的关系中相处，能彼此分享内心的想法和感受，可以给予彼此大的空间。双子和瓶子都有自由而豁达的观念，他们谈恋爱时，会比一般情侣来得潇洒，不会将爱情变成自己不开心的压力，能够把握好两人相处的度。会把关系处理得既亲近又不会太黏腻，介乎在爱情和友情之间，会与对方分享，而且两人不会有隔夜仇！"
    },
    "B摩羯座+G金牛座": {
        "girls_horoscope": "金牛座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "48:52",
        "precautions": "摩羯和牛儿在一切讲究实际的这一点上很是相投，但牛儿可能会因为摩羯面具下的冷漠而退缩。牛儿不要以为自己的耐力能扭得过摩羯，搞不好他比你还行。随意牛儿面对摩羯时最好要有足够的耐心，等摩羯的理智和爱情达到一致妥协时，那摩羯将会是牛儿最好的伴侣。",
        "boy_horoscope": "摩羯座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "摩羯和牛儿同属土象星座，你们之间没有惊天动地的浪漫恋情，有的只是细水长流的绵延之情，你们一个沉稳，一个谨慎，是磁铁般互相吸引的默契满分组合，只要一个眼神就知道对方想什么。你们在开始相处时，会彼此互相摸索一段时间，当认定彼此时，你们就会一起生活。牛儿很欣赏刻苦又耐劳的摩羯，而且摩羯的难追也激起了牛儿征服的欲望。但摩羯可是擅长戴面具做人的星座，他们的冷漠可能会让牛儿花更多时间去酝酿爱，甚至会裹足不前。"
    },
    "B天秤座+G狮子座": {
        "girls_horoscope": "狮子座",
        "results_rvw": "相濡以沫的一对",
        "paired_proportions": "56:44",
        "precautions": "对于喜欢掌权、强势的狮子来说，遇到秤子，无形中矮了半截，这对习惯称王的狮子恐怕难以接受。在你们的感情里，可能这点就是狮子唯一的遗憾，不过还好狮子是个宽容大度的人，不会将这些表面化。狮子是恋爱狂热份子，非常多情而性感的，而秤子对异性很有品味。狮子要想和秤子在一起的话得有心理准备，秤子对于爱和不爱总是三心两意摇摆不定，所以狮子一定要有足够耐心和秤子打消耗战、持久战。就算秤子对你有好感，也不要表现得太兴奋，你得若无其事地耐心等待回复。两人的恋情过于多元复杂，这可能是双方可能还在互相试探的结果。若狮子勤于甜言蜜语的练习，可以得到秤子罗曼蒂克的爱。",
        "boy_horoscope": "天秤座",
        "pairing_idx": "90",
        "longevity_idx": "4",
        "compassion_idx": "5",
        "love_advc": "风象的秤子和火象的狮子，两个都是阳性星座家族的一员，且位置和排列角度成吉角，是投缘的一对。狮子在某些事上太喜欢用自己的方法，因而显得固执。这点秤子好多了。秤子要多多表达自己真实的爱，不必仅以实际刻板的方式。两个人看对方都挺顺眼，秤子爱美、爱社交与狮子爱排场、好呼朋引伴的个性，不谋而遇，你们在一起会是很醒目的组合。"
    },
    "B巨蟹座+G摩羯座": {
        "girls_horoscope": "摩羯座",
        "results_rvw": "相吸相斥的一对",
        "paired_proportions": "50:50",
        "precautions": "冷静理性的摩羯在情感上是可以左右和帮助蟹子的情绪，平衡下蟹子的感性和多愁善感，然鹅，摩羯并没有发现此项超能力，并且好好利用它。往往蟹子的多疑和醋劲一上来，摩羯第一时间想到的就是躲开，其实那是蟹子在试探摩羯，蟹子想看看摩羯的反应，希望得到摩羯的肯定，更想知道摩羯内心的想法，这样自己才能更好配合摩羯，但摩羯却一直忍着不说。通俗一点来说，就是蟹子在乎摩羯。与蟹子相处，要善用截长补短的方法，用成熟稳定的态度跟蟹子相处。其实摩羯的忠实和信赖特质已经能给蟹子想要的安全感了，但在爱情进行中，光有安全感是不够的，更需要温言软语和体贴，要知道，爱情还是需要甜言蜜语来调剂的。摩羯要多发挥自己女性温柔的一面，去融化蟹子。",
        "boy_horoscope": "巨蟹座",
        "pairing_idx": "60",
        "longevity_idx": "2",
        "compassion_idx": "4",
        "love_advc": "虽然说土象星座和水象星座都是阴性星座，在理论上是一对能够相亲相爱的组合，可也许是星座位置恰好是对宫位置排列，让你们既相互吸引又相互排斥，且颇有缘分和宿命的纠缠。摩羯会因蟹子认真的态度和善解人意的性格着迷，但也会被蟹子阴晴不定和极度无安全感的脾气打败。蟹子爱摩羯那种如父兄般的尊严及稳定的安全感，却同时会受不了摩羯的“面无表情”。摩羯座的姑娘是十分有责任感的，她们会想让自己的另一半开心；而巨蟹是自私，他们又会利用摩羯座的责任感，向摩羯座提诸多要求，这样就会令摩羯座很抓狂。因此你们能否长久地在一起，就看你们的努力咯。"
    },
    "B狮子座+G双子座": {
        "girls_horoscope": "双子座",
        "results_rvw": "相濡以沫的一对",
        "paired_proportions": "56:44",
        "precautions": "喜欢交友狮子和爱好交际的双子，在社交方面是很相合的，他们不会刻意去阻碍对方的人际交往。但狮子与生俱来的霸气，容易让狮子喜欢一切以自己为中心，对双子施以过多的要求和约束，要双子过于顺从狮子，这样就相当有强制的“狮（私）爱”来对双子。双子可是会跟狮子虚与委蛇一番后，就会渐渐疏远狮子。其实狮子与双子这样的活泼浪漫的组合，大抵可以用平常心去交往，狮子绝不要为了维持自己的王者风范，而吝于对双子施以温柔。要知道，善于交际，吃得开的双子，她的选择绝非只有狮子一个。",
        "boy_horoscope": "狮子座",
        "pairing_idx": "90",
        "longevity_idx": "4",
        "compassion_idx": "5",
        "love_advc": "华丽尊贵属火象的狮子，和处事圆滑的双子，都是阳性星座，且位置相近，会是靓丽的一对。在面对古灵精怪、多变的双子时，狮子有时也会很无奈，觉得双子捉摸不定，但双子会因狮子的豪爽大气而被打败。狮子若能表现大方，让双子没有“伴君如伴虎”的压迫感，那双子也是很乐意留在狮子身边。在恋爱中，双子为了不让狮子受伤会处处保护着狮子，双子知道狮子的弱点，也知道他虚荣心强，容易受挫。所以双子出自本能知道该如何去对待狮子。双子会用仰慕、敬佩的眼光去看待狮子，使狮子确信自己被双子所需要，是双子的保护神、是双子的支柱。这样一来，狮子的渴望得到了满足，狮子也就更心甘情愿地为双子献出爱，献出一切。"
    },
    "B金牛座+G射手座": {
        "girls_horoscope": "射手座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "60:40",
        "precautions": "热情四射的射手遇到一个步调慢、刻板保守的牛儿，实在是蛮崩溃的。比如：牛儿为什么如此压抑，为什么如此认命，为什么有的事情不在乎、有些事有说不通？这些都是令到射手头痛，百思不得其解的疑问。其实牛儿用情至深，他明知道两人不适合，但只要爱上，就会认命爱下去。只要射手隔三差五地在牛儿面前晃悠，让牛儿习惯射手的存在，这样牛儿可能就会因此爱上射手。同时如果射手能认同牛儿的刻板保守、凡事多虑、不会交际的原则，让牛儿的热情大火持续燃烧，不要认为射手被牛儿所束缚，那你们还是有可能的。但如果你们的人生观和价值观没在事情认清，那还是会……！",
        "boy_horoscope": "金牛座",
        "pairing_idx": "40",
        "longevity_idx": "2",
        "compassion_idx": "2",
        "love_advc": "天性开放的射手与温柔木讷的牛儿，是火象星座对上土象星座，可以说两个星座是风马牛不相及，思维逻辑全然不同。就算因好奇而相互吸引聚在一起，但想牵手长久，那还是颇难的。牛儿做事喜欢有计划，按部就班；而射手做事则是想到什么就做什么，完全没有计划。在发生不愉快的时候，牛儿一般会选择沉默，而射手则是健忘。射手如果真的爱牛儿，那请切记：绝不要永无止境的欺负牛儿，牛儿虽在金钱上有算计，但绝不会吝啬；牛儿在娱乐方面不精通，但只要牛儿有能力，绝不会让射手沉闷。不要以为牛儿木讷沉默，射手就我行我素，一旦超过牛儿的忍耐极限，牛儿就会一去不回头。"
    },
    "B双鱼座+G处女座": {
        "girls_horoscope": "处女座",
        "results_rvw": "相吸相斥的一对",
        "paired_proportions": "50:50",
        "precautions": "处女座是个固执的星座，而鱼儿恰恰相反。讲原则的处女座看到鱼儿那种不会拒绝的作风，会觉得鱼儿很滥情，但又会被鱼儿的贴心所打动。由于性格的差异，你们很容易产生误会，你们要是在一起，那就要相敬如宾，互相包容学习，去接受对方的缺点，学习对方身上的有点。处女座爱上鱼儿，就要懂得欣赏鱼儿的艺术气息，不要去刺破鱼儿的梦想。遇到问题首先要心平气和的想一想，然后一起分析解决，减少误会的产生。",
        "boy_horoscope": "双鱼座",
        "pairing_idx": "60",
        "longevity_idx": "2",
        "compassion_idx": "4",
        "love_advc": "处女座做事认真，对人对己都要求很高，是典型的完美主义者，而鱼儿爱幻想、散漫，跟处女座根本就是相反的类型。但也许是因为这种差异性，反而容易让你们对对方产生一种很强的吸引力，但经过长时间的交往后，发现原来又是另一回事。鱼儿天真烂漫，善于感受他人的情绪，这点让处女座很是心动。同时鱼儿也会被处女座的知性气质所吸引，觉得处女座很聪慧。你们都有一颗温柔敏感的心，只是表现方式不一样，但也许正是这种差异让你们彼此眼前一亮。"
    },
    "B射手座+G摩羯座": {
        "girls_horoscope": "摩羯座",
        "results_rvw": "小吵小闹的一对",
        "paired_proportions": "54:46",
        "precautions": "射手爱好自由，常常喜欢四处走动，而且因为射手性格开朗、说话不拐弯抹角，常被误认很八卦，其实这都是因为射手很忠于自己的性格，且热情的缘故。射手看似难以定性，但是他们一旦认定目标，就像离弦的箭，没有回头。射手的步调与摩羯的截然不同，但还是可以走得通，只要摩羯用鼓励和支持的态度去配合射手。射手的目标很多，不会像摩羯只会为一个目标努力，而且会随着年龄和环境而变化。摩羯对于射手的随性的性格很不能接受，但摩羯可以尝试学习射手身上的行动力。在和射手交往前，摩羯就应该知道射手的社交魅力，所以不要因为射手的广阔社交圈而对他日渐丧失信心。你们在一起就应该多花时间去培养共同的兴趣爱好，这样你们小两口的日才会有滋有味。",
        "boy_horoscope": "射手座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "射手和摩羯是位置相邻的两个星座，虽说星座的象性不同，但由于他们的“地缘”关系，还是可以看得出他们之间仍有根红线牵着，只要机会合适就有可能牵动情愫。但会是有很多烦恼的一对，因为彼此的观念存在很大的不同。射手和摩羯看似八竿子也打不到一块，但他们本身就如同是神话中半人半兽的动物，都有潜在的兽性，有着很强的企图心。不过不同的是，射手多为自由乐观，而摩羯则悲情务实。有理想抱负的摩羯总想着去修正射手的人生观，但往往都被射手那我行我素、理直气壮的无辜样气到没辙。你们的爱情往往发生在射手的工作瓶颈或财政困难之时，当射手心情无处靠岸，摩羯会给予他很多心灵的帮助，于是主见好感倍增。你们之间想要维持长久关系，那一定要多了解对方，互相学习，取长补短。"
    },
    "B水瓶座+G双子座": {
        "girls_horoscope": "双子座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "48:52",
        "precautions": "瓶子和双子都是属于智慧，追求新潮的人，这样的共同点使你们更加水乳交融。而且瓶子个性随性如风，不会给双子带来太多的束缚力。你们若能信任彼此、分享新事物，那爱情自然就会多姿多彩。你们两个人在一起后，会因为有许多兴趣的事情要做，而留给对方的时间较少，你们最好多抽些时间相处。如果一直忙碌下去，没有时间去培养感情，那双方的认同感就会逐渐消失。",
        "boy_horoscope": "水瓶座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "同是风象星座的两个星座，彼此间很容易产生一种惺惺相惜的感觉，是一对非常来电的星座CP。瓶子自由开放，双子多变思维敏捷，两个人对新事物接受能力强，你们一旦撞在一起就是天雷勾地火，你们能在最短时间内找到共同话题和兴趣，聊起天来根本停不下来。瓶子和双子都是很自由豁达的，由于你们开放自然的关系，两人在一起会很轻松、潇洒。你们之间有彼此独立的空间，压力不会出现在你们的爱情中。双子可以接受瓶子的思想行为，瓶子可以理解双子，你们在一起简直就是天造地设的一对。"
    },
    "B白羊座+G水瓶座": {
        "girls_horoscope": "水瓶座",
        "results_rvw": "相濡以沫的一对",
        "paired_proportions": "56:44",
        "precautions": "白羊座不喜欢看见自己伴侣与异性朋友在一起，所以在这方面水瓶要严谨些，为了维持幸福，请不要引起不必要的误会。瓶子常常觉得羊儿心智不成熟，往往表现的有些过于任性、太孩子气，冲动过度的话会演变一发不可收拾，这时瓶子就要发挥亲切的温情天性安慰羊儿。羊儿和瓶子是孩子性格，所以更多时候都是空想家，瓶子有天马行空想法，但羊儿会更疯，会冲着瓶子的想法去实现。运气好的话，你俩会一致合拍，行动力和想法会很配合；但不对劲的话，都以自我为中心的你们，会因此碰壁，相互说再见的情形就会出现。",
        "boy_horoscope": "白羊座",
        "pairing_idx": "90",
        "longevity_idx": "4",
        "compassion_idx": "5",
        "love_advc": "两个星座都是阳（男）性星座，容易相通契合，互相吸引，两者有很多共通之处，是一对多彩多姿、活跃亮丽的组合。羊儿和瓶子很容易沟通，瓶子聪明智慧，和求变求新的羊儿很是恰合。而且俩人人生态度很相近，都是孩子气性格，对任何事物都充满热情和好奇，因此沟通起来很容易，搭档起来更是无往不利。"
    },
    "B天秤座+G双子座": {
        "girls_horoscope": "双子座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "52:48",
        "precautions": "最好的组合搭配就是有点相同又有点不同，有立足点相似的思考模式。双子和秤子都是享乐主义的主，个性也是外向型的。秤子是个有品位的男人，双子是一个对美有一种永无止境的追求。在许多情况下两人的想法都可以不谋而合，默契十足，彼此都被对方的锋芒毕露所吸引。你们都爱变、爱新鲜，秤子喜欢把爱情当游戏，这和双子爱新奇刺激的性格很相通。你们的容忍度相当低，特别是对生活日常琐事，可是无论多小的事，总得有个人出来做。所以，你们在给予对方独立的空间上，还要把共同空间的事给理清楚。两个人在一起永远都保持着新鲜的话题，是交互式的关系，你们都不喜欢被束缚的感觉，向往多姿多彩的生活，即使是柴米油盐的生活，也不会感到乏味。",
        "boy_horoscope": "天秤座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "天秤座和双子座都同属风象星座，在初次见面时就会产生惺惺相惜、一见如故的感觉，彼此敞开心扉。这对于迅速放电的双子来说可能就是家常便饭；对个性温和、会自然对异性放电的秤子来说，也没什么大不了。两个人相处下来，偶尔难免会出现一些小矛盾，但是所有的冷战矛盾一般都会在预料之中很快地消失无踪。两人相处完全就是已经达成了一种共识互相迁就，而往往很多时候，想法都是如出一辙，心有灵犀的感觉那是一种无与伦比的幸福。你们的波长一致，会产生共振的机会比较大。你们可能不会有如火如荼的炽热的爱情，虽不见得像火象星座般亮丽耀眼，但也是很外向、多采多姿。同时也不会像土象星座那样平实平淡，而是介於这两者之间的融洽的组合。"
    },
    "B处女座+G天蝎座": {
        "girls_horoscope": "天蝎座",
        "results_rvw": "相濡以沫的一对",
        "paired_proportions": "44:56",
        "precautions": "处女座在和蝎子的相处过程中，对蝎子自责、自析能力很敬佩，不会像其他星座那样惧怕蝎子。而蝎子和处女座相处，喜欢凡事都主导的处女座，很满足这种被自己掌握的现状。当然，蝎子也是很疼惜自己的伴侣。但不要忘了，两个星座都是那种肯为爱牺牲的人，只要能忍受，彼此都不会将不满倾诉，这样就会导致缺乏坦诚沟通，长时间下去就会出现问题。在完美的追求上，你们的观点和方式都不一样，处女座更多的会要求从过程细节得结果；而蝎子则眼光放得较远，注重于大结构，这样的过程可能会有点跳跃，这是处女座不能接受的。处女座和天蝎座往往会因为对方的特质而相互吸引，在这么多星座中，蝎子比其他星座更能理解处女座做事的沉静和忧虑。你们互相之间有一种独特的影响，这影响能使你们各自接受对方的弱点。",
        "boy_horoscope": "处女座",
        "pairing_idx": "90",
        "longevity_idx": "4",
        "compassion_idx": "5",
        "love_advc": "土象星座的处女座和水象星座的天蝎座，同是阴性星座。处女座专情，蝎子深情，你们两个遇上可相互依靠。在交往过程中，蝎子会主动去保护、尊重和爱戴处女座的男生们。蝎子要想得到处女座的爱，一定得慢慢来，不可操之过急。你们看对方都很顺眼，有了好的开始，只要耐着性子等待时机再表达就好。你们都是心思缜密、性格较内敛的星座；蝎子有地王之称，是个强势的星座，是独占型的专情；而处女座是梦想的纯情派，你们一强一弱，一正一负，属性又相搭，是很紧密坚实的一对。"
    },
    "B处女座+G双子座": {
        "girls_horoscope": "双子座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "42:58",
        "precautions": "你们两个都是属于聪明、反应快，还略带点神经质、知性的类型，但你俩的方向不太一样。对于处女的批判和琐碎，双子座常常感到不以为然；而处女座则认为双子座没原则，人前一套人后一套。因此，如果真的喜欢处女座就的必须了解处女座的认真和求好心切的性格，双子座也要帮助处女座把握好时机，凡事都不要过于顾虑。双子座吸收知识的广度和速度，是及其能博取到处女座的好感，但在他们面前，一定要言行前后一致，因为坚守原则的处女座，会有道德洁癖。尽力让双子座了解处女座的诚信原则，并不是不知变通，学著“人性化”一些，您们才有牵手一生的可能。",
        "boy_horoscope": "处女座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "性格多变的双子座和细心谨慎的处女座，虽然俩人的守护星都是代表知性的水星，但他们是两个不同的典型，一个是为了成社交宠儿，一个是为了实用。刚开始时你们也许觉得会是彼此的特色，可是想要细水长流的相处，那就会有点吃力了。双子座和处女座如果不是经常见面，只是偶尔聊聊，那么还可以成为好朋友。可惜一旦只要一起生活，马上就会变成敌人。处女是冷静的思考族，而双子座则是思维跳跃的思考型，单单双子欠缺实践、实行的这一点，就足够令处女座抓狂了。双子座那种吊儿郎当的态度，会气死小器量的处女座，在用钱态度上更甚，双子座不停花钱买新鲜无谓东西的行为，常引起吝啬成性的处女座不满。久而久之两人只会对对方产生更多的不满，而当初吸引对方的优点，也在互相埋怨中被忽视。"
    },
    "B天蝎座+G巨蟹座": {
        "girls_horoscope": "巨蟹座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "52:48",
        "precautions": "蝎子的爱情观和蟹子的那种急需保护的个性很相投，不过就算两人默契再佳，也要时时沟通，切勿总把事情憋在心里，这样就算不闷死，也容易造成误会。对着蝎子，蟹子应当发挥铁钳般的母性，让蝎子感受到你对爱情的忠贞。其实不管是谁，对待爱情就该专情专一，只不过蝎子更需要蟹子如此。在面对问题和发脾气时，蟹子会退缩，蝎子碰了钉子也会郁闷，都喜欢钻进各自的洞穴里。这种解决方法，对两个人来说简直是糟糕投了。你们需要的是彼此深入交谈，把心中的不满说出来。把不满和怨恨深埋，这种方法，直呼让小小矛盾演变成更大的冲突，对你们的关系百害无一利，最终还会摧毁你们的关系。",
        "boy_horoscope": "天蝎座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "蝎子和蟹子都同属水象星座，在初次见面就会产生投缘的感觉，默契和情感，会随着一步步的交往而更加浓烈。蟹子遇到蝎子时，会对他们神秘的诱惑难以抗拒。为了对蝎子有更多的了解，蟹子会将内心的胆怯置之度外。蝎子喜欢挑战，蝎子遇到蟹子时，要想让害羞的蟹子完全信任自己那是件相当容易的事。蝎子表面虽然看起来温和冷静，其实蝎子的醋劲威力相当大，奉劝蟹子千万不要勾起蝎子的醋劲，尤其是你那些过去的罗曼史，不然后果自负哦！切记切记！"
    },
    "B双子座+G巨蟹座": {
        "girls_horoscope": "巨蟹座",
        "results_rvw": "小吵小闹的一对",
        "paired_proportions": "54:46",
        "precautions": "你们两个虽然有许多立足点不同的相似，例如双子的善变和蟹子的情绪化；双子的健谈和蟹子的言论等，但你们彼此之间仍需要多沟通，因为不同的结论也有可能会在不同的过程中迷失方向。你们都不是主导性类型的星座，但蟹子的超强占有欲，对双子来说可能是一种束缚。不过在你们的关系中，蝎子是强势的一方，所以蝎子尚不觉得严重，只要蝎子坦诚相待，相信还是会有值得期待的未来。还有在工作上，你们也是一对很好的工作搭档！",
        "boy_horoscope": "双子座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "风象星座的双子座和水象星座的巨蟹座，本来是两个不相干的类型，但因为位置就近的缘故，而且巨蟹座也是经由双子座演变而来的，所以，两者之间还是存有些微妙情愫，不至于一看就相厌。双子用理性看爱情，蟹子用感性，相处之后，意见不合，矛盾顿生。敏感的蟹子如果想要与双子共浴爱河，那就得把钳子收起来，即使要用，也得控制力度，一旦钳伤双子，他是会走的，别忘了双子是善变的星座！"
    },
    "B双子座+G天蝎座": {
        "girls_horoscope": "天蝎座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "40:60",
        "precautions": "双子和蝎子都是好奇宝宝，你们的不同点在于：蝎子是发自内心的购物欲，而双子是因为对四周的事物敢兴趣。既然出发点不同，那为人处事的态度、价值观生命观也必然会不同。你们如果不试着去了解双方在本质上的区别，那你们两个就像两条平行线，永远没有交点。蝎子就算外表再怎么不在乎，但对认定的爱人蝎子可是一心一意、掏心掏肺地去爱；而双子则不同，双子需要的不是有个人守着他；双子对朋友总是博爱和讨好，但到了某种程度就会变为冷淡，对自己的爱人也是一样。所以爱上双子的蝎子要有所准备，不要对双子要求太高，给他空间，不要去束缚他。",
        "boy_horoscope": "双子座",
        "pairing_idx": "40",
        "longevity_idx": "1",
        "compassion_idx": "3",
        "love_advc": "天蝎座属水象星座，双子座属风象星座，蝎子深沉如水，双子敏捷如风，即使风吹水动，你们也不会有太多的交集，两个人完全没有共通点，需要长久的爱情，还真的要奇迹出现。你们俩都是聪明反应快，在一起就如大智慧对决一样。虽然开始时，蝎子会时常被双子轻快灵敏的魅力所吸引，但在深入接触后，蝎子就会因双子的自我和冷漠的本质，不是蝎子所需要的，而感到失望。同时双子也会因蝎子的神秘性而被吸引，但也会因蝎子的强烈热力，而被吓得逃之夭夭。"
    },
    "B处女座+G白羊座": {
        "girls_horoscope": "白羊座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "60:40",
        "precautions": "条理分明、心思缜密的处女座眼中的羊儿是很莽撞的，好像没什么头脑一样，这让爱挑剔的处女座实在是无法忍受。在和羊儿一起后，处女座对羊儿有种恨铁不成钢之感。在处理事情方式上两个人也是不相同，处女座习惯凡事预的，而羊儿则习惯不加思考就冲出去。还有处女座凡事都不要过于太碎碎念了，这样会让羊儿感到很难受，不如换种不动声色，潜移默化的方式去感化羊儿，这样会很好的改善你们的关系。若办不到，那你们的相处之路那就相当坎坷了。",
        "boy_horoscope": "处女座",
        "pairing_idx": "40",
        "longevity_idx": "2",
        "compassion_idx": "2",
        "love_advc": "爱冲动、豪迈大气的白羊座和神经质、爱挑剔的处女座在一起，实在是没想到有什么交集，而且问题还多多。生活中大多数处女座的人基本对易冲动、看来积极又强势的羊儿会感到兴趣。处女座男生一般都不能接受羊儿那种方便式的恋情，所以处女座都不喜欢羊儿的生活圈过于活跃。羊儿一开始和处女座相处时，可能会被他的细心和体贴所吸引，可是相处时间一久，羊儿就受不了处女座这种漫步缓跑式的爱情。而且对处女座什么都爱斤斤计较的性格，极其厌烦。如果两个人执意要在一起的话，也不是没有发展的可能了，只是要付出比其他人更多的爱。"
    },
    "B巨蟹座+G双子座": {
        "girls_horoscope": "双子座",
        "results_rvw": "小吵小闹的一对",
        "paired_proportions": "46:54",
        "precautions": "双子的多变，往往会使蟹子抓不到双子行事的边，让蟹子有很深的不安全感；双子左右逢源的人际关系，在蟹子眼里或许会成了轻佻的左拥右抱。两个人的人生观不同，双子用理性看爱情，巨蟹用感性，相处之后，意见不合，矛盾顿生。巨蟹缺乏安全感，他们的蟹钳有时会将双子箍的太紧，让双子透不过气来，一旦用力过度，钳伤双子的话，双子会走的。蟹子和双子虽然会互相分享自己的心事和故事，但在沟通方面还是要注意技巧，蟹子的敏感有时候会招架不住双子的幽默，一部小心就会弄成混乱的局面。",
        "boy_horoscope": "巨蟹座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "内向的巨蟹座和外向的双子座，两人有着很大的差异，看似不太搭调的两个星座却能擦出火花来，也许是距离位置较近，“近水楼台”的缘故，你们之间还有有着微妙的情愫感应。双子和蟹子谈恋爱，原本只是“搭讪”的心态，但情往往不知所起，一往而深，短暂的快乐交往让双子有了继续发展的想法。感性的蟹子能很好地get到双子的幽默健谈，当蟹子失落时，双子能够用她独特的幽默来安慰受伤的蟹子，为蝎子加油打气。但生活不一定总是欢乐的，在欢乐的感觉淡去之后，如何往下走，是两位都要思考的问题。"
    },
    "B处女座+G双鱼座": {
        "girls_horoscope": "双鱼座",
        "results_rvw": "相吸相斥的一对",
        "paired_proportions": "50:50",
        "precautions": "双鱼座在面对专情的处女座时就得认真的点了，该安定那颗漂浮不定的浪子心，不要再“拈花惹草”。通常你们感情出事，那就可能是双鱼座给处女座捉到去“偷食”的证据，成为决裂的导火线。处女座不会轻易地爱上一个人，他对感情的选择很谨慎，处女座会看清楚鱼儿是真心还是玩玩而已。实际的处女座，不会浪费任何多余的感情，一旦确定了鱼儿是处女座的目标后，处女座就会管住鱼儿，用他那流利的“吐槽”功夫来纠正鱼儿的坏习惯。粗心的鱼儿如果看不出处女座的一片苦心，那肯定会被处女座的严格标准所逼疯掉。不要以为处女座只会唠唠叨叨，天性就乐于奉献的处女座，在生活上他们还是会帮鱼儿处理日常的大小事，把鱼儿当小孩握在在手心疼。在相处过程中，处女座感觉到自己被需要，因而感到快乐，处女座喜欢双鱼们给他们带来的被需要感。",
        "boy_horoscope": "处女座",
        "pairing_idx": "60",
        "longevity_idx": "2",
        "compassion_idx": "4",
        "love_advc": "处女座代表的土象星座和双鱼座代表的水象星座，都是阴性星座。但你们的星座位置排列是180度对宫，很多东西都是两极相反的。双鱼座的妹纸是极其敏感的，她们对事情有预见性，能看透别人的心思，能感受到别人的氛围，能够体会到别人的快乐和悲伤。所以和处女座在一起，鱼儿可以很清楚地了解到处女座的想法，不管处女座有挑剔和麻烦鱼儿都可以接受。你们两个虽然都有着温柔纤细、敏感和爱幻想的天性，但你们的表现方式和逻辑却完全不同。这种差异性会让你们一时间眼前一亮，可是随着时间推移，你们交往越深，这种差异造成的就是对立。"
    },
    "B天蝎座+G水瓶座": {
        "girls_horoscope": "水瓶座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "58:42",
        "precautions": "瓶子崇尚精神自由，是个理想主义者，口才人缘都相当好，但这些特质在遇到瓶子后就好比泥牛入海——消沉了。蝎子的嫉妒心和占有欲强，总是束缚着瓶子喘不过气来。因此，瓶子在被蝎子那神秘魅力吸引时，一定要想想自己那喜欢自由、博爱的天性，是否能适应瓶子的爱情观。其实蝎子和瓶子的观念一样，都是充满了坚定的自信心。蝎子在最初遇见瓶子时，会被瓶子那标新立异、大大咧咧的个性勾起好奇心。虽然你们的分数低，但只要愿意一起努力改变，永久成双的机会还是会有的。",
        "boy_horoscope": "天蝎座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "蝎子和瓶子基本是两个世界的人，因为在你们身上难以找到交集点，虽然彼此间有难以捉摸的吸引力，但很勉强。你们之间不可能不争吵，但总能保持和谐，每次争吵之后，你们都会明白如何去和对方相处，能学到更多东西。瓶子要记住，蝎子可是不好处理的，别看蝎子很会讲理，头脑又清晰，但在面对“负心”的人时，蝎子是很强势，绝非是个弱者的姿态。"
    },
    "B巨蟹座+G天秤座": {
        "girls_horoscope": "天秤座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "58:42",
        "precautions": "在刚开始时，敏感内向的蟹子会被秤子的优雅迷人以及谈吐气质产生短暂的吸引，秤子一个眼神就能让蟹子入迷。在相处一段时间后，蟹子会发现自己面对着一团迷雾，纵然美丽浪漫，却极度没有安全感，会令自己更加敏感。秤子对爱情，常常是你进他退，你退他进，但一旦爱上了，秤子的乐观温和会令蟹子感到很快乐。蟹子在面对秤子时最好就是有话直说，不要藏着掖着，不要让秤子猜来猜去，久而久之秤子就会被蟹子阴晴不定的情绪而吓跑。秤子一遇到问题就会选择逃避，不愿去面对，对于需要安全感和安定感的蟹子来说，秤子恰恰是无法给予的。如何中和、取得平衡，正是你们多需要正视的。",
        "boy_horoscope": "巨蟹座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "巨蟹座的情绪化和因追求和谐常发生内在冲突的天秤座，乍看之下或许有些类似，但立足点是截然不同的，所以这组CP是不太适合。尤其在两人的个性与对生活的看法上，且您们又都不是个性强的主导星座，所以您们是都要努力调适的一对CP。蟹子和秤子都是爱好和平的，秤子为了保持和平，有时会愿意说谎，粉饰太平；而蟹子则会牺牲自我，用自己的母性去维护和平。由此可见，蟹子和秤子虽然有着相同的方向，但也难有相交的一天。蟹子和秤子对于金钱的使用持相反态度，秤子对于金钱没有执着的追求，但金钱能够让蟹子安心有安全感，一旦蟹子拥有了物质和情感的双重保障，蟹子就能把最好的一面展现给另一半。"
    },
    "B金牛座+G天蝎座": {
        "girls_horoscope": "天蝎座",
        "results_rvw": "相吸相斥的一对",
        "paired_proportions": "50:50",
        "precautions": "你俩都习惯把事情放心里，但思考逻辑却又不相同。蝎子是为了要看清四周情势而放慢动作，牛儿则是等自己充分了解情况后，准备好情绪而动作慢。基本上你俩都是重感情的，行事步调和处理方法也大同小异，只要能相互信任，就可以在彼此的身上找到忠贞及自己的优缺点。你俩都是固执性格，在你们之间，蝎子通常是比较强势的一方，但当牛儿的犟脾气一上来，那气氛变得紧张。虽然有争执也不会闹到天翻地覆的地步，你们只会选择“冷战”，在这点上你们还是很同步，可对相处上来说，是很不利的一点，这样只会让误会无从解释。不想让误会隔阂愈来愈深，那就尽量把话说清楚、取长补短、相互学习。你们的最佳相处之道就是培养共同兴趣。",
        "boy_horoscope": "金牛座",
        "pairing_idx": "60",
        "longevity_idx": "2",
        "compassion_idx": "4",
        "love_advc": "金牛座和天蝎座在星座排列上呈180度，且都同属阴性星座，性格外冷内热。俩人都占有欲强且热情如火，外表看起来沉稳温柔，可以一旦爱上就活力十足。你们站在对岸互望，彼此都强烈地吸引对方，但也有紧张的气息，因为你们都是让人一眼看不清的星座，是爱是恨？很难定论！但要记住：想要点燃牛儿的爱火，蝎子就得学会耐心和坦白！牛儿不喜欢夸张不实的感情，而希望感情细水长流，恋情逐渐稳定成长。"
    },
    "B白羊座+G巨蟹座": {
        "girls_horoscope": "巨蟹座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "58:42",
        "precautions": "蟹子和羊儿相处，显然是处于被动的一方，羊儿在个性、主导性方面都要比蟹子强。蟹子想要一直拉住羊儿这颗时时想突破、不稳定的心，就会变得很神经质。在跟羊儿相处时，蟹子切记不要闹情绪，这只会让羊儿跑得更快。不如对羊儿保持尊重和呵护的态度，拿出对孩子的相处方式与之相处更适合。同时女方在情绪低落时，男方应及时给予同情，不要恶言恶语相向。",
        "boy_horoscope": "白羊座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "外向的白羊座配上内向的巨蟹座，有些伤脑筋，总是显得不搭调。因此这是很辛苦的一对。蟹子敏感，遇到事情，第一反应就是逃避，这与勇往直前的羊儿很不相同，但羊儿的积极火热个性也正是敏感的蟹子所缺乏的，通过这样的平衡保持和自身调整，也有可能喜结良缘。"
    },
    "B射手座+G天秤座": {
        "girls_horoscope": "天秤座",
        "results_rvw": "相濡以沫的一对",
        "paired_proportions": "56:44",
        "precautions": "射手和秤子对爱情都是缺乏坚持和耐心，秤子游离不定的性格和射手四处走动的个性，会使你们很难维持一段感情。秤子虽然不容易安定，但仍然是需要伴侣的。射手喜欢顾自己，厌恶一切束缚他自由的事物。虽然秤子尊重射手的放任不羁，自己也不愿受到太多的压力，但责任和稳定是婚姻的重要元素。在恋爱的过程中，通常都是由热情的射手来主导，而秤子也很愿意配合，但要想牵手一生，射手可能就没有这般热情了。所以你们该培养共同的兴趣来稳固关系，为彼此的感情加温，就算没有热恋温度，也可以过一世了。",
        "boy_horoscope": "射手座",
        "pairing_idx": "90",
        "longevity_idx": "4",
        "compassion_idx": "5",
        "love_advc": "火象的射手和风象的秤子是标准的一拍即合型，不仅同属阳性星座，而且排列也成吉角，同样喜欢享受和自由。因为你们爱热闹又好玩，因此初次见面后就很快的在一起了。你们的恋情充满活力和乐趣，你们之间即使一方只想玩玩，另一方也不会太认真。但现实生活可不光是玩，就可以走下去的，虽然说婚姻不是每个人的最终目的，但至少还有大部分人是想要个归宿的。不过你们两个人好像对婚姻都不太热衷。两个人那种得过且过的心态让很多人不好看你们，但你们都喜欢自由简单快活的生活方式，希望随时和一大堆友人共同嬉笑玩闹。"
    },
    "B狮子座+G狮子座": {
        "girls_horoscope": "狮子座",
        "results_rvw": "相处和谐的一对",
        "paired_proportions": "50:50",
        "precautions": "两个狮子座的人在一起，其实成为好朋友的比列要比成情侣的几率要高，因为你们高傲性格使然，让你们都不肯甘于人下。但狮子座的人喜欢有活力、开朗、光鲜的人，如果有幸遇上跟你一样德行的，不如放下自尊心、放下身段去全力追求。两个狮子座在一起要懂得彼此尊重，多点宽容，毕竟你们都是高傲之人，不要凡事都要占上风，多点给对方面子，不要处处让对方难堪。如果不给予足够的尊重，那后果是很严重的。同样作为狮子座，一定会明白自尊受到伤害的难受，多点为对方着想，你们的感情将会更加甜蜜。狮子的性格都光明正大的，你们在表达不满时不要拐弯抹角。如果要维持你们的感情，那要做的就是放下身段和对方好好相处。",
        "boy_horoscope": "狮子座",
        "pairing_idx": "80",
        "longevity_idx": "4",
        "compassion_idx": "4",
        "love_advc": "两个同是狮子座的人牵手，共同的华丽、贵气、热情，会让你们之间很容易产生共鸣。并且两个人有着相同的性格和脾气，都有很强的自尊心，个性固执好强，在你们的关系中，谁都不肯低下自己那高贵的头颅，要是争吵起来肯定会地动山摇。但只要你们稍微把自尊心收敛下，那这些问题都会得以解决。狮子座男生和狮子座妹纸在一起，实则是一对欢喜冤家，你们要么爱得轰轰烈烈，要么就是老死不相往来，这都是源于你们的高傲和固执。两狮相争，必有一伤。只要你们做到像前面所说，稍微收敛下你们的自尊心，那你们就是一对火热的组合，你们的贵族气质如太阳般耀眼夺目，将会成为人群中万众瞩目的焦点。"
    },
    "B摩羯座+G白羊座": {
        "girls_horoscope": "白羊座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "58:42",
        "precautions": "羊儿喜欢快节奏的生活，而摩羯却总是慢半拍，你们一个热情，一个冷淡，唯一共通点就是大家都要争做主人。摩羯座的老谋深算，可以说是斗争高手，缺乏持久性的羊儿难免不是摩羯的对手，所以在明争暗斗中，通常都是摩羯座获胜。但羊儿也不是那种甘于俯首称臣的典型。因此，当你们在热恋和迷惑中清醒过来时，总是会发生不少的冲突。在争吵中，星座比重较重的摩羯稳占上风，但羊儿不会乖乖投降，仍然屡战屡败。在面对羊儿时，建议摩羯座少些严肃气息，不要老刺激羊儿；不妨用摩羯深思熟虑的个性去摸透羊儿，这样自然就可以抓住羊儿的心。羊儿对你百出挑衅态度时，你也不妨一笑置之。羊儿可以在摩羯身上找到她没有的稳固性和忍耐力，而摩羯可以由羊儿身上学到乐观积极面对事情。最后就是不要无意挑起战端，俩人个性强，一有争执很少有妥协可言；无法避免时，不妨离开冷静下。你们在一起的分数虽低，但也不是没可能，如果想拥有长久爱情，适度的表达和心灵沟通会对你们有帮助。",
        "boy_horoscope": "摩羯座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "摩羯座是土象星座，而白羊座则是火象星座，这两个星座在一起基本没有交集，唯一比较相近的就是都有着好胜好强的企图心。老谋深算的摩羯座爱上莽撞的白羊座，恐怕会抵挡不住白羊座凌厉的攻势。在与羊儿初次相识时，摩羯会被羊儿的热情与激情所打动，无论羊儿是否有勇无谋。而摩羯那种安静深沉性格，能给缺乏耐力的羊儿提供帮助。但俩人个性都太强，要想维持感情还得调和一下，付出了努力，在一起也不是完全无望。"
    },
    "B天秤座+G金牛座": {
        "girls_horoscope": "金牛座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "60:40",
        "precautions": "沉稳笃定的牛儿，实在是很难理解秤子那变化多端的逻辑，这种难以适应又无法改变的现状，让牛儿感到极其难受。所以当牛儿想爆发时，也说不出个所以然来。牛儿如果真的要与秤子牵手到白首的话，就要试着去了解，牛儿决定事情是凭感觉和思考，而秤子则是通过知识收集和反复讨论，你们的思维逻辑不同，那发生冲突是在所难免。牛儿特别在意安全感，无论是生活还是爱情，都希望对方给到一种安稳实在的感觉。所以对于缺乏安全感的牛儿，秤子要用点时间来关爱，不要一味沉浸在自己的社交圈，而牛儿也要多些宽容，这样两人才能更好地相处。",
        "boy_horoscope": "天秤座",
        "pairing_idx": "40",
        "longevity_idx": "2",
        "compassion_idx": "2",
        "love_advc": "虽然秤子和牛儿有共同的守护星，但除了这个，秤子和牛儿好像就没有其他交集了，你们想要天长地久的爱情，还是需要点奇迹。秤子热爱社交生活，牛儿温柔善良，却缺乏热情，属于居家型的女人。秤子和牛儿在一起，分工就比较明确了，男主内，女主外的组合，各司其职，为彼此爱情共同努力。"
    },
    "B天秤座+G水瓶座": {
        "girls_horoscope": "水瓶座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "48:52",
        "precautions": "秤子和瓶子在面对感情抉择时都是犹豫不决的，秤子遇上瓶子就如蜗牛遇上乌龟，会在爱与不爱之间墨迹老半天，如果你们俩这么一直挣扎太久的话，那你们的感情就有可能永远停留在朋友阶段。胆怯是无法获得幸福的，要勇敢大胆地迈出去。秤子不是那种为爱苦苦奉献的情痴，但也需要爱情来滋润，但瓶子却招呼朋友，没把太多时间放在爱情上。瓶子不要试着栓着秤子，爱他就做他的好朋友，这是你们相处愉快的关键。瓶子虽然是个不喜欢黏着爱人的人，但也是想要得到爱人的呵护，在这方面，秤子得多多花点心思了。",
        "boy_horoscope": "天秤座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "秤子和瓶子之间有点像又有点不像，你们适合从朋友开始交往，在零负担下会促使你们的爱情迈向永远。秤子讲求自我空间的完成，喜欢活在自己感到舒服的生活里，讨厌不安与冲突，追求和谐的人生；而瓶子是个是个博爱主义者，认为每个人都是独立的，有自己的生活原则和生活方式。虽然你们路线有异，大方向却是没差。"
    },
    "B天蝎座+G白羊座": {
        "girls_horoscope": "白羊座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "40:60",
        "precautions": "外冷内热的蝎子和热情活泼的羊儿，彼此间可能会有短暂的激情，可相处时间一久，两个人的性格差异就会呈现。两个人都很情绪化，一件小事就有可能成为你们争吵的导火线，很容易爆发冲突。蝎子和羊儿想要长久交往，学习相互包容很重要。最好方法当然是培养共同的爱好了，这样就有助于两个之间的沟通。羊儿在情绪方面永远都是不成熟的，蝎子对羊儿在这方面就不要太苛刻。最后切记：即使要分手，也得好聚好散。",
        "boy_horoscope": "天蝎座",
        "pairing_idx": "40",
        "longevity_idx": "1",
        "compassion_idx": "3",
        "love_advc": "蝎子和羊儿以星座角度来看，角度并不吉，距离也太远了。一个天王，一个孩子王，粉辛苦。你们在一起需要一点奇迹。可是命运总是喜欢开玩笑，羊儿会被蝎子神秘魅惑的气质吸引，而蝎子喜欢羊儿那种不设防不用小心眼的性格。但不过了多久，羊儿发现蝎子爱挑剔，谨慎多疑，让人好压抑；而蝎子也会嫌羊儿太缺心眼，太容易动情。当初那些彼此吸引对方的优点都成了烦恼。"
    },
    "B射手座+G处女座": {
        "girls_horoscope": "处女座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "42:58",
        "precautions": "力求完美主义的处女座对于很容易恋爱有很容易转移目标的射手座实在是难以把握，内心总是不够踏实，缺乏安全感。射手座生性自由，最不能忍受婚姻的约束，他们向往外面的花花世界，觉得家居生活太浪费时间生命。爱上射手，处女座要做好挑战的准备。射手的活力和行动力都是处女座所欠缺的，要想抓住射手的心，除了委身配合外，还要在行为处事，要以射手座为主处女座为副的模式去相处。在相处的过程，你们最好培养共同的兴趣爱好，这样才有牵手一生的可能。",
        "boy_horoscope": "射手座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "热情奔放的射手座遇上严谨内向的处女座会有短暂的相交，彼此间有相当程度的欣赏。但不久后，都会因为性格观念不合而最终散场。你们之间因为缺乏维系的动力而感到很辛苦。你们一个是神经大条的射手座，一个是富有批判精神的处女座；一个是出手豪爽的射手座，一个精打细算的处女座，你们在一起事前一定一定要先认清楚个性上的差异。最好还能以长时间培养共同的嗜好，要不然搭配起来那吵架是避免不了的。其实大部分的处女座开始注意到射手座的存在，都是因为射手有孩子式的天真，不识人心险恶；但处女座没想到，射手的天真完全是因为爱自由所致的，不要看他们对人毫无防备，其实骨子里可是很主观的。"
    },
    "B天蝎座+G摩羯座": {
        "girls_horoscope": "摩羯座",
        "results_rvw": "相濡以沫的一对",
        "paired_proportions": "44:56",
        "precautions": "在摩羯座眼里，蝎子有种独特的魅力，也许不是很浪漫，但安全感十足。摩羯在刚开始与蝎子接触时，也许不一定马上有印象，要在真正交谈后，才会有越来越亲切的感受。你们两个都是性格内向，属于“沉默是金”型，不喜欢东拉西扯，喜怒不形于色，习惯将心事藏在心中，虽然你们能催彼此敞开心胸，能感受到对方的情绪。，但情感还是需要表达的。你们都是好强、内敛之人，一旦有意见不合，就会出现冷战的可能，所以，有心事得说出来。跟蝎子相处，摩羯最好记住不要闹别扭，因为蝎子会更别扭，蝎子是吃软不吃硬的，扭着扭着，最后就是说拜拜啰。",
        "boy_horoscope": "天蝎座",
        "pairing_idx": "90",
        "longevity_idx": "4",
        "compassion_idx": "5",
        "love_advc": "水象的阴王——蝎子，土象的万王之王——摩羯，你们的速配程度很合，同为阴性星座，个性也倾内向，会是一对无声胜有声的组合。你们的共同点都很专情、有企图心，个性强绝非软弱无能型。由于内向的性格，你们都喜欢把心事闷在心底，蝎子尤为厉害，能做到表面平和的像一点事都没有发生过，不负阴王之称号。你们有共同的目标，但在实现目标的具体做法上你们不能达到一致。你们都彼此信任，才能不遗余力求大同，才能达到共同成功。你们的组合是合则利，分则两害的组合。"
    },
    "B双鱼座+G天秤座": {
        "girls_horoscope": "天秤座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "60:40",
        "precautions": "鱼儿虽然和秤子一样是星座个性不强的人，但鱼儿敏感，特别是你秤子常常搞不清楚鱼儿为什么会情绪突然转变。你们在一起不能给对方安定感，感情起起伏伏，情绪那就更不稳定了。鱼儿和秤子在一起要注意的是，多站在对方的角度去考虑问题。秤子要适当地放弃些道理，让自己稍微倾斜些。要善用自己的口才和鱼儿谈心，让爱幻想情绪不稳定的鱼儿安心。两人在一起要多沟通交流，有怨及时化解。",
        "boy_horoscope": "双鱼座",
        "pairing_idx": "40",
        "longevity_idx": "2",
        "compassion_idx": "2",
        "love_advc": "鱼儿富有魅力，充满浪漫气息，这点让秤子很心喜。秤子和鱼儿在一起虽然表面看起来很温和，但由于星座排列的角度不是很适合，你们实则是两个世界的人。你们在一起都会让对方感受到不安全感，你们容易让人爱，同时也容易爱上人。还好你们两个都有很高的敏锐审美能力和艺术天分，且观察能力极强。你们若是真心相爱，那会是最有创意的伴侣，生活会充满温馨和浪漫。"
    },
    "B处女座+G射手座": {
        "girls_horoscope": "射手座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "58:42",
        "precautions": "处女座对射手座的爱情态度是很抵触的，处女座对待爱情是谨慎、努力、专一的，他们对爱情都具有牺牲精神。而射手座爱一个人，虽说也会全心全意地去投入，但不会为了配合对方而改变自己。面对这些差异，两个人如果不好好沟通，就会可能使当初让对方欣赏的特质变成厌恶的缺点。对于处女座那一板一眼，对小事斤斤计较啰里啰嗦的个性，射手是及其厌烦。但射手座有没有想过，那是处女座认为凡事要成功根本在于过程能否按理而行。处女座只是怕射手粗心大意而一直在一旁提醒而已。何况射手天生豪爽，出手大方，对金钱根本没有概念，小家计算的处女座又怎么看得过眼呢？射手座喜欢刺激和冒险，但这对处女座来说是无法忍受的事物。但射手如果能理解并接受处女座对射手的操心和照顾，并且能证明自己也是个有勇有谋的人，那处女座也许会放心射手去冒险。这样相处起来不是很 Happy吗？毕竟，处女座对爱情是有为爱牺牲的理念。",
        "boy_horoscope": "处女座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "生活中总喜欢对事情哈拉过去的射手座，要和富有批判和挑剔的处女座相爱，一定得先认清楚个性上的差异。要想有牵手的可能，最好就是长时间培养共同嗜好。否则~那就等着分手咯。内向细致的处女座遇上热情四射的射手时，两人会彼此欣赏，有短暂的相交。射手很敬佩处女座的智慧和细心，而处女座则会被射手的处事明决、热情开朗所迷惑。在相处后，你们会因理念的差距而有着相当大的距离感，因缺乏维系关系的动力而感到辛苦。特别是处女座刚好是个缺乏幽默感又不够乐观的人。可是如果爱挑剔的处女座能用宽容的态度来对待射手的缺点，让射手看到处女座那更为开朗的一面，那你们彼此的距离就会更近一些。"
    },
    "B摩羯座+G天蝎座": {
        "girls_horoscope": "天蝎座",
        "results_rvw": "相濡以沫的一对",
        "paired_proportions": "56:44",
        "precautions": "在最初的时间里，蝎子会被摩羯那种成熟稳重的性格所吸引。摩羯认为蝎子是个懂得照顾自己的人，不用为蝎子太费心，就在一起了。可随着相处久了，就会发现彼此间都不出声，气氛非常沉闷，彼此之间还缺乏沟通。恋爱的氛围是需要培养的，摩羯和蝎子要注意这点。你们喜欢将感情藏于心，但爱情是需要表达的，需要柔情蜜语去滋润。你们俩的人生目标相似，总是喜欢埋头苦干，两个人遇上会激发潜力，因为有稳固的支持，往往会事半功倍。由于两个人都性格内敛、好强的人，稍微有意见不合，就会出现“暗杆”的局面。因此，你们如果有不愉快，最好不要憋心里，说出来才是解决的王道。",
        "boy_horoscope": "摩羯座",
        "pairing_idx": "90",
        "longevity_idx": "4",
        "compassion_idx": "5",
        "love_advc": "土象的摩羯和水象的蝎子，两人同为阴性星座，且都个性内向，是一对沉稳、无声胜有声的思考型配对。蝎子很少能和他人谈得来，但面对摩羯却能彼此容易沟通。摩羯和蝎子都挺朴实，他们不擅长社交，不会做太过惹人注目的事，就算有，野心都会藏在肚子里。你们觉得成功不是靠嘴巴说出来的，要有实际行动。因为天性使然，你们都想出人头地，都渴望手握权利。虽说你们有共同的目标，但你们实现目标的手段都不同。摩羯认为要靠自己努力，就算不成功也不会有遗憾。而蝎子认为努力干，同时还要提防别人，干就要干成功。你们之间的电波通不通，这就取决于你们的沟通和默契。"
    },
    "B水瓶座+G巨蟹座": {
        "girls_horoscope": "巨蟹座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "40:60",
        "precautions": "理性客观的瓶子和情绪主导一切的蟹子，在思考模式上是两个极端，瓶子的美丽新世界在蟹子眼中是不可思议的，蟹子会崇拜瓶子的理想和见解，却无法接受瓶子的顽固。瓶子如果想要和蟹子一起长久相处的话，就要学着收敛，接受蟹子的专情观念；蟹子也要控制自己的情绪，不要凡事太过情绪化，不要以为瓶子博爱就是花心，给瓶子多点信任，给予瓶子更多的自由和空间，瓶子不喜欢自己的自由被限制，失去自由对他们来说简直就像失去空气。瓶子不干涉蟹子的兴趣和生活空间不代表瓶子不关心，那只是瓶子对爱的一种表示。瓶子会困扰于蟹子突如其来的脾气，还会对蟹子情绪反常不定而变得脾气恶劣。",
        "boy_horoscope": "水瓶座",
        "pairing_idx": "40",
        "longevity_idx": "1",
        "compassion_idx": "3",
        "love_advc": "瓶子和蟹子是两种不同类型的存在，在你们的身上找不到什么共同点。你们就像用沙堆砌的城堡，外表瑰丽，但终究因缺乏根基而难以长久永固。瓶子都是由理性主导，而蟹子则是由感性主导。你们的思维模式和生活态度迥然不同。蟹子讲情时，瓶子讲理；而蟹子讲理时，瓶子又讲情，试问，这样怎么肯能不伤脑筋。蟹子对于爱情，要求忠贞不二；而瓶子却显得博爱，这样蟹子会对瓶子产生不安全感。"
    },
    "B白羊座+G摩羯座": {
        "girls_horoscope": "摩羯座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "42:58",
        "precautions": "性格开朗的羊儿，在面对严谨内敛的摩羯时，简直是一筹莫展。能感受到只有紧张和冲突，这对神经大条的羊儿来说实在是个痛苦的折磨。你们两个都想成为各自的领导人，但无奈你们都不是乖乖听话的主，这样发生冲突就是在所难免的了，再加上摩羯的固执，羊儿想征服摩羯是难上加难，千万不要和摩羯争强好胜，因为往往都是摩羯占上风。羊儿应以尊重的态度去表达内心的想法，让摩羯了解羊儿追求的是一份长远的关系，而不是一时的新鲜。你们在心灵上要有更多的沟通和表达，这样对你们的关系会有改善。",
        "boy_horoscope": "白羊座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "羊儿和摩羯两个人唯一比较相近之处，就是都有着好胜好强的企图心。在你们明争暗斗的过程中，由于羊儿缺乏耐久性，而摩羯正好相反，所以到最后通常都是摩羯获胜。羊儿对待感情很多时候是看感觉的，陷入爱情的速度极快，而摩羯则是慢半拍，她们凡事求稳，不会轻易陷入爱情。两人交往和结合的前途很渺茫，羊儿开始时很难接受摩羯深沉安静的性格，但羊儿缺少的忍耐力，正好摩羯能够提供，而摩羯想在实际的现实环境调合一下，羊儿正适合。虽然你们对于爱情的看法不一，也并不代表羊儿不会爱上摩羯，只要你们都努力一把，还是有希望长长久久。"
    },
    "B双子座+G处女座": {
        "girls_horoscope": "处女座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "58:42",
        "precautions": "双子座和处女座的守护星是水星，所以这两个星座的人都充满智慧、反应快，且行事会略带点神经质。虽然有这样的相同点，但两人的思维观念却不太一样。面对爱挑剔有琐碎的处女座，双子座常感到不以为然，而在处女座眼里，双子座的随性几乎是没有原则可言。处女座是很坚持原则，奉行所得的知识，所以对双子座的可变性和双重标准很看不得。但双子座跟其他的书呆子比起来，双子座的吸收知识速度和广度，还有活用能力还是能吸引到处女座，如果处女座不用实事求是的态度去苛求双子座，两人之间的压力可能会减少很多。双子座如果真的爱上处女座，就必须去了解处女座追求完美的性格。在处女座面前，双子座切记要言行一致，因为恪守原则的处女座，可能会有些道德洁癖，所以双子座一定要让处女座了解你的诚信原则否则处女座很难会托付真心，这样你们才有牵手可能。",
        "boy_horoscope": "双子座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "一丝不苟、谨慎的处女座和善变且虎头蛇尾的双子座，两个人根本就是不同类型。但爱情往往就是这么奇妙，处女座常常会被学识丰富、反应灵敏的双子座吸引。但在经过深入的接触后，处女座就会为此感到煎熬，思维会常常跟不上双子座，因为双子座变的实在太快。处女座的人不太善于交际，做事前都要考虑一遍，顾虑太多。所以就算处女座对爱情充满了幻想，却很少会为此付出实际行动去追求虽渴望的爱情。而双子座恰好是相反，他们是行动派，当他们遇到自己喜欢的人，会毫不犹豫地冲上去搭讪。"
    },
    "B狮子座+G巨蟹座": {
        "girls_horoscope": "巨蟹座",
        "results_rvw": "小吵小闹的一对",
        "paired_proportions": "46:54",
        "precautions": "温柔内向的蟹子和华丽贵气的狮子，两个看似水火不容的星座，有着相当大的差距。在这段关系中，狮子一直处于领导地位，蟹子虽属隐性，不是主导型星座，但先天比重却比狮子强，因此恰好能维持一个平衡的状态。狮子在蟹子眼中是热情的代表且攻击力十足，能够满足蟹子，使蟹子沐浴在爱之下。虽然有时蟹子会吃不消狮子的强势，受不了狮子总想做老大的心态，但换个角度想，这个蟹子的母性没什么两样。本质都是出于关怀的角度，只是方式不同而已。蟹子姑娘要懂得运用自己温柔的力量去感化这只大喵，顺着他的毛摸，相信慢慢地就会在无形中将他治的服服帖帖。",
        "boy_horoscope": "狮子座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "你们俩是会闪出灿烂光芒的组合。月亮蟹子和太阳狮子，你们两个一个是水象星座，一个是火象星座，性格相反，一阴一阳，一水一火，但又可以相互辉映，是刚柔并济的代表。当霸气的狮子遇上多愁善感的蟹子时，往往是蟹子温柔地把大喵训化。狮子外表虽然傲娇,其实内心是寂寞的，而蟹子妹妹温柔的母性、善感的性情，刚好可以帮狮子卸下威严武装，不用再演王者，好好享受来自蟹子的安抚。两人在交往过程中，是思维火花的碰撞，都能做到让对方各抒已见，求同存异。两位对彼此的包容和学习是相得益彰。"
    },
    "B水瓶座+G处女座": {
        "girls_horoscope": "处女座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "60:40",
        "precautions": "你们两个人的个性都不强，但在比重上，处女座还是差水瓶座一大截，处女座与其傻乎乎地去爱水瓶座，不如深入的去了解水瓶座。在这段感情中，处女座座要记住给水瓶座足够的自由空间，不要将水瓶座抓的死死，你抓的越紧水瓶座就越想逃离你。水瓶座要克服忽冷忽热的毛病，对处女座敏感的心，要多点关心和爱护。博爱的水瓶座对爱情是个标准的利己主义者，处女座必须要学会独立、坚强。你们虽然一开始很喜欢对方，但相处久了，两人的性格差距还是会使你们出现矛盾。你们要学会凡事多宽宽心，这样才能使你们相处的更和睦。",
        "boy_horoscope": "水瓶座",
        "pairing_idx": "40",
        "longevity_idx": "2",
        "compassion_idx": "2",
        "love_advc": "好奇的瓶子座和知性的处女座，基本上是不搭扎的两个人。处女座跟水瓶座触电，那可能是一时意乱情迷。刚开始时，水瓶座会为处女座的冰雪聪明所倾倒，而处女座也会被水瓶座的见多识广和创造力所吸引。然而相处后就会发现，处女座太过敏感容易钻牛角尖，喜欢为一些小事斤斤计较；而水瓶座总是很博爱的样子，对人忽冷忽热。处女座对这些难以接受，会觉得水瓶座思维跳跃无法理解。如果双方不能做出很大的让步和改变，两人就会渐渐疏远，感情也很难走下去。"
    },
    "B白羊座+G狮子座": {
        "girls_horoscope": "狮子座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "48:52",
        "precautions": "白羊座和狮子座虽说是命里注定天生一对的组合，可是俩人个性都是那种要强之人，因此也会偶尔发生争夺领导权、想压制对方的情况。但即便这样，也不会产生不可收拾的场面，最多也是小吵小闹。如果能把小吵小闹当成一种生活情调也是不错的。羊儿和狮子还有一个特别好的优点—不记仇，所以即便吵得再厉害，也不会离开对方。但还是要记住不要“吵得过火”，因为感情是很薄弱的，即使再相配，爱情也会越吵越薄。",
        "boy_horoscope": "白羊座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "白羊座和狮子座同属火象星座，在初次见面时，俩人如同磁铁般相互吸引，十对有九对会彼此产生爱的火花，进展快速而浓烈。俩星座在性格和观念上也近似，是一对羡煞旁人的耀眼组合。在金钱上俩人几乎没冲突，双方都是出手大方，讲究排场的人。总的来说，狮子的霸气很能“镇住”羊儿，而羊儿那种大气风格也合狮子口味。俩人的相互吸引力如天生一般，走在一起仿佛就是天注定。"
    },
    "B狮子座+G双鱼座": {
        "girls_horoscope": "双鱼座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "60:40",
        "precautions": "鱼儿善解人意有温柔浪漫，和霸气狮子一起，大小强弱一眼明了，给人感觉就是鱼儿似小媳妇，狮子则彰显了他大丈夫的气概。鱼儿如果你已经陷入了狮子的情网，那一定要记住先建立你们彼此之间的沟通方式，特别是鱼儿表达方式。你们之间最大的问题，就在于鱼儿的“软性”，不懂用强硬的语气去表达自己的想法，表现得好像是狮子在欺负鱼儿，这一点令狮子很抓狂。所以在发生矛盾后，鱼儿一定要大胆说出自己的想法，如果不能好好沟通，长此以往下去就会出现心不合的情况。同时狮子也要多多体谅鱼儿的性格，不要太过于强势，压制得鱼儿喘不过气来。只要你们两个好好改变一起去克服问题，也是可以开创幸福的。",
        "boy_horoscope": "狮子座",
        "pairing_idx": "40",
        "longevity_idx": "2",
        "compassion_idx": "2",
        "love_advc": "狮子和鱼儿，一个火象星座，一个水象星座，用水火不容来形容你们俩是再贴切不过了。不过你们之间好像有宿命一样，对于鱼儿来说，十个有半个半会喜欢上狮子。狮子也很容易被鱼儿那善解人意、温柔浪漫的气质所吸引，但当相处过后，狮子会发现鱼儿喜欢拖泥带水，同时狮子也忍受不了鱼儿的盛气凌人。而且狮子全心全意照顾鱼儿，却很难体会到鱼儿细腻的感情，你们之间缺少彼此深入的感情交流。和狮子在一起，鱼儿以为找到了可靠的依靠，但狮子有很强的占有欲和控制欲，弱势的鱼儿容易会因为爱情忍气吞声，被狮子所压制。"
    },
    "B摩羯座+G狮子座": {
        "girls_horoscope": "狮子座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "60:40",
        "precautions": "当狮子了解到摩羯所做的一切都是为了更好的明天时，狮子就不会认为摩羯无趣保守了。只是摩羯做事习惯深思熟虑，他们相信一步一脚印才通往成功的方法。他们不会用无谓的时间去做没意义的事。狮子总会觉得显露野心的摩羯总是深不可测和难以掌控，这对天生王者的狮子来说，恐怕接受不了，而且两个都是好强好胜之人，那发生冲突就是意料之中的了。狮子对摩羯要不断的给予关怀和宽容，以此来缓和你们之间的关系，而摩羯得学会称赞狮子，适时给狮子掌声。有话不要埋在心底，把话说开了对双方都好。狮子霸气的外表下，其实有着颗孤独的心，即使受伤了，依然会笑嘻嘻的说好。因此，摩羯要懂得包容和迁就，这样你们之间还是有看头。",
        "boy_horoscope": "摩羯座",
        "pairing_idx": "40",
        "longevity_idx": "2",
        "compassion_idx": "2",
        "love_advc": "霸气的狮子遇上严谨的摩羯，两人除了强烈企图心外，其他方面没有任何交集。因此你们俩不是很适合的一对。你们两个个性都很强，而且想法都很极端，一个明争，一个暗斗。在刚开始时，狮子觉得摩羯不说话、沉思的样子酷毙了，可是时间长了，狮子会发现，摩羯的智慧跟自己根本不是一个档次，就连一些简单的事也听不懂。实际的摩羯对狮子好大喜功的作风很看不惯。但狮子那种乐观大方对于不擅长社交的摩羯来说，刚好是互补的。"
    },
    "B射手座+G白羊座": {
        "girls_horoscope": "白羊座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "48:52",
        "precautions": "射手和羊儿无论是个性还是观念都极为相近和相通，之间的默契感仿佛天生一般；你们可以一起享受生活，也允许各自发展，且彼此间不会产生疏离感，有任何不愉快都不会放在心中，是极具青春朝气的组合。不过，你们的承受力不强，受不了委屈，哪怕是一丁点。射手和羊儿都有些固执，发生冲突时，容易出现互不相让的情形，好在两人相似的关系，就算有争吵也会很快忘记。你们之间要学习互相包容，给彼此间多点自由空间，这样能使你们的冲撞减轻，相处起来更容易。",
        "boy_horoscope": "射手座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "射手和羊儿同属火象星座，你们在初次相见时，射手看到羊儿的赤子之心会忍不住想靠过去，而羊儿遇到明朗率性的射手，身上立刻会有电流乱窜的感觉。你们就犹如磁铁般相吸般一见钟情，进展速度啊那叫一个快，而且情感浓烈。因为性格相近的缘故，你们会是恩爱耀眼的一对，经常撒狗粮秀恩爱，真的是羡煞旁人。射手爱好冒险和喜新厌旧的个性和羊儿的率真追求自由的性格实在是有着异曲同工之妙！"
    },
    "B双鱼座+G金牛座": {
        "girls_horoscope": "金牛座",
        "results_rvw": "相濡以沫的一对",
        "paired_proportions": "44:56",
        "precautions": "鱼儿和牛儿在一起，彼此都会令对方有心理平顺的感觉，特别是在艺术方面，鱼儿的敏感度和牛儿很契合。但要注意的是，你们都是比较被动的人，所以更成熟的牛儿就要担负起更多的责任。虽然牛儿很实际，不擅长表达，但还是要稍微配合一下喜欢浪漫的鱼儿。牛儿的踏实很能给敏感的鱼儿很大安全感，鱼儿也很欣赏鱼儿的柔情和体贴。两个人虽然十分契合，但有时对事物的看法也会出现极端的不同意见，两人最好加强沟通，多交换彼此的观点和想法。",
        "boy_horoscope": "双鱼座",
        "pairing_idx": "90",
        "longevity_idx": "4",
        "compassion_idx": "5",
        "love_advc": "鱼儿和牛儿都是那种个性不是很浓烈的阴性星座，你们有很多的互通之处。你们的交往都是由心出发，感情就像窖藏美酒一样香醇。相处越久你们越能发现对方的优点，相处起来压力不会很大，会越来舒服甜蜜。鱼儿浪漫有情调，这刚好填补了牛儿过于务实而产生的感情空缺。牛儿不擅长表达自己，对另一半的感情通常都是体现在生活的细节中，敏感的鱼儿很容意被牛儿感动。"
    },
    "B金牛座+G双子座": {
        "girls_horoscope": "双子座",
        "results_rvw": "小吵小闹的一对",
        "paired_proportions": "54:46",
        "precautions": "牛儿在面对双重个性的双子时，是十分有耐性的。而双子对牛儿的影响也是间接的，因为牛儿做事都要有个酝酿过程，而牛儿的星座个性是潜藏；由于双子的绝佳适应能力，牛儿开始是难以接受的，但只要双子有足够耐心引导，牛儿对双子的思考和行为也会很包容。牛儿最好不要过于干涉双子的社交生活，要了解双子的频繁交往，并不一定是想骑驴找马，牛儿该了解，丰富的生活是双子的习惯。牛儿是聪明的，知道双子反应快与接收资讯的习惯对牛儿有很大帮助，而双子也应该知道，牛儿能为双子的不够踏实、轻浮的个性补短。",
        "boy_horoscope": "金牛座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "沉稳踏实的牛儿和极富巧变的双子，虽然看起来各方面都有着极大差别，但好在两个星座个性都是比较温和的那种，俩人发生冲突争吵时也不会大打出手。双子能说会道，巧言善辩，会让牛儿望而却步；也许双子对自己理解能力和变通能力很自信，但若牛儿对双子不了解的话，会认为双子是夸夸其谈、表里不一的伪善者。虽然金牛座男生和双子座女生性格不一，但柔情似水的双子和稳重的牛儿是一对不错的组合，也许是因为稳重的牛儿能给予不定性的双子一份安全感。"
    },
    "B双子座+G白羊座": {
        "girls_horoscope": "白羊座",
        "results_rvw": "相濡以沫的一对",
        "paired_proportions": "56:44",
        "precautions": "总是喜欢做第一的羊儿在遇到双子时，无形就矮了半截。羊儿像爱向前冲的小莽羊，而双子则像是灵敏跳跃的小山羊，羊儿可能会因此感到有些气闷。面对变化多端的双子座，本来就很难掌控，不如换个角度，改变羊儿那种一贯向前冲的习惯，拉上双子一起走。一起构想、开发新事物，一起冒险。反正你们都是敢想敢做的理想主义者。另外，不妨把对方当成一个学习以及超越的对象，最后甚至有可能会跑到他的前面。",
        "boy_horoscope": "双子座",
        "pairing_idx": "90",
        "longevity_idx": "4",
        "compassion_idx": "5",
        "love_advc": "风象星座的双子座，和火象星座的白羊座，俩人都是同属阳性星座，位置相近且排列角度也不错。个性和行为模式也及其相近，很容易相互吸引和欣赏。羊儿的积极热情、求变求新的特性，也迎合双子的口味，彼此相互吸引，能激发出新的东西。在双子面前，羊儿不必隐藏自己的野心和抱负，双子会懂得欣赏羊儿的活跃和冒险个性。双子在思考方面往往跳跃过快，经常会使白羊在身后苦苦追赶，这样会很容易使羊儿成为一座活火山，一不小心就会“引火自焚”。"
    },
    "B狮子座+G金牛座": {
        "girls_horoscope": "金牛座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "42:58",
        "precautions": "狮子和牛儿在一起的话，一定要注意牛儿是个隐性内向的星座，要好好听牛儿的话。狮子和牛儿在初期时两人会相处的非常好，但时间一长，双方的差异性就会导致双方争吵。牛儿受不了狮子唯我独尊对自己呼来喝去的态度。而狮子也会对牛儿闷声不吭还有牛儿那占有欲感到烦躁。在婚后，你们的家庭最好达成一致。同时牛儿可以选择放下自己的固执，去赞美和欣赏狮子，让狮子感受到你尊重。若牛儿能放下自己的身段和矜持，给予狮子真心的赞美，那么狮子也会甘心为牛儿付出一切。你们的这段感情需要努力去维护，爱都是需要双方付出的。只有你们俩共同做出努力和付出，才能走向美满。",
        "boy_horoscope": "狮子座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "华丽的狮子和朴实的牛儿，无论在个性、气质、内在方面都有着明显的差异。狮子和牛儿相当于两个世界的人，一个开朗热情，一个保守低调，一个外向，一个内向。开始时你们会被对方身上自己所没有的气质所吸引，但两个人的恋爱观的要求不一样。狮子想要的是一个可以欣赏、敬仰，能把他当成依赖的伴侣，牛儿需要的是一个对爱忠诚、实在的另一半。换句话说，就是狮子要另一半把他当作帝王，而牛儿希望另一半把她当作小女人。你们俩要想好好维持这一段感情，那得卯足劲了。"
    },
    "B摩羯座+G双子座": {
        "girls_horoscope": "双子座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "40:60",
        "precautions": "喜欢变化的双子座开始可能会对保守传统的摩羯座产生新鲜感，摩羯座也会被双子座天马行空丰富的想象力所感染，但如果想相爱下去，摩羯座就得善用双子座的变通性来扭转乾坤。而双子座则必须学习有责任感，加强做事的耐心，和放弃那浮夸的态度，培养实际的想法。用尊重的态度去建议摩羯座放松，这样你们之间的恋情也就会变得轻松。要不然，纵使双子座有无敌的口才，在面对摩羯那固执如山的态度时，摩羯不须开口，也能够双子直接崩溃。",
        "boy_horoscope": "摩羯座",
        "pairing_idx": "40",
        "longevity_idx": "1",
        "compassion_idx": "3",
        "love_advc": "这是一对需要下足功夫去适应的组合，双子座配摩羯座就像双子座配天蝎座一样，都是需要奇迹的。唯一不同之处就是，双子座配摩羯座，双子座具有压倒性的优势。善变的双子座和守旧的摩羯座，共同点就是都有强烈的自尊心。虽然双子座占压倒性优势，但个性却不如摩羯强座，由于摩羯的强是内在的，所以加强了你们之间的矛盾性。摩羯座能从双子座身上学到很多，无意识的自我中心，高智力的独立性。双子座有很丰富的想象力，所以能帮助摩羯座领略世界的旖旎风光。"
    },
    "B摩羯座+G射手座": {
        "girls_horoscope": "射手座",
        "results_rvw": "小吵小闹的一对",
        "paired_proportions": "46:54",
        "precautions": "开朗自由的射手，承受力低，但却喜欢冒险，所以她们常常会因压力而改变。看着凡事一步一脚印去做事的摩羯，总觉得他们闷到爆了，而且喜怒哀乐不形于色。射手往往跟摩羯讲完一大串后，得到的回应往往是几声“嗯”，其实射手说的摩羯都有听进去，只不过摩羯在心里做评估而已。律人律己、努力做人做事是摩羯的天性。其实射手做事三分钟热度，有点自私的个性，也比摩羯好不到哪里去。喜欢探索世界、追求冒险的射手，要在适当的时候告诉摩羯自己内心的想法，让摩羯知道你虽然向往外面的世界，但家才是你最值得向往的那一个地方。这样做，摩羯才会放下悬着的心。射手可以将摩羯当长辈去看待，用可爱活泼的攻势去软化摩羯，不要只会对着摩羯吼！",
        "boy_horoscope": "摩羯座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "土象星座和火象星座本来就存在有不可跨越的鸿沟，你们观念不同，在一起是会有很多烦恼。射手有时想破脑袋也搞不清楚为什么摩羯做事会那样守旧、谨慎，而且缺乏生活品味。但在摩羯眼里，会觉得射手才是不会过日子的人，有勇无谋，事情往往可以处理得更好，但却不会算计。幸好你们的星座排列是紧邻，多少都弥补了点，虽然也是两个极端，但只要找到最舒服的相处模式，你们还是可以和平共处。你们想要维持长久的关系，首先要好好了解对方，取长补短，互相学习，这才是上策。"
    },
    "B金牛座+G天秤座": {
        "girls_horoscope": "天秤座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "40:60",
        "precautions": "牛儿很难理解秤子变化多端的逻辑，这样的现状令牛儿感到无所适从和改变。秤子热爱社交有时会让牛儿吃醋，因此秤子要多分点时间给闷骚的牛儿。你们俩都有着艺术天分，但所表达的方式都不同，还好你们的个性都不是尖锐的那种，所以即使有分歧冲突，也不糊达到一发不可收拾的地步。只要天秤收起那颗爱玩之心，你会慢慢发觉牛儿的坚持和忠诚，还有对财务的决策能力，都能让秤子不会为了平衡而伤神。秤子爱上牛儿，不须给自己太大压力，其实你们都处于同一水平线上。你们的爱情适合从朋友开始，然后经顺其自然擦出火花。牛儿要想与秤子天长地久，就要试着去了解，牛儿决定事情都是凭感觉，而秤子则是要反复思考。因为你俩思考逻辑不同，要想天长地久就要尽力去维持。",
        "boy_horoscope": "金牛座",
        "pairing_idx": "40",
        "longevity_idx": "1",
        "compassion_idx": "3",
        "love_advc": "秤子和牛儿从星座位置来看，并非吉角，但好在两人有一个共同的守护星，因此彼此的关系还是和谐的。牛儿闷骚，占有欲强，这一点令秤子很难受，而秤子热爱社交，团体的活动会让秤子觉得自己魅力十足。因此牛儿和秤子频率不同，经常不在一个频道上，沟通良好与否，是你俩感情能否维持的主要关键。"
    },
    "B天蝎座+G金牛座": {
        "girls_horoscope": "金牛座",
        "results_rvw": "相吸相斥的一对",
        "paired_proportions": "50:50",
        "precautions": "在刚相识时，你们都会感受到彼此间的绝然不同，进而产生强烈的吸引力，那是因为你们在对方身上看到了最近所欠缺的东西。但你们之间并没有共同点，在一起是很难沟通的。虽说你们一样温和和富有同情心。你们如果不想让隔阂的深沟越来越深，一定要对彼此把话说清楚，让另外一方知道彼此的内心想法。你们不想爆发“战争”，那就要取长补短、互相学习，了解彼此更多。你们的对立可是十二星座组合里最恐怖的，因此你们得花多点心思了！！",
        "boy_horoscope": "天蝎座",
        "pairing_idx": "60",
        "longevity_idx": "2",
        "compassion_idx": "4",
        "love_advc": "蝎子和牛儿在星座排列上呈180度对立，你们除了同属阴性星座，有同样的乐趣、同样感性、内向外，还一个“闷骚”、一个“骚闷”，正好是一对相反的活宝。牛儿妹纸是现实的，不是浮夸、冲动的幻想者。她喜欢蝎子冷静的理智，这正好与她本人相符。蝎子是情感的混合物，虽然只让牛儿看到自己理智的一面，但情感正像他的性格般一样深沉，而从深沉到热烈的迸发只有一步之遥。俩人表面上很沉稳，但当面对健谈者时，都会表现出不太“明白”的样子，实则是牛儿反应不够快，没接收好，而蝎子则是有自己观点，不为所动。"
    },
    "B水瓶座+G金牛座": {
        "girls_horoscope": "金牛座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "58:42",
        "precautions": "内向、传统、保守的金牛座对于思想前卫、喜好改革的水瓶座是羡慕的，而且认为不可思议。更不用说瓶子特有的博爱、宽宏大量和天马行空的幻想力，这对笨重的牛儿来说是难以追赶的，而且会感到很吃力。对于喜欢探索的瓶子来说，牛儿一眼就可以看穿，所以会索然无味。瓶子不妨将自己的想法和私密性的心情与牛儿分享，虽然牛儿可能提供不了什么了不起的创意，但牛儿是绝对支持你的。你们个性都不算强，因此不会发生火爆冲突。如果牛儿能综合两人的优点，用实际行动支持瓶子的想法，相信会有助于改善你们的关系。",
        "boy_horoscope": "水瓶座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "风象星座的瓶子和土象星座的牛儿，基本不怎么相干，即使你们之间互有好感，也很难融合到一起，是各自独立的一对。瓶子和牛儿的性格和观念是截然相反的，瓶子喜欢追求新事物，牛儿则保守、实际。瓶子放眼未来，牛儿是活在当下。牛儿和瓶子在一起后，才发现，要追着不断追求新生活方式的瓶子的脚步是很累的。牛儿接受不了瓶子不理会世俗条规的思想，而瓶子也接受不了牛儿固执保守的个性。瓶子心思缥缈难测，除了要与足够的耐心外，还要懂得欣赏他的独特之处。"
    },
    "B白羊座+G天蝎座": {
        "girls_horoscope": "天蝎座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "60:40",
        "precautions": "白羊座和天蝎座都是个性强的星座，俩人相爱只要彼此付出真心和热情，也会爱得火热；还有俩人忠诚度也极高，若能阴阳调和，会很幸福。但前提是天蝎必须懂得欣赏白羊与众不同的智慧，蝎子尝尝觉得羊儿做事太冲动、太独断，粗心大意，不懂得擦眼观色，体贴别人的心意。而羊儿又觉得蝎子很有心机，很多事都藏着掖着不说，事后又马后炮，事事都想占着主导权。鉴于你们本性不同，要想长久交往，就要学会相互包容。蝎子需学习白羊的坦白，尝试让白羊去做决定，蝎子只负责提供意见就好。这种方式可能有助于蝎子与羊儿的沟通！",
        "boy_horoscope": "白羊座",
        "pairing_idx": "40",
        "longevity_idx": "2",
        "compassion_idx": "2",
        "love_advc": "一个是孩子王，一个是天王，这俩人除了好强好胜相似外，其他方面都是完全相反的，一冷一热。白羊座和天蝎座的组合跟白羊座和处女座的组合一样，都是需要奇迹的组合。以星座角度来看，你们的角度不合，距离太远。天蝎内热外冷，所有的想法、感觉都埋藏于心底；而羊儿则个性张扬，凡事都表露在外。两个极端遇上是需要奇迹，你若爱他就要把话挑明了说。"
    },
    "B摩羯座+G巨蟹座": {
        "girls_horoscope": "巨蟹座",
        "results_rvw": "相吸相斥的一对",
        "paired_proportions": "50:50",
        "precautions": "两人在初相识时就被对方吸引，虽然蟹子和摩羯的某些性格既不相似，也不相异，但会相互支持。摩羯和蟹子的感情在表面看来并不浓烈，两人是属于互信型。所以即使你们是对宫的星座，你们之间的关系也不会拉得太远。摩羯要求严格，习惯要求他人和他一样严于律己，往往会忽略对方的感受，这对凡事重理智，好强却自信心不足的蟹子而言，是难以适应。蟹子和摩羯相处时，要学会relax，用蟹子那柔情似水的温柔去感化摩羯。",
        "boy_horoscope": "摩羯座",
        "pairing_idx": "60",
        "longevity_idx": "2",
        "compassion_idx": "4",
        "love_advc": "摩羯和蟹子在星座排列上是180度的对宫，你们除了都是阴性星座，个性内向和守旧的特点外，其余的地方都是对立的，所以你们可以是非常情侣，也可能是一世的冤家，这个就得看你们之间的相处了。摩羯对蟹子那种充满母亲温柔和善解人意的性格很着迷，而蟹子对摩羯那种父亲的尊严和稳定很有安全感。你们同样重视家庭，蟹子对家庭充满爱心，这令摩羯感到很愉快。摩羯会因为蟹善解人意的亲和力而被打动，但也会被蟹子阴晴不定的脾气所打败。抓住重视家庭这个共同点，是维系你们关系的重点。"
    },
    "B白羊座+G白羊座": {
        "girls_horoscope": "白羊座",
        "results_rvw": "相处和谐的一对",
        "paired_proportions": "50:50",
        "precautions": "羊儿个性要强，是天生的领导者，所以他俩会常常因争权而起争执，动不动就杠上出现火爆情形。他们虽然争执多，但也不是没有相敬如宾的时候，只要正确处理双方关系，感情根基厚实，相信你们的争执也就像龙卷风过境一样，来得快去得也快！",
        "boy_horoscope": "白羊座",
        "pairing_idx": "80",
        "longevity_idx": "4",
        "compassion_idx": "4",
        "love_advc": "两个白羊座的人在一起是相当理想的一对，他们能彼此理解对方的想法，能以轻松愉悦的心情去交往。他们在感情上容易产生共鸣，但若过分干涉，就会有分歧！羊儿是属于热情、开放、直接的人，两个人一旦来电就会迅速好上，因此他们也是众星座中最热情一对情侣。"
    },
    "B金牛座+G摩羯座": {
        "girls_horoscope": "摩羯座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "52:48",
        "precautions": "牛儿是个占有欲很强的星座，无论牛儿有多么需要摩羯，也不见得牛儿会将时刻需要摩羯的需求直截了当的告诉摩羯；不过牛儿会用行动表示——黏得紧。但只要摩羯养成被牛儿知道摩羯行踪的习惯，让牛儿知道摩羯平安无事，牛儿就不会疑神疑鬼，整天盯着摩羯。金牛座是个相当固执的星座，对于不同的意见，牛儿不见得会反驳，但仍旧会照着自己的想法去做，而摩羯也不是个省油的灯。不管你们多么心意相通，还是要维持良好的沟通，否则表面上是摩羯掌握着发言权，但等到牛儿不能在忍受时，牛儿还是会照着自己的意思去做！所以彼此之间的沟通很重要。",
        "boy_horoscope": "金牛座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "两个星座同属土象星座，特征有一致相同都是内向、实际、刻苦耐劳，一个眼神就能明白对方在想什么，你们之间不会有轰轰烈烈的浪漫爱情，往往是细水长流，如“血浓于水”般的感情。但你们首先得突破被动的爱情模式，才能踏出成功的第一步。你们最有可能在团体或工作伙伴、朋友、同学产生恋情。你们彼此的性格、价值观、思维逻辑模式都是大同小异，在认真考虑交往后，你们都会朝着共同的目标打拼。你们的爱情多属于长跑式，有的是柴米夫妻式的情感，在旁人看来可能会乏味无情调，但各种的情趣只有你们懂。"
    },
    "B巨蟹座+G狮子座": {
        "girls_horoscope": "狮子座",
        "results_rvw": "小吵小闹的一对",
        "paired_proportions": "54:46",
        "precautions": "在配对的星座比重上，狮子虽然轻于蟹子，但由于蟹子性格较弱且内向，因此对狮子不会造成太大的影响。虽然蟹子会很母性光辉的照顾狮子，但狮子也不要太过得意做个女强人，而忽略蟹子的情绪。狮子要切记蟹子是个相当情绪化的人，蟹子的情绪会因月亮的圆缺而动。蟹子和狮子虽然有着很大差异，但俩人却十分互补，但如果两个人能够与对方相互学习和理解，取长补短，那你们是十分美好的一对。还要注意的就是你们彼此之间的协调，当发生争执时，狮子会为了自己的面子和自尊心，不低头、不妥协。而蟹子会因为担心狮子还在气头上而耿耿于怀，可能会发生为期几天的冷战。",
        "boy_horoscope": "巨蟹座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "蟹子和狮子的结合，就像光芒四射的太阳和明亮皎洁的月亮的相遇，是一刚一柔、一阳一阴的调和，刚柔亦可并济，是绝对的最佳拍档。狮子座的女生外表总是一种霸气慷慨之感，是一个十足的御姐。但其实狮子座女生的内心住着一个小女孩，渴望获得一份神圣的爱情。而蟹子的温柔体贴恰好能够牵着狮子座的小女孩一起慢慢前进，在巨蟹面前，在彪悍的狮子也变得柔软。蟹子最需要的安全感和安定感，刚好狮子的成熟世故刚好能满足蟹子的需要，给予蟹子安定安稳。只要记得做个体贴、浪漫的的情人，蟹子一定会如小鸟依人般的依附著狮子。"
    },
    "B狮子座+G处女座": {
        "girls_horoscope": "处女座",
        "results_rvw": "小吵小闹的一对",
        "paired_proportions": "54:46",
        "precautions": "处女座的妹纸会将朋友视为学习的宝藏，由于生性温和、被动，处女座交朋友还是喜欢亲近同类型的人，所以对于积极、富有侵略性的强者，处女座都会敬谢不敏。在相处久后，处女座就会发现狮子座其实做事也是充满毅力和正义感，并不是传说中的那样浮夸。其实要抓住狮子很简单，处女座只要在任何场合上给足狮子面子，不要吝啬处女座的掌声就行。处女座那种率直、挑剔的个性，会在处女座碰见狮子座有什么做不好时，就会直言挑明，这样做会让自尊心强的狮子是很受伤害的。狮子座喜欢在幕前表演做大明星，处女座如果想要和狮子在一起，那就千万不要让狮子在公共场合难堪。",
        "boy_horoscope": "狮子座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "狮子座和处女座虽然是两个不同类型的人，但由于位置相邻，所以还是会产生微妙的和谐。只要你们不去挑剔对方的怪癖，如狮子座要自尊、讲派头，处女座的处事谨慎，那相处还是不会有大问题的。在面对狮子座时，天性和善、善于处事的处女座，如果能表达出对狮子崇敬和赞美之情，那傲娇的狮子也会变得温驯。一般情况下，处女座的人是不会选择狮子座的，但在最初相识时，狮子座那种开朗大方的态度可能会令处女座“鬼掩眼”。你们两个牵手的首要条件就是要拥有相同的见解和主义。"
    },
    "B金牛座+G水瓶座": {
        "girls_horoscope": "水瓶座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "42:58",
        "precautions": "思想前卫的瓶子很难理解牛儿的保守和传统，对于牛儿的兢兢业业、反应慢、刻苦耐劳的态度感到无趣。瓶子有时会显得很博爱，但瓶子对自己爱的人是非常专心的，所以牛儿不要随便吃飞醋，要相信瓶子。瓶子对于自由是很渴望的，牛儿不要太过于束缚瓶子，要多给瓶子点自由空间，该让他飞时就让他飞。",
        "boy_horoscope": "金牛座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "土象星座的牛儿和风象星座的瓶子，前途实在是不怎么看好，两个基本上是不怎么想干的类型。即使你们之间相互有好感，也很难走到一起，感觉总有一条难以逾越的鸿沟，很难融入彼此陌生的世界。你们相连但不相容，是各自独立的一对。牛儿跟瓶子在一起之初，可能会因为瓶子的神秘而动心，可在一起后，牛儿会怕了瓶子那种太过极端的想法和行为方式，而瓶子也会因为牛儿的务实，而失去对牛儿的兴趣。瓶子心思缥缈难测，除了对瓶子又要耐心，还要懂得欣赏瓶子的独特。牛儿的温和平稳恰好可以令瓶子感到有安全感！"
    },
    "B天蝎座+G天秤座": {
        "girls_horoscope": "天秤座",
        "results_rvw": "相濡以沫的一对",
        "paired_proportions": "46:54",
        "precautions": "你们之间出现的不愉快往往是来自蝎子的情绪，蝎子敏感多疑，很容易情绪化，心情低落时，会一言不发，让秤子倍感压抑。蝎子应该要学会适当表露情绪，在情绪低落时让秤子尽量不要接近，以免误伤。秤子在星座比重上虽然比蝎子高，但蝎子的性格内向又强烈，秤子得用外柔内刚的态度去处理蝎子的敏感。秤子对待感情总是走中庸路线希望维持双方的平等均势，这样会使你们的感情容易停留在表面，时间长了，绝对不利于感情发展。",
        "boy_horoscope": "天蝎座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "蝎子是具有神秘魅力的自然明星，秤子则是天生的明星料，两个人都散发着耀眼的明星光芒，一旦相遇必会光芒四射，铁定是万众瞩目的焦点。你们不仅是一冷一热，还表里不一。秤子天生外表热情，但内心总有所保留，不会轻易动真情；蝎子外表冷漠，总与人保持距离，但一爱起来就想火山爆发，热情澎湃。你们的个性看起来真的不一样。蝎子是敏感的，很感情受伤，所以对秤子会盯得很紧，可是秤子天生爱自由，不喜欢被束缚，这种个性会让蝎子觉得很没安全感，而秤子也会感到很累。"
    },
    "B水瓶座+G双鱼座": {
        "girls_horoscope": "双鱼座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "54:46",
        "precautions": "瓶子和鱼儿在一起组成了一个爱做梦的组合，瓶子有丰富的幻想力，和瓶子在一起生活会充满各种的可能性，既不无聊也蛮浪漫。鱼儿和瓶子在一起相处时一定要对自己自信，不要让瓶子觉得你软弱，这样只会让两人相处更糟糕。瓶子凡事以理性、逻辑为出发点，加上对自由的追求，可能会对鱼儿忽冷忽热，但鱼儿不需要太过于惊慌，这是一种正常的情况。鱼儿要是能以伙伴的角色和瓶子去培养感情，彼此相辅相成的互补其短，这样你们相处起来会更愉快。",
        "boy_horoscope": "水瓶座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "风象星座的瓶子和水象星座的鱼儿，从阴阳和星象角度来讲是蛮搭配的星座，但两个人的配对情况往往都是高开低走的趋势。所以你们一开始看起来不错，但最后都是不了了之。但从水象星座和风象星座天生不怎么搭配的角度来看，瓶子和鱼儿的组合，算是最好的了。瓶子是漫游未来的星座，鱼儿也是喜欢幻想的星座，在这点上你们有共同的语言。瓶子特别喜欢鱼儿的善良体贴，而鱼儿也被瓶子那种神秘魅力和天马行空的想象力所吸引。"
    },
    "B白羊座+G处女座": {
        "girls_horoscope": "处女座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "40:60",
        "precautions": "一丝不苟、心思缜密的处女座可能无法忍受羊儿冲动莽撞的样子，而好强好胜的羊儿也一样，更难接受处女座天生弱势的事实，相处愈久，冲突也随之愈高。处女座遇上刻不容缓的事，还是习惯于想清楚，但羊儿性急，只会往前冲。白羊座若想追求处女座，最好还是修改自身性格、改变自己，迁就处女座条理分明的风格；而处女座可以学习做事不要过于琐碎，也许会改善你俩关系。弱势俩人都做不到，那就情路坎坷了。",
        "boy_horoscope": "白羊座",
        "pairing_idx": "40",
        "longevity_idx": "1",
        "compassion_idx": "3",
        "love_advc": "也许是天意弄人，老天爷让豪迈大气的白羊座和纤细又神经的处女座相遇，让两个没有交集的类型配对。羊儿是个喜欢刺激、对于追求新鲜事物乐此不彼，羊儿凡事都大大咧咧，难以理解处女座处处都吹毛求疵的处事方式，在解开了处女座神经质的面具后，觉得处女座原本可爱的样子已不复存在，剩下的只是挑剔和小心眼。俩人对彼此都有点不顺眼，但处女座在被羊儿气得七窍冒烟时，不妨想想老天的用意为什么把你们配对。这俩人在一起想要和睦相处，维持长久的爱情，看来得需要点奇迹。"
    },
    "B白羊座+G射手座": {
        "girls_horoscope": "射手座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "52:48",
        "precautions": "白羊座和射手座是一对很会享受生活乐趣及活动的青春星座组合，他们个性及相近而且相同，都明朗率性，喜欢直来直去，不会把不愉快藏着掖着；相对的，他们承受力却差了点，受不得委屈。但他们相似的个性，会让他们的争吵来得快也去得快，不会记仇。只不过羊儿和射手都是固执的主，也免不了有时发生冲突时会互不相让，这是要注意的，偶尔也要相互体谅、礼让一下。射手若要与羊儿长期发展，就要克制自己的欲望，学会相互包容。其实羊儿和射手如此相像，射手完全有能力赶超羊儿，但只要羊儿发挥自己不喜欢被束缚的个性，保持一定距离，给彼此空间，允许各自发展，这样不但不会产生距离感，反而更容易爆出火花。",
        "boy_horoscope": "白羊座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "和白羊座配狮子座一样，这俩星座在一起也是天生一对的情侣组合。两星座性格相近，又同属火象星座，一遇上犹如火上加油般，俩人都是干脆利落的热情行动派，投缘之后就会展开行动。射手座喜欢冒险、爱自由，不喜欢长久保持在一个状态，局限于一个点太久。就算迫不得已过上不喜欢的生活，也会在娱乐等其他方面发挥自己的个性。而羊儿那种冲劲十足、追求刺激、求变求新的个性，和射手的个性和贴近。羊儿在人际交往方面更是游刃有余，彼此在各自的生活中，都能够活得十分精彩。你们有很多的奇思妙想，两人在一起碰撞将会更加微妙。不过有时候两人太闹腾的生活导致心灵沟通的缺乏，时间久了会开始厌倦。"
    },
    "B金牛座+G狮子座": {
        "girls_horoscope": "狮子座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "58:42",
        "precautions": "狮子个性属于隐性，在表面上好像是狮子主宰大局，但事实上从星座比重来看，还是温和而顽固的牛儿在幕后操纵着狮子。这对于个性要强的狮子来说，会有挫败的感觉，但还好狮子是那种温和，切倾向自虐而不虐人的星座，所以狮子不会让牛儿下不了台。狮子要想得到牛儿的心，那就要忍住狮子的骄傲，放慢脚步由朋友开始，适当给予赞美和鼓励。狮子期望牛儿能给他过着有水准的生活，虽然牛儿有艺术才华，但却喜欢以务实态度看世界，会对狮子的虚荣感到受不了；不过愿意为爱人奉献的牛儿，在能力许可下，绝对不会对狮子吝啬。不要因为牛儿的朴实而觉得他是没品位的人，只不过牛儿不向狮子那样追求华丽而已。",
        "boy_horoscope": "金牛座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "从星座位置来看，金牛座和狮子座呈九十度，明显不协调。在开始时，这样的感觉也许是一种互相吸引的力量。狮子会被金牛的沉稳、慢斯条理的守候而感动，牛儿也欣赏狮子的万情豪涨。然而好景不长，狮子会慢慢对牛儿那种大男人（大女人）的占有欲气得冒烟；而牛儿也会对狮子那种要视他为皇上或皇后的作风，除了要珍惜和爱慕之外，还得敬仰着狮子，众星捧月的伺候的态度，感到难以承受。两人想要维持长久，还得好好加油，卯足劲才行。"
    },
    "B水瓶座+G射手座": {
        "girls_horoscope": "射手座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "56:44",
        "precautions": "瓶子和射手在一起，他们都有自己的娱乐生活，能给予对方独立的空间。射手虽然很欣赏瓶子先进思想，但瓶子缺少行动力，射手对这个颇为反感。但射手得明白，瓶子做事都有一套自己的个人化看法，而射手那种事后马后炮的个性也不是怎么理想，你们要是能试着调和，也许会很优秀。瓶子对自己的目标和意向是坚定不移的，而且很忠于自己的原则，这点和射手个性很相近。瓶子有时喜欢特立独行，且希望得到对方的肯定，这对于说话率直，不爱讲好听话的射手来说，可能会有点困扰。你们在相处的过程中一定要记住，遇事保持冷静，保持冷静才不会引发大冲突。",
        "boy_horoscope": "水瓶座",
        "pairing_idx": "90",
        "longevity_idx": "4",
        "compassion_idx": "5",
        "love_advc": "风象的瓶子和火象的射手因为性质相近，加上同是阳性星座，观念和行为模式都大同小异，是很理想的组合，携手共度一生的可能很高。瓶子和射手都是追求自由主义的人，不管你们人缘多好，多喜欢跟朋友聚在一起，其实都是很讨厌人际关系和束缚。射手追求自由和独立的人生观跟瓶子十分相似。瓶子和射手谈恋爱完全不用担心对方会一直缠着自己，射手有自己的生活和娱乐，这对于喜欢自由的瓶子来说，射手十分适合。你们人缘非常好，都有各自的朋友圈，各自的生活都充满了乐趣。"
    },
    "B天秤座+G巨蟹座": {
        "girls_horoscope": "巨蟹座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "42:58",
        "precautions": "秤子和蟹子都是多愁善感的人，两个人都在变幻莫测的情绪话下为感情而努力。秤子是个爱笑的大男孩，对谁都可以侃侃而谈，和他在一起确实能让人感到快乐的氛围，和平易近人的蟹子走在一起，就会形成一种互动。秤子在爱情里，开始时往往都是你进他退，你退他进，不过爱上了之后，秤子的乐观温暖，会让蟹子感到轻松快乐。蟹子得学会接受秤子的外向和爱交际的性格，对着秤子要有话直说，蟹子不要用阴晴不定的情绪化吓走秤子。秤子对于蟹子的安全感也要尽最大努力去给。你们在一起的话，还是有很多感情课需要做。",
        "boy_horoscope": "天秤座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "秤子和蟹子在一起，是不被看好的一对，蟹子有较强的占有欲，而秤子则喜欢自我的生活。蟹子的情绪化和秤子因为追求内心平衡而产生的内心冲突看起来有点相似，但其实是截然不同的存在。从两个人的星座比重来看，比较趋于平衡，因此没有比较强势的主导方，那在感情上，两人就要相互调适了。秤子有一颗宽容的心，能包容蟹子的一切，会用温柔的态度去慰藉蟹子的情感，能用自己的双臂给保护蟹子，给她安全感，这样蟹子则可以安心地将自己托付给秤子。秤子和蟹子都是爱好和平的人，为了感情和平，他们会对对方说“善意的谎言”。你们虽然有相同的方向，但也有难以交集的一天。"
    },
    "B水瓶座+G摩羯座": {
        "girls_horoscope": "摩羯座",
        "results_rvw": "小吵小闹的一对",
        "paired_proportions": "46:54",
        "precautions": "摩羯比较喜欢知性聪明的人，一旦遇上就抵挡不住，所以瓶子丰富的知识和幽默的处世态度，很是吸引摩羯，相处起来相当愉快。瓶子和摩羯在一起相处需要多多协调，学会包容彼此。学习彼此身上的特质，瓶子身上那种开拓创新的精神值得摩羯学习，而摩羯身上踏实的态度也是瓶子需要学习的。摩羯遇事千万不要一直憋在心里，要多和瓶子交流自己的想法，而瓶子也需要让妹子知道自己的想法。",
        "boy_horoscope": "水瓶座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "土象星座遇上风象星座，一个觉得无趣，一个则觉得无力，很难组合到一起。还好，摩羯和瓶子是位置相邻的邻居，多少有点亲切感。摩羯身上的矜持、安静、不固执、不好奇的特点很吸引瓶子。但对人生目标确定、做事稳重的摩羯来说，总觉得瓶子一心想打破传统，实在是太乌托邦。瓶子的想法高妙，虽然令摩羯眩目，但摩羯清楚瓶子的想法不太踏实。瓶子向来博爱，待人都是同等态度，这样的博爱会让摩羯非常非常的嫉妒。瓶子充满了幻想，摩羯则是十分现实。两人的观念和性格都相差很大，沟通比较难，交心也是。"
    },
    "B处女座+G摩羯座": {
        "girls_horoscope": "摩羯座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "48:52",
        "precautions": "处女座具有为他人服务的性格，跟处女座相处，处女座会帮摩羯座处理好一切大小事务，不管是衣食住行还是人生交友，都在处女座的管辖范围之内。而且处女座对自己的要求也很严谨，这对于稳重务实的摩羯座来说，正对她们的胃口。为了避免在热恋后，会开始嫌弃处女座烦，摩羯座最好先告诉处女座，自己对任何事情都胸有成竹，让处女座帮自己注意细节就好。事前沟通好，就免得以后出现必要的麻烦了。由于你们都是不擅长表达情感的人，所以你们只注重感情的本质和幸福感，对于华而不实的事物，你们都不感兴趣。即使是同吃一碗面，你们也会觉得很幸福的。和处女座交往时，摩羯们可以尽量展现真实的一面，诚实面对的感觉最好。",
        "boy_horoscope": "处女座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "处女座和摩羯座在一起通常都比较稳定，虽然没激情四射的火花，但却异常温馨，能做到细水长流，长相厮守。两个同是土象星座的人，无论是思想还是性格都有着很多共同点。虽然你们都不是那种大声谈恋爱的人，但却有着先友后婚的默契，同心协力向共组家庭的方向努力。你们的感情就像前面说的，都是从朋友慢慢做起，透过一些平凡生活来培养感情，你们不会有太多的浪漫情话，到了谈婚论嫁阶段，也不会理会谁是主动和被动，而会共同策划两个人的长期生活。相对来说，处女座会对摩羯座依赖多一点，特别是在遇到事情的时候，摩羯座的条理分明会让处女座备受安全感。摩羯座和处女座相处要懂得如何安定处女座的神经，让处女座不要紧张兮兮，认为做好一件事就得盯紧每一个环节。"
    },
    "B射手座+G狮子座": {
        "girls_horoscope": "狮子座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "52:48",
        "precautions": "射手的乐观热情四射很容易填补狮子某些空虚，两人互相搭配可以算得上满分。不过射手喜欢无拘无束，不要想着一心去束缚他，适当的放松和宽容能有助于你们长期的发展。要注意射手的玩心和野性往往都会超出狮子的想象，虽然狮子的广阔胸襟可以让射手接受狮子的爱，但记住别把胸襟放的太开，一旦射手得意忘形时，射手就会忘记狮子的存在，那到时的局面狮子就无法控制了。不要以为你们天生相合，就忽略时常沟通。就算时间再忙，也要抽时间一起从事休闲活动。你们虽然心胸都宽广，但在感情上都是小心眼，都希望自己的付出的爱能有同等回报。狮子爱面子，射手要适当给狮子赞美，不要给狮子太大压力！",
        "boy_horoscope": "射手座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "射手和狮子都同属火象星座，都爱热闹，很容易就产生共鸣共振的感觉，所以一见面就会被对方的气质吸引。射手看起来虽然神经大条，喜欢有话直说；对狮子，射手是感同身受的，会不时以乐观的个性去抚慰内心颇为寂寞的狮子，这是狮子非常需要的另一半。在爱情上，你们都是勇往直前的，只要自己喜欢，就会爱的死去活来。可是不合时，那就会不停地争吵最后一拍两散，非常洒脱。俩爱的时候，彼此间也没什么压力，你们都是乐观性格，不会太刻意去束缚对方的自由。"
    },
    "B天蝎座+G双子座": {
        "girls_horoscope": "双子座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "60:40",
        "precautions": "双子的思维和行为模式都是跳跃式的，这和深沉的蝎子有着如山般的隔阂，而且蝎子还占着上风。双子遇到蝎子，不但难以招架，而且还有鸡同鸭讲的无力感。但其实双子的个性不强，如果能放弃对彼此关系的过多幻想，不要让蝎子有猜忌的机会，并多多了解蝎子隐藏的情绪，情况还是会有改变的。双子喜欢交际，爱好和朋友多来往，但这会让蝎子很妒忌，每次都会针锋相对，就算不出声，一个眼神也能让双子倍感压力。蝎子做事从来不会有始无终，而双子则是从不善始善终。你们在一起，如同两个人在跑马拉松，就看谁先放弃了。",
        "boy_horoscope": "天蝎座",
        "pairing_idx": "40",
        "longevity_idx": "2",
        "compassion_idx": "2",
        "love_advc": "深沉的蝎子和活泼的双子，两个人基本没交集，且各方面都有着恐怖的差距，需要奇迹才能维持长久的爱情。不过，即使不喜欢挑战的双子，也会有颗如猫一般的好奇心，会不顾一切的像蝎子冲去。因为蝎子身上有双子所需要的专情和耐力。双子在遇到蝎子时，蝎子的神秘感就吸引了双子的注意。而蝎子也会被双子那种乖巧的魅力吸引，但蝎子千万不要那么快就给双子来承诺，这样双子会很容易被你吓跑。"
    },
    "B双鱼座+G双鱼座": {
        "girls_horoscope": "双鱼座",
        "results_rvw": "相处和谐的一对",
        "paired_proportions": "50:50",
        "precautions": "用浪漫和梦想来形容鱼儿是最合适不过的了，两个人的情绪变化都会恰好反应在彼此身上。两个人在一起虽然很梦幻很幸福，但在沉醉于美妙的爱情时，不要忘了把目光放回现实中来，要知道没有现实基础的支撑，一切的浪漫都是空虚的。鱼儿在面对要解决的现实问题时，总是喜欢躲起来，自己一个人在心里纠缠，把事情弄得越来越复杂，最惨的是，鱼儿缺乏自信，想的与做的往往是两回事。试想两条鱼儿加起来，那可得多复杂，想想都头痛。你们在一起要相互鼓励和支持，用希望对方对待自己的方式去对待对方，多敞开心扉谈谈自己的想法，这样你们的感情才能更加健康。",
        "boy_horoscope": "双鱼座",
        "pairing_idx": "80",
        "longevity_idx": "4",
        "compassion_idx": "4",
        "love_advc": "两个双鱼座都同是水象星座，两个水象的人相遇，彼此更容易理解对方的感情波动和爱做梦的性格。两人都是感性浪漫，善解人意的人，容易投缘，在一起几乎没有什么好争吵的。两条鱼儿的情绪变化会很明显的映照在对方身上，会产生一种相知的感觉。你们对彼此都是温柔善良的，会让对方感觉很幸福。你们自由自在的相爱，远离尘世，就像一对不食人间烟火的“神仙眷侣”。不过对于现实生活而言，你们还是得现实一点为好。"
    },
    "B双子座+G狮子座": {
        "girls_horoscope": "狮子座",
        "results_rvw": "相濡以沫的一对",
        "paired_proportions": "44:56",
        "precautions": "双子在和狮子在一起时必须得发挥优秀的感应力，因为狮子会经常有刚愎自用的情况出现，此时双子就要给狮子表现的机会，不要让狮子感到自己无能、或有时颜面的情况。如果让狮子陷入有气无处出的痛苦中的话，会令狮子很抓狂的！有时双子跟在狮子的后面可能会感到很吃力，这时双子自己就得想出平衡心态的方法，要不然双子气死了，狮子也不晓得。保护良好的沟通和互动，彼此才可藉由不断的刺激与调适，使关系更加亲密。",
        "boy_horoscope": "双子座",
        "pairing_idx": "90",
        "longevity_idx": "4",
        "compassion_idx": "5",
        "love_advc": "风向的双子和贵气的狮子都是同属阳性星座，且位置又相近，是相互吸引又看不厌的一对。人缘不错、善变的双子还是挺尊重有王者气度的狮子，这正好满足了狮子的领导欲。双子虽然多变，但面对狮子的霸气，也会收敛起来，而豪迈通达的狮子也会用一种豁达的心去包容双子那一种善变贪新鲜的特性，狮子知道双子天性如此，不会刻意放心上。俩人互相截长补短，会搭配的更好。"
    },
    "B巨蟹座+G水瓶座": {
        "girls_horoscope": "水瓶座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "60:40",
        "precautions": "瓶子走的都是反传统路线，且冷静又理性，有时还会给人冷漠的感觉，因此对于蟹子情绪化是很不能接受的。除非瓶子足够成熟，和比较有耐心，这样瓶子才会理解蟹子的情绪化和不安，否则瓶子只会觉得的歇斯底里是在无理取闹，而你们之间的很多事都只限于浮面。如果蟹子年龄比瓶子小，那蟹子可能崇拜瓶子果断和领导力，会因瓶子的能力产生安全感，感到安心。你们想要走下去，瓶子就得平衡一下你的“酷”，多学习下蟹子的温情和生活态度，对蟹子多点耐心，将心比心地对待蟹子。克制瓶子的企图心，这样再大的差异也会慢慢磨平。",
        "boy_horoscope": "巨蟹座",
        "pairing_idx": "40",
        "longevity_idx": "2",
        "compassion_idx": "2",
        "love_advc": "水象星座和风象星座本身就有着志不同道不合的差异，而蟹子和瓶子更是差异中的差异，两人之间缺乏共通性，着实是很不搭调。奉劝瓶子冷静思考两人是否有共同理想，若是有……这点差异又何必在乎呢！瓶子总走不寻常路，而且还有点冷漠，对于蟹子的小情绪，会不屑理会。当蟹子想用温柔去接近瓶子时，瓶子为了不想被束缚就会劝说蟹子希望给她自由空间。就理论层面来说，两个星座在一起想长久的几率是相当低。"
    },
    "B天蝎座+G天蝎座": {
        "girls_horoscope": "天蝎座",
        "results_rvw": "相处和谐的一对",
        "paired_proportions": "50:50",
        "precautions": "你们喜欢把所有心事和感情藏在心里，外表看起来冷漠，其实内心像座火山，专情、善妒、独占欲强。情绪善变，相处好的时候，彼此极具默契，能看出对方的心事想法；不好的时候，就会拒绝跟对方说话。你们的个性强的像铁石一般，谁也不肯居下，而且谁也不甘受伤害，一旦冷战起来，可以持续到对对方失望，这对你们爱情带来的负面影响是非常大的。就算讲好了，可伤口上还是永远有个疤。茫茫人海中，要想找到能给你带来安全感的人真的不容易。在交往初期你们得建立好沟通模式，别以为彼此间默契十足，就可以什么事都不说明白，不是什么事都能一眼就看得出来。你们都是敏感的，一丝丝的嫉妒之火就能足以摧毁你们的感情。彼此间多些坦诚，善用你们的敏锐的观察力，对生活和感情都会有助益。",
        "boy_horoscope": "天蝎座",
        "pairing_idx": "80",
        "longevity_idx": "4",
        "compassion_idx": "4",
        "love_advc": "蝎子是十二星座最具神秘的一个，有深藏不露谋略的星座。两个蝎子相遇时，会被彼此的神秘感吸引的难分难解。因为你们性格特质都一样，不但专情还有着很强的占有欲，超强的观察力常常能轻易理解到对方的心思。双方都善表达、情感强烈又深刻，一旦爱上就像天雷勾动地火。你们占有欲强，在开始时，都会监视着对方的一举一动，希望了解对方更多事，但却不喜欢暴露自己。你们踏出成功第一步最好的方法，就是由不经意的相遇，然后顺其自然的交往。如果你们能先由爱人发展为爱人，会让你们的感情路走的更顺些。"
    },
    "B摩羯座+G处女座": {
        "girls_horoscope": "处女座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "52:48",
        "precautions": "摩羯座稳重且有谋略，让处女座感到非常踏实和有安全感。而心细的处女座也能给予摩羯座很多实质的帮助。摩羯座会给人有一种极端的感觉，那是因为他有时会很冷漠，仿佛身边的一切都与他无关；有时又热情四射，对爱情深情又执着。这一切都源于摩羯极深的城府，摩羯虽然支配欲强，但不会表现出来。处女座应该运用你的温柔、收起你的啰嗦，去适应摩羯男温柔又强势的爱情。在相处中如果摩羯嫌处女座管得太多，那就应该告诉处女座，有些事情自己可以处理，这样的事先沟通方式，可以为你们的相处免去很多麻烦。",
        "boy_horoscope": "摩羯座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "同是土象星座的你们都缺乏浪漫细胞，但却有着土象星座的共同点：沉稳、实际。这些特质足够让你们筑起一座金字塔，会为目标而努力奋斗。但处女座要记住：摩羯座才是金字塔里法老王，摩羯不管外表有多温和，但骨子里还是会有刚愎自用，所以处女座发言时最好先征求摩羯座的意见。在外人眼中，你们是沉闷的一对，恋爱的过程中没有激情火花，但你们却能做到细水长流、相守一生。你们这样的一对实际情侣，不会有闹翻的机会，处女座的啰嗦在摩羯座，只需要一招“装聋”就能化解。"
    },
    "B射手座+G金牛座": {
        "girls_horoscope": "金牛座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "40:60",
        "precautions": "射手和牛儿在一起真的有点勉为其难。你们属性相差太大，射手是想寻找精神伴侣一同前进冒险，而牛儿则是想要居家好伴侣给她稳重可依靠的肩膀。热情似火的射手总是让刻板保守的牛儿难以抵挡，特别是射手经常会在牛儿面前晃动，让牛儿习惯他的存在。当牛儿对射手逐渐产生感情时，射手可能又转移目标了。射手天性爱自由，喜欢在轻松舒适的生活，即使牛儿已经吃定了射手，但还是难以将射手栓住。你们的人生观和价值观如果没在事前认清，即使相互纵容，那还是会……",
        "boy_horoscope": "射手座",
        "pairing_idx": "40",
        "longevity_idx": "1",
        "compassion_idx": "3",
        "love_advc": "射手和牛儿绝对是看似不搭的组合，天性爱自由开放的射手座和像牛一般的金牛座，两个人可谓是风马牛不相及。无共同点不说，而且属性也相差较远，想使用九牛二虎之力来把你们拉近都不太易。对于爱情，牛儿是非常重视感情的一类人，她们希望成为射手的女眷，而不是普通伴侣。而射手是自由散漫不喜欢被约束的一类人，他们需要很大的自由空间。射手不希望牛儿是个只会怀疑和责骂他的女人。射手需要的是一个快活的女伴，能给他足够的自由和空间。牛儿很难忍受射手的爱热闹，但为了讨好射手，怕他嫌你沉闷，还得勉为其难，那这样的相处实在蛮惨。"
    },
    "B狮子座+G射手座": {
        "girls_horoscope": "射手座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "48:52",
        "precautions": "射手崇尚自由，凡事喜欢直来直往，最不能忍受被压抑，在遇见了思想开放的狮子后，正好没有包袱和负担，依然心有所属，非常的各得其所。因为你们都是火象星座，某些德性是差不多的。两个人只要慢慢去熟悉对方的性情，能同心同力向共同目标走去，在某些缺点上，相互睁一只眼，闭一只眼，会令你们之间关系变得轻松，不会爱得心累。唯一担心就是怕你们对爱情的忍耐度不够。虽然你们看起来都心胸广阔，其实在感情上都是小心眼，从不肯委屈自己。面对狮子，射手要不时地的称赞他，毕竟狮子是个爱面子的人，在公共场合上要给狮子足够尊重，但绝不要阿谀奉承，这样会让狮子觉得射手很虚假。射手只要看重狮子，对狮子有敬仰之心，那狮子也会给射手很大的宽容和配合。在星座比重上，射手占比重较大，那就不要再给狮子施压，一旦狮子受不了，你们就会产生冲突。",
        "boy_horoscope": "狮子座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "狮子和射手同属火象星座，彼此间很容易被对方的气质吸引，都喜爱玩耍和热闹，热情的性格让你们一拍即合。拍拖的时候，当然大家都开心，也没什么压力，彼此都是乐观的人，又喜欢玩，不会太刻意去束缚对方的自由，最多有时狮子座会有些醋意，只要射手座迁就一下就没事。但你们是那种“只要我喜欢，有什么不可以”类型，合得来时，可以你侬我侬，一旦相背，那就会吵得天翻地覆，到那时就不是一拍即合而是一拍两散了。特别是独尊的狮子，凡事喜欢以我为中心，事事都得照狮子意思做，喜欢对射手发号施令，命令射手来执行，这样的行为对我行我素的射手来说，那是不可能的啦！"
    },
    "B狮子座+G白羊座": {
        "girls_horoscope": "白羊座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "52:48",
        "precautions": "狮子很欣赏羊儿的爽朗、冲劲，而羊儿也十分欣赏狮子的热情大方和霸气。虽然说两人是天生一对，但两个人的个性和自我意识都太强，在相处中，免不了会擦枪走火，发生冲突。因此两人要懂得协调。羊儿的内心永远是个单纯直率的大孩子，如果聪明的狮子比较成熟，为了减少冲突，与其等待羊儿成长，不如发挥狮子的大气和王者的胸襟，把羊儿当小孩一样来宠溺，相信你们之间的感情一定会水乳交融，十分美满！",
        "boy_horoscope": "狮子座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "狮子和羊儿都是火象星座，彼此会产生很强的吸引力，一见钟情这种例子在他们身上很常见，两个人接触后，犹如火上加油，进展迅速畅通无阻，是耀眼恩爱的组合。狮子喜欢被人崇拜，在爱情中当然也不例外，狮子想用自己的热情之火去燃烧别人，同时也能够守护爱情。羊儿欣赏强者，对于那种没主见又喜欢装逼的男生，羊儿是及其讨厌的。羊儿喜欢有绝对力量之人，渴望征服强者，而狮子恰恰是这种类型，在初次见面时，就会擦出爱的火花，两个人之间相互斗智斗勇，相互征服。羊儿和狮子都是开朗外向的，且很爱面子，对待爱情的态度直来直往。"
    },
    "B天蝎座+G处女座": {
        "girls_horoscope": "处女座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "56:44",
        "precautions": "蝎子很讨厌别人挑剔和善意的提醒，内向由被动的处女座在感情中，有时看喜怒不形于色的蝎子，内心也会觉得怕怕。蝎子对于感情，那时相当沉得住气，因为他们对爱情是很谨慎的，而且也不知道该如何去踏出第一步。蝎子的内心其实是很火热，只不过蝎子要处女座敞开心灵，那就需要给处女座时间。蝎子对于自己的欲望很明白了解，既然做不到圆滑和妥协，那只有选择沉稳冷静的处理各种情绪。处女座要和蝎子相处，最好收起啰嗦琐碎的毛病，多多沟通，给彼此足够空间，这样才不会爱的那么辛苦！",
        "boy_horoscope": "天蝎座",
        "pairing_idx": "90",
        "longevity_idx": "4",
        "compassion_idx": "5",
        "love_advc": "深情的蝎子撞上专情的处女座，两人都可相互依靠，只要你们能充分信赖对方，共同生活必定充满乐趣。你们都是属于阴性星座，而蝎子号称地王，其个性之强，由此可见。你们一强搭配一弱，随性有时相伴相随，会是很紧密的一对。处女座最大的优点就是对所爱之人是相当大度和无私。你们都非常羞涩，有时甚至是一种痛苦的羞涩。让人很难想象你们会一见钟情而迅速投入对方的怀抱。不要看蝎子表面温和有礼，其实大多内敛深沉，这种特性正合喜欢有深度的处女座胃口。"
    },
    "B摩羯座+G双鱼座": {
        "girls_horoscope": "双鱼座",
        "results_rvw": "相濡以沫的一对",
        "paired_proportions": "44:56",
        "precautions": "鱼儿不是个没主见的星座，但却容易听信一面之词，容易受情绪影响而改变初衷。而摩羯刚好可以弥补鱼儿这项缺点，鱼儿可以从摩羯身上找到可以稳当停泊的地方。摩羯不懂得表达浪漫，很容易让期待的鱼儿黯然伤神。也许摩羯不懂浪漫是个遗憾，但摩羯用实际行动所造出来的天地却异常可靠。鱼儿的艺术才能、体贴会令摩羯感到生活也不一定是辛苦的。你们在一起能让彼此的生活感到愉快，这不是很完美吗？",
        "boy_horoscope": "摩羯座",
        "pairing_idx": "90",
        "longevity_idx": "4",
        "compassion_idx": "5",
        "love_advc": "双鱼先天是泪水多的水象星座，且又是个变动星座，感情较不易稳定；而土象的摩羯则是踏实务实的本位型星座。无论是生活或人格发展上，鱼儿和摩羯在基本上是相合的。但是也许要花上一段时间及考验，主要是因摩羯对爱情觉醒度不高，行动力又低；他可以用深情眼光在您背影守候，但浪漫对他而言则是轻浮的东西。若是能适应摩羯保守又传统的爱情方式，打开他的心扉，您们会成为一对互信、互爱、互谅的坚实组合。"
    },
    "B射手座+G双子座": {
        "girls_horoscope": "双子座",
        "results_rvw": "相吸相斥的一对",
        "paired_proportions": "50:50",
        "precautions": "双子很接受射手经常乐观得太一厢情愿，而射手有时会觉得双子那种追求精神生活和追求新知的态度很畸形。你们做朋友，也许是很不错的搭档，两个人都向往自由，对彼此都充满好奇，刚开始在一起时会充满新鲜感。但你们又是比较不安分的星座，对彼此太过了解，怕被对方控制，因此也会为这样的原因而道别。既然水和油无法相融，为何不尝试让比例适当，让双方都身心平衡。你们两个的截然相对，让你们沟通困难，如果不懂得为爱取长补短、相互学习，那你们之间的鸿沟就会越来越深。",
        "boy_horoscope": "射手座",
        "pairing_idx": "60",
        "longevity_idx": "2",
        "compassion_idx": "4",
        "love_advc": "射手和双子在星座排列上呈180度的对宫星座。你们除了同属阳性星座和性格外向开朗之外，各方面都是相反的。你们在一起的话只有两个可能，要么彼此鼓励，相互欣赏，成为很好的合作搭档；要么彼此嫉妒，相互排斥，成为克星。在最初开始的时候，双子会被射手的健谈所吸引，但相处下来后真面目就很容易暴露出来。射手对双子的吸引不是大坏，就是大好。"
    },
    "B处女座+G巨蟹座": {
        "girls_horoscope": "巨蟹座",
        "results_rvw": "相濡以沫的一对",
        "paired_proportions": "56:44",
        "precautions": "处女座和巨蟹座都偏向于内向性格，对感情都不会主动出击，因此你们的爱情都是由友情开始，进展比较平淡缓慢。但正是这种不急不躁，细水长流的相处方式，才会使爱情持续长久。处女座的人办事谨慎沉稳、有挑剔和吹毛求疵的习惯，但蟹子却会给对方相当的肯定。蟹子平时带人处事的方式颇得处女座的信任，因此能给到处女座很大的鼓舞。在感情互动你们都相当和谐，但处女座得舍弃你那小气斤斤计较与琐碎的毛病，你们都有各自的本事，应互相学习，互相包容，这样才能稳步前进。处女座对爱情要求较高，他们的敏感度不比蟹子低，只不过承受程度比蟹子强而已。当发现蟹子缺乏安全感时，处女座绝不会吝啬。但若发现蟹子另寻他爱而另起炉灶时，处女座会很坚决地慧剑斩情丝，不会给蟹子第二次机会。",
        "boy_horoscope": "处女座",
        "pairing_idx": "90",
        "longevity_idx": "4",
        "compassion_idx": "5",
        "love_advc": "处女座和巨蟹座相处时，因为互动上来电关系，可以说是满理想的组合。在蟹子交往过程中，处女座往往会感到轻松愉快，不会觉得有束缚，也不会担心在恋爱中丧失自己的个性。热爱大自然的处女座会把家里打理的井井有条又能给予彼此欢愉的爱，但要记住，切勿步调太快，表现太挑剔，否则会让蟹子退缩。处女座和巨蟹座的恋情开始，通常都是由朋友发展而成，经过长时间相处后，两人会慢慢地发现对方是彼此的终生伴侣。因为你们两个都是内向的人，在恋爱中缺乏主动，所以你们的恋人关系都会要拖拉很久才会确定下来。你们心里对感情都有不同的恐惧，蟹子拥有都怕受伤，而处女座的人总觉得每一个恋人都不是他们心目中的完美对象，就是因为这样的拉锯，浪费了不少可贵的青春，不过幸好两人一旦在一起，那恋爱关系就是长久。"
    },
    "B双鱼座+G双子座": {
        "girls_horoscope": "双子座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "58:42",
        "precautions": "如果要找出你们之间的共同之处，那就是都有着复杂的双重性格，只是立足点不同。鱼儿和双子都有善变和喜好自由的特质，如果你们能善加利用这方面的特质，还是有机会成为一对佳人眷侣。双子和鱼儿在一起，虽弱势，但幸好鱼儿性格不强，所以你们之间不会发生太激烈的冲突。双子在对鱼儿说话的时候要估计鱼儿那敏感柔软的心，不要用太过尖利的话语。鱼儿也不要整天沉浸在自己的梦里，多花点心思在双子身上，多发挥你温柔体贴的特点。彼此之间多点宽容和理解，多点交流和沟通，这样生活才会更和睦。",
        "boy_horoscope": "双鱼座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "鱼儿和双子是两个不怎么相干的类型，除了都很复杂、矛盾外，讲真，你们真不是很有默契。个性和动机上的差异，让你们更难切入对方的生活。双子认为鱼儿总是牺牲自己，是个烂好人。虽然开始时，双子会被鱼儿的柔情蜜意所吸引，但经过相处之后，又会被鱼儿的优柔寡断给气到。双子的敏锐和鱼儿的敏感，使两人忍不住想寻找更稳定的依靠。鱼儿虽然欣赏双子的机智灵敏，但又抓不着双子的想法。双子的双重性格加上鱼儿的复杂个性，使你们陷入微妙而复杂的情况。"
    },
    "B狮子座+G水瓶座": {
        "girls_horoscope": "水瓶座",
        "results_rvw": "相吸相斥的一对",
        "paired_proportions": "50:50",
        "precautions": "狮子和瓶子在一起相处，由于性格观念不同的使然，会导致你们极易发生争吵，因此你们要学着忍让和宽容，要相爱就要懂得牺牲和奉献。瓶子喜欢探索新奇、未知的事物，这样的人对于狮子来说就是个极端的存在，自然有着震撼力。但瓶子也发现自己和狮子在人生观上很难沟通，这些感觉都是决定着你们的适合度，此时瓶子聪明的做法就是努力打进狮子的内心世界。狮子看来嘻嘻哈哈的，但正经时，狮子的处理能力不输于瓶子，狮子也会接受瓶子的意见，但要狮子听命于瓶子，那傲娇的狮子恐怕是恕难从命了。所以，瓶子想要跟狮子共同生活的话，千万不要以自己为主控的方式来要求狮子与瓶子携手前进，倒不如有时让狮子占一下上风，让呀觉得自己才是领导，这样争吵也会少点。同时狮子也要多尊重瓶子的意见，这样生活才能和和美美。",
        "boy_horoscope": "狮子座",
        "pairing_idx": "60",
        "longevity_idx": "2",
        "compassion_idx": "4",
        "love_advc": "火象星座狮子和风象星座瓶子，理论上来说是相通的。可惜你们两个星座在位置上是对宫，呈180度相对排列位置，这是你们彼此感应强烈的原因，同时也是你们冲突的最大原因。虽然由于他们都比较固执和自我，很容易出现各执己见的情况，但狮子很欣赏瓶子的独立特性和标新立异的个性；而瓶子也十分喜好狮子的热情风趣和才华横溢。因此只要相处的好的话，那也是绝配的一对。因为狮子与生俱来的霸气和强势与瓶子强烈自我的个性会时常出现碰撞，这样就会出现了在生活中不知道是谁领导谁的局面。"
    },
    "B水瓶座+G天蝎座": {
        "girls_horoscope": "天蝎座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "42:58",
        "precautions": "瓶子其实还是会受蝎子影响，所以你们也不是一点希望都没有。蝎子和瓶子谈恋爱，首先要想清楚自己能不能包容瓶子那些可能让你无法忍受的特质，还要学会不要用自己单方面的感觉去勉强瓶子。在相处过程中两人虽然有很大差异，但可以通过培养共同的兴趣爱好增进感情。瓶子喜欢新奇探究神秘，蝎子可以利用这一点，把自己变得神秘美丽，让瓶子永远不知道你在想什么，那瓶子就会追着你团团转。就算不是百发百中，那也不会很差，因为解谜是瓶子的最爱。瓶子和蝎子在一起后，可能会受不了蝎子那高低起伏的极端情绪，以及那种占有欲。所以蝎子要给瓶子多点自由，对瓶子多点信任，瓶子虽然豁达，但忍耐度也是有限的。瓶子博爱，在关键时刻要把握好度，不要让蝎子觉得你花心。多疑猜忌是很伤感情的，你们在相处的过程要互相了解，这样才能维持感情。",
        "boy_horoscope": "水瓶座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "风象的瓶子和水象的蝎子，本来就不相交集，实在不是个风生水起的组合。你们虽然不会有激烈的冲突，但在各个方面都有相当大的差异。你们在触电的那一刹那，可能会彼此产生爱慕之意，但深入交往之后，你们会发现那是你们的爱情致命伤。瓶子博爱而又富有人文主义精神，总想着千奇百怪有趣的东西。蝎子的情绪大起大落，有着很强的占有欲。蝎子会忍受不了瓶子的博爱，会觉得瓶子应该属于她们一个人，这对于追求自由的瓶子来说很困扰。"
    },
    "B白羊座+G双鱼座": {
        "girls_horoscope": "双鱼座",
        "results_rvw": "小吵小闹的一对",
        "paired_proportions": "46:54",
        "precautions": "白羊座遇上双鱼座就像小孩遇上老人。双鱼座的人喜欢活在自己的白日梦境中，而且双鱼座是最后一个箱子，有着十二星座的综合情绪，敏感但被动；但双鱼基本是温柔浪漫的，所以羊儿最好收起自己霸气心急个性，在精神层面上给鱼儿带来共鸣。耐心地引导鱼儿向白羊的精神领域靠近，让鱼儿感受白羊灿烂的梦想，还要向鱼儿证实白羊勇往直前的目的是为了实现梦想，这样就引起了精神上的共鸣。投其所好，才能一帆风顺。这爱情之路就能走得更久远。",
        "boy_horoscope": "白羊座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "代表初生的“黄道之子”白羊座和古老轮回结束的双鱼座，一个是开始，一个是结束，一头一尾难结合，这两个星座理应是完全不搭的。可是换一个角度来看：结束不就代表开始吗？所以，这两个星座在一起，可能也不是一件坏事。白羊座是火象星座，双鱼座是水象星座，水火相遇，也不一定水火不相容，反倒因受星座角度的影响，彼此均能得益。"
    },
    "B天秤座+G双鱼座": {
        "girls_horoscope": "双鱼座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "40:60",
        "precautions": "在星座比重上鱼儿虽然比较强势，但对于秤子的花花世界，鱼儿还是会感到有一股挥之不去的压力。秤子对于喜欢黏着他的另一半，往往会缺乏兴趣，他为了追求身心平衡，在工作和娱乐之间都忙透，哪里还有心思去顾及鱼儿的情绪。如果鱼儿不能接受，就会引起双方对立的紧张气氛。鱼儿如果想要跟秤子长长久久地牵手下去。那秤子要试着以“合理”的态度与鱼儿交往，学会包容，理性看待鱼儿那游戏人间的态度，秤子喜欢游离在各种异性之间，但仍然会洁身自好。鱼儿要学会独立些，适当收起幻想和无理取闹，不要让秤子觉得你是他的负担。还有秤子是情场高手，难以抵挡诱惑的鱼儿得看清对方，不要只是成为秤子“浪漫”的对象。不过鱼儿如果喜欢这样的话，那就没办法了！",
        "boy_horoscope": "天秤座",
        "pairing_idx": "40",
        "longevity_idx": "1",
        "compassion_idx": "3",
        "love_advc": "秤子和鱼儿的星座排列和相对的角度都不是很理想，你们基本是属于非安定的星座，这就使得你们有天南地北的差距。你们都具有柔情浪漫细胞的主义者，很容易会彼此吸引。秤子是个浪漫多情的暖男，喜欢和不同的异性交往，但因为不懂拒绝，时常给人生活混乱的错觉。鱼儿是敏感爱幻想缺乏安全感的女生，她们需要爱人所有的爱，绝不会和别人分享一丁点爱。你们的性格存有兼容性但也有差异性，鱼儿的难禁诱惑和双子反反复复的性格，会是你们两个人最大的难关。"
    },
    "B狮子座+G天秤座": {
        "girls_horoscope": "天秤座",
        "results_rvw": "相濡以沫的一对",
        "paired_proportions": "44:56",
        "precautions": "狮子在追求秤子时要注意了，对于摇摆不定的秤子，一定要有足够的耐心。秤子即使对狮子有好感，秤子也会表现出事不关己的样子。虽然在星座比重上秤子比狮子重，但秤子犹豫不决的性格很6，因此还是要靠狮子强有力的支持。秤子虽然聪明却拉不下面子，而狮子虽说爱面子，但对于该放弃的、该退出的决定是果断的，从不拖泥带水。面对这种情况还是需要有狮子来掌控大局。对于傲娇的狮子来说，建议永远比命令适用的多，所以时不时给狮子赞美和掌声能促进你们的相处。特别要提醒的是：生活上要注意开源节流，因为你们都热爱享受，甚至沉迷于高品质的生活中，这种打肿脸充胖子的事可要不得。还有秤子也要多多收敛下你的风情万种，狮子虽然有气度，但秤子招来太多的蜜蜂还是会让狮子醋意大发。",
        "boy_horoscope": "狮子座",
        "pairing_idx": "90",
        "longevity_idx": "4",
        "compassion_idx": "5",
        "love_advc": "火象的狮子座和风象的天秤座相遇，犹如一个贵族碰上一个明星。狮子喜好排场爱面子，秤子八面玲珑善交际，你们是很会“演戏”的组合。狮子喜欢当舞台上的主角，他需要高质量的绿叶来衬托，而秤子恰好是狮子生活舞台的最好观众，而她不喜欢争第一的性格正巧能胜任这个顶尖绿叶的工作。两个人都喜爱热爱，爱团体活动，因此在价值观和生活态度方面极度类似，秤子只要能安心做背后最佳幕僚，把秤子的热爱的活动和心事与狮子分享，这样你们就会相得益彰，甜蜜无比。"
    },
    "B金牛座+G白羊座": {
        "girls_horoscope": "白羊座",
        "results_rvw": "小吵小闹的一对",
        "paired_proportions": "46:54",
        "precautions": "在这对组合里，羊儿显然占尽了优势，但也不要对牛儿失去耐心，不要去苛求牛儿马上对羊儿有反应，毕竟牛儿在任何事情上都慢半拍，力求平稳。也不能要求牛儿凡事按羊儿的标准来执行，牛儿虽然死忠，但人总是有脾气的，所以，毛总要顺着摸，这样牛儿才会服服帖帖。在当羊儿要需要时，牛儿总会出现在羊儿身边，此时，羊儿可以放松心情，尽情享受牛儿无条件的付出。若以能工作组合来推动两人的爱情，相信希望会更大。",
        "boy_horoscope": "金牛座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "白羊座急性子，金牛座稳重，两个星座的性格可以说是不在同一直线上。所以你俩的组合就像“急惊风碰上慢郎中”，显得不太对称。当牛儿碰上羊儿猛烈的爱情攻势时，慢半拍的牛儿往往会反应不过来。不过由于两个星座是相邻，多少还是有一定理解度，只要羊儿能谅解，那也不会造成太大的影响。"
    },
    "B巨蟹座+G射手座": {
        "girls_horoscope": "射手座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "40:60",
        "precautions": "所谓爱上一个不回家的人，说的可能就是爱上一个射手座的妹纸吧！射手座就像是脱缰野马，你家必须得有大草原。内向的蟹子想要掌握射手那无拘无束的心，那蟹子得花费足够的耐心和包容力。而且这种力量得外放，不能内压，要不然一旦射手感到束缚，那射手就会闪得更快。那要如何才能吸引到射手？蟹子可以试着丰富生活，开放自己，让自己变得好玩有趣。蟹子是容易情绪化和敏感的人，在对待神经线快赶得上电线杆的射手时，不要不吭不响，要学着坦白，描述自己的感受，不要让神经兮兮的射手觉得你鬼鬼祟祟。有事就要挑明说，否则射手是不会懂的，那最后受到伤害的还是你自己。",
        "boy_horoscope": "巨蟹座",
        "pairing_idx": "40",
        "longevity_idx": "1",
        "compassion_idx": "3",
        "love_advc": "巨蟹座和射手座简直就是两个极端，蟹子属于居家型，射手属于户外型；一个敏感，一个神经大条。虽然看起来似乎互补，但其实是很难搭在一起的组合。差别这么大，那为什么又会在一起呢？也许刚开始时，射手乐观没机心，或许给了蟹子一种希望吧!但相处后蟹子会发觉射手连根本的小小的安全感都不能给蟹子。蟹子最重要是家，对射手来说，家只不过是间酒店而已！如此发展下去，你们容易整日吵架。两人在确立恋爱关系后，射手座姑娘外出时就会把家里的一切抛诸脑后，连最基本的安全感都无法给蟹子。射手大大咧咧的神经大条，在惹恼蟹子后还不自知。你们两个人如果在一起，到时可能连闷闷的蟹子也会受不了射手的粗神经，和射手姑娘吵起来。所以你们还真的不太适合在一起，还是做朋友好点！"
    },
    "B双子座+G金牛座": {
        "girls_horoscope": "金牛座",
        "results_rvw": "小吵小闹的一对",
        "paired_proportions": "46:54",
        "precautions": "金牛座虽然在面对双重个性的双子座时，会有耐性十足，但双子如龙卷风的瞬间变化，热爱社交像花蝴蝶的举止，还是会让牛儿难以接受的。对于双子的社交牛儿最好不要过于干涉，双子社交频繁，但并不代表会见一个喜欢一个。牛儿应该试图去了解，双子热爱社交、丰富生活内容，那是他们的习惯。尝试去接受一些双子“异想天开”的意见想法，这绝对会对牛儿有所助益，而且也会成为双子最好的听众。在生活上取长补短，对你们的关系也会有更大助益。",
        "boy_horoscope": "双子座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "双子座和金牛座在各个方面都有着很大的差异性，好在两个人个性都相较温和，中和了两个差异性，因此不会发生较大冲突。牛儿对所爱之人都有极强的包容力，恰巧双子又希望有个强壮的心理依靠，因此牛儿和双子在一起，也能算得上一组不错的组合。在相处时，牛儿要多了解双子，不要认为双子能说会道，就认为双子是一个心口不一、两面光的伪善者。"
    },
    "B双鱼座+G摩羯座": {
        "girls_horoscope": "摩羯座",
        "results_rvw": "相濡以沫的一对",
        "paired_proportions": "56:44",
        "precautions": "鱼儿和摩羯在一起搭配是十分互补的。摩羯严肃刻板，鱼儿的浪漫情怀正是摩羯所欠缺和需要的；而摩羯的稳重可以使鱼儿更有安全感。纵然爱情会令人失去理智，但摩羯还是得了解清楚鱼儿爱做梦的个性，在鱼儿做梦的时候，不要以自己的想法去打破鱼儿的幻想，与其对那些不切实际的梦想嗤之以鼻，倒不如给鱼儿实际的支持和提醒。不要过于较真于现实，会让你们相处的更愉快。鱼儿会事事以摩羯为中心，会让摩羯的虚荣心得到满足，但摩羯要对鱼儿的优柔寡断和三分钟热度要有心理准备。鱼儿的能力不低，只是鱼儿的意志可能不如摩羯。摩羯不善表达自己的爱，习惯用眼神来表达爱意，会无时无刻的站在爱人后面支持他们，如果鱼儿能接受这种传统式爱情，那你们将会是幸福的一对。",
        "boy_horoscope": "双鱼座",
        "pairing_idx": "90",
        "longevity_idx": "4",
        "compassion_idx": "5",
        "love_advc": "鱼儿天生温柔体贴细腻，很容易让人产生好感。摩羯很喜欢这种类型。鱼儿和摩羯都是阴性星座，一个感性一个理性，个性一强一弱，搭配在一起不仅有共同之处还会互补。鱼儿爱幻想，时刻都陶醉在自己的梦幻意境中，而摩羯则偏向于保守和务实，像老牛似的做事脚踏实地，一步一脚印。虽然两个人看起来不是很搭扎，但两人在一起刚好凑成爱与被爱，互补有佳的组合。摩羯会被鱼儿的温柔所融化，你们是相辅相成的令人艳羡的一对。"
    },
    "B双子座+G天秤座": {
        "girls_horoscope": "天秤座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "48:52",
        "precautions": "最好的组合就是这种有相同点又有不同点，有立足点相似的思考模式，简直就是门当户对。你们两个人缘都特别好，朋友都特别多，但也不全是都深交的。你们的容忍态度都不怎么样，特别是对柴米油盐等琐事很容易厌烦，没有概念。秤子喜欢把任何事情都视为艺术与游戏般，这和爱新奇刺激和善变的双子挺互通。两人都有乐享主义倾向，都喜欢享受互相给予的融洽情感，就算偶尔有些小意见矛盾发生，也很快就能消弭无踪。在和双子交往时，秤子还是的小心，即使双子的星座个性不强，但好胜心和占上风的性格是不会减少的，特别是双子座男生，口才和机智都是两倍，就连喜新厌旧也是双倍来。",
        "boy_horoscope": "双子座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "双子和秤子都是风象星座，都爱变动，贪新鲜，很自然而然地产生惺惺相惜的感觉，彼此之间默契十足，所以你们一见面往往也一拍即合，很快就会谈起情来。虽然不想火象星座那般耀眼，但也是一对外向、多姿多彩，引人注目的组合。好动的双子最不能忍受的就是无聊，也不愿让家庭琐事舒服自己，也许双子很会做家事，但这绝对不是双子的生活重心。刚好秤子也不是家居动物，因此两人在一起相处还是很愉快。双子随性而果敢，做决定随意而冲动，想到就马上去做。而秤子却大不相同，秤子老是在天平两头看来看去，生怕出差错。尽管如此，在双子看来，秤子的魅力还是无法抗拒。"
    },
    "B白羊座+G金牛座": {
        "girls_horoscope": "金牛座",
        "results_rvw": "小吵小闹的一对",
        "paired_proportions": "54:46",
        "precautions": "白羊座和金牛座在一起，其实也是一对孩子气蛮重的组合，他们都有着童心未泯的个性。牛儿虽然很能容忍、不妒忌，但占有欲强，羊儿个性豪迈，喜欢交际，牛儿若爱上羊儿，可以在一定程度上给予对方更大的自由和空间。同时牛儿也不必时时为羊儿善后，不妨放开心胸促使不要学习平稳冷静，带着羊儿向前，在生活上学习取长补短。",
        "boy_horoscope": "白羊座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "白羊座性急，金牛座慢半拍，这两个星座在一起就像龟兔赛跑，牛儿永远跟在羊儿身后。你们在一起更多的互补作用，金牛座总是无怨无悔地为性急的白羊座收拾善后，默默地付出。有时你们也会像一对童心未泯的孩子，童心很重，在一定程度，牛儿还蛮依赖羊儿。"
    },
    "B狮子座+G天蝎座": {
        "girls_horoscope": "天蝎座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "58:42",
        "precautions": "在爱情中你们都是个性强的人，狮子强在外，率直坦白，强势不饶人；蝎子强在内在，凡事计较于心。两个人在一起还听勾心斗角，大家都想管住对方，这样争执是免不了的。个性强悍、外冷内热，自我为王的蝎子，在一定程度上是很难接受另一个自认为王的家伙。而狮子也是相当自私的，凡事都得以他为中心，什么都得听他指挥，把自己当皇上一样。在星座比重上比他弱的蝎子，要做好“幕后黑手”的心理准备。但若是真的爱一个人，偶尔被指挥一下又有何妨呢？当然这得蝎子心甘情愿屈才才行，要不然两个互不相让的人相处起来，不发生争吵才怪。其实，狮子热情开朗，蝎子只要稍微弱势些，相处久了，蝎子就会发现狮子也并不是一个“啥都唯我独尊”的人，原来他也有亲切、爱心的一面。要想驯服这头狮王，那就得看蝎子如何去运用你的高情商和魅力了。",
        "boy_horoscope": "狮子座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "蝎子是水象星座之王，狮子是火象星座之王，俗话说：“一山不能容二虎”，要想让彼此看对眼，确实是有点难。但蝎子若爱上狮子的话，不如试着和狮子成为工作搭档，慢慢地培养感情，这其实是挑不错的捷径。特别是蝎子若掌握了狮子的优点，时不时给狮子赞美，这样的话手到擒来就是SO Easy了！只是狮子无论外表多斯文，其实内心都是极为争强好胜的，能不能相互包容，实则有点难说。蝎子天生挺敏感的，当狮子收到伤害时，蝎子对此也会感同身受，这种伤害如果是蝎子自己带来的，或是外人制造的，蝎子就会进行自我安慰或采取保护措施。"
    },
    "B处女座+G金牛座": {
        "girls_horoscope": "金牛座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "52:48",
        "precautions": "你们两个是典型相敬如宾的组合，由于你们两个在个性和领导欲上都不强，所以你们常常会因为过于尊重和迁就对方，在很多事情上难以做出果断的决定。你们相互体谅的缺点，是一种相互尊重的和谐。你们的平淡和保守，有时会被别人讥笑为“不长进”，不过你们不以为意的话，那就无所谓了。你们会因为爱而依着对方、顺着对方。这样的相处方式虽然很甜蜜，但也会因此给双方造成不小的压力。喜欢悠闲自在的牛儿，有时会对处女座的一丝不苟与神经质感到厌烦，若牛儿能睁一只眼，闭一只眼来看待处女座乐观、慢半拍的个性，则可以逐渐拉近两人的感情。",
        "boy_horoscope": "处女座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "处女座和金牛座都是土象星座，观念上有很多相似的地方，同样追求平实而稳定的生活，不喜欢冒险，并且容易达到心灵上的满足。你们可能不会一见钟情，但能稳重中求成长，都会经过一段长时间的观察，才确认对方是自己人生的另一半。牛儿通常不修边幅，而处女的人又有洁癖之心，但只要你们个性、观念沟通得当，处女座对牛儿在生活上的散漫，也会有包容之心。"
    },
    "B金牛座+G巨蟹座": {
        "girls_horoscope": "巨蟹座",
        "results_rvw": "相濡以沫的一对",
        "paired_proportions": "44:56",
        "precautions": "你们俩个都比较内向，蟹子有着如母爱般的爱情方式，而牛儿也享受这种母爱性的掌握。但有时也会倍感压力，但幸好牛儿比较弱势，所以不会容易反弹。对于多情的蟹子来说，他想要一份坚定的爱情，而牛儿认定后不易改变的情操，很是适合蟹子。牛儿虽然性格稳重，但脾气也不小，一急起来，脾气又爆又拗，这就需要蟹子有耐性去对待。巨蟹座敏感多变，金牛座固执又拗，你们想要厮守，那就要彼此多了解双方。在约会的选择上，不如多去室外活动活动，在外面展示下女友力，让蟹子更有安全感。",
        "boy_horoscope": "金牛座",
        "pairing_idx": "90",
        "longevity_idx": "4",
        "compassion_idx": "5",
        "love_advc": "两个同是阴性星座，金牛坐属土象，巨蟹座属水象，而且位置相当接近。个性观念上有不少相同之处，是甜蜜恩爱的一对组合。虽然牛儿做事总是慢半拍，但只要爱上一个人就会很忠诚专一，会用力去守护这份感情，这正是感情缺乏安全感的蟹子所需要的。蟹子在牛儿面前也不必戴面具，可以洒脱做自己。"
    },
    "B双鱼座+G射手座": {
        "girls_horoscope": "射手座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "42:58",
        "precautions": "两人的相似点可以让两个人更加紧密相守，但有时也会成为感情的致命伤，这就要看你们怎么处理，愿不愿意去了解彼此。要知道火能烧干水，水也能灭火，鱼儿和射手就是水象和火象的组合，你们谁强过谁都不好说。射手可能会认为鱼儿优柔寡断，不可否认，鱼儿敏感、具有牺牲奉献精神，不忍心伤害别人，但这也是射手值得学习的地方。射手不要嫌弃鱼儿没主见，鱼儿看事情可能比你还广。鱼儿和射手在一起后，要注意改变自己柔弱的性格，凡事要有主见，遇到委屈要表达出来。射手要多加照顾鱼儿的情绪，不要忽视鱼儿在精神上的需求。射手若能以宽阔的胸怀平衡双方差别，两人互相配合，那你们会更幸福。",
        "boy_horoscope": "双鱼座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "火象的射手遇上水象的鱼儿，就是火遇上水，一火一水在一起容易出现喜忧参半的情况。对射手而言，谈感情的对象始终不是归人而是过客，而鱼儿浪漫很难抗拒诱惑，所以只要有机会，你们还是容易一拍即合。射手虽陶醉于鱼儿的柔情蜜意、自我奉献的关怀照顾。但射手那快嘴豪爽的交友性格，喜欢把精力放在朋友身上，这样就会冷落了鱼儿，使鱼儿伤心感到没有安全感。鱼儿在感到寂寞时就会很容易被他人的温柔所诱惑，所以，射手爱上鱼儿，那就要让鱼儿的心稳下来。"
    },
    "B双子座+G双子座": {
        "girls_horoscope": "双子座",
        "results_rvw": "相处和谐的一对",
        "paired_proportions": "50:50",
        "precautions": "双子座的人大多数都是属于健谈、机智反应快、思考模式跳跃的类型。一个双子座等于两个人，两个双子座那就相当于四个人；在外人看来，这样的相处真的是让人目瞪口呆，但两个双子座的人确实是如此相处。你们维持关系的关键是要如何常保新鲜感、新话题、新目标。需要特别注意的就是:不要以“他”之心度己之腹，妄想自己可以识破同路人的心思，这样做反而会产生反制力！",
        "boy_horoscope": "双子座",
        "pairing_idx": "80",
        "longevity_idx": "4",
        "compassion_idx": "4",
        "love_advc": "两个都是双子座的人，观念和行为模式有有着极其相似的地方，你们共同的兴趣，及运动项目很多，两人交往乐趣无穷。你们彼此的心意一点就通，不需要明说，可以将彼此的性格发挥到淋漓尽致，相辅相成。所以你们将会是一对情谊深厚、生活多姿多彩的组合。但这样也就产生了一个残酷的现实，因为太知己知彼，太过懂对方，所以你们的缺点都很容易放大，只要对方动一动尾巴，不需要说出来，也能知道心里的想法，那也是挺危险的！"
    },
    "B处女座+G狮子座": {
        "girls_horoscope": "狮子座",
        "results_rvw": "小吵小闹的一对",
        "paired_proportions": "46:54",
        "precautions": "表面刚强霸气，实则内心孤独的狮子和处处显露纤细文雅的处女座，从性格上来看，有着很深的隔阂。不过还好狮子的星座个性和主导性都不强，处女座可以将狮子收在自己的保护圈中。生活中，处女座会是狮子最佳幕僚和执行的好帮手，只要狮子稍微将自己的大女人傲娇姿态收敛下，处女座会更欣赏狮子。处女座要想和狮子过得更顺利，就要养成多赞美狮子的习惯。当狮子受到恰当的赞美和宠爱时，平日里傲娇、自我为中心的狮子就会变得温柔体贴，善解人意的女生。狮子面对处女座特别要注意谨言慎行，处女座是追求完美的压抑者，只要狮子能忍住处女座的毒舌挑剔，你们还是会有快乐的结局。",
        "boy_horoscope": "处女座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "在星座排列上，处女座和狮子座是两个相邻的星座，一般而言处女座会承袭狮子的某些特性，可事实上并没有，而且刚好相反，处女座看似温柔秀慧，其实防卫力和自我要求都很强，而狮子，外表很霸气，实则内心脆弱得很，经不起打击。在最初相识时，处女座会因为狮子的开朗大方而被吸引，狮子会因为处女座那善于算计的头脑，，而觉得处女座会在自己的事业有很大帮助。可是经过长时间深入了解，狮子就会发现事实并不是那样，处女座总是会伤害狮子的自尊心。处女座通常有洞察先机的特质，有时难免杞人忧天、神经兮兮，容易让乐天的狮子感到烦不胜烦。"
    },
    "B处女座+G水瓶座": {
        "girls_horoscope": "水瓶座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "40:60",
        "precautions": "处女座和水瓶座的个性都不强，但从两个人的星座比重来看，处女座明显的比水瓶座差了一大截。与其自以为是傻乎乎的去爱水瓶座，处女座倒不如用分析能力，去了解瓶子，试着去理解瓶子天马行空的想法。两个人在一起，通常是以为处女座觉得瓶子很平易近人，见识多广，正是自己欣赏的类型。可瓶子对爱情是个标准的利己主义者，处女座必须够独立，凡事自己来，这样才能找出两个人最佳相处模式。千万不要以为瓶子没了处女座就不行，在爱情和压力上，瓶子是绝不会惧怕后者，所以不管处女座对瓶子爱的有多深,也不要把瓶子抓得太紧，感情抓的越紧漏地也越快。放松点，处女座也许才是最大赢家。",
        "boy_horoscope": "处女座",
        "pairing_idx": "40",
        "longevity_idx": "1",
        "compassion_idx": "2",
        "love_advc": "知性、理性的处女座和好奇、属于未来的水瓶座，其实是很不搭调。处女座跟水瓶座触电了？那可能是一时的意乱情迷，处女座之所以跟水瓶座触电，可能是被瓶子的创造力所吸引，瓶子也很欣赏处女座的冰雪聪明。但经过深入的了解后，处女座发现瓶子变化无常不说，还经常做一些不切实际的事，而瓶子也觉得太过死板固执，什么事都要抓的紧紧，不懂得转完就算了，还过分啰嗦。因此两人常会因沟通不来的情况下一拍两散。"
    },
    "B水瓶座+G白羊座": {
        "girls_horoscope": "白羊座",
        "results_rvw": "相濡以沫的一对",
        "paired_proportions": "44:56",
        "precautions": "瓶子和羊儿很登对，而且瓶子很容易掌握羊儿，你们一般由邂逅、攀谈开始继而展开交往，会在和谐的气氛下友善地沟通。但瓶子变化多端，有时会让羊儿摸不着头脑。羊儿妹纸缺乏忍耐力和持久力，对事往往只有三分钟热度，瓶子对羊儿这项缺点要以宽容的心去理解。虽然瓶子和羊儿很合得来，但瓶子不喜欢被束缚，羊儿和瓶子在一起时，那就要把自己的好胜心收起来，保持轻松的心情去和瓶子相处。这样瓶子就逃不出羊儿手掌心，会更加迷恋羊儿。",
        "boy_horoscope": "水瓶座",
        "pairing_idx": "90",
        "longevity_idx": "4",
        "compassion_idx": "5",
        "love_advc": "热情有劲的羊儿和聪明博爱的瓶子，虽然属性不同，但有许多相通之处。瓶子是古灵精怪的，对事物都充满好奇，而羊儿对于事物的好奇心不亚于瓶子，正好与瓶子不谋而合，两者都钟情于尝试新事物。瓶子和羊儿都是爱玩的星座，两个人可以牵手去闯荡新世界，生活充满了新奇与刺激。你们两个人性格很合得来，可以很好的交流，就算吵架也可以很好的解决。"
    },
    "B巨蟹座+G天蝎座": {
        "girls_horoscope": "天蝎座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "48:52",
        "precautions": "当然了，有喜肯定有忧，虽说你们是两情相悦的天生一对，很多感觉都可以尽在不言之中，觉得都很了解对方，但却忘了你们都是感情内敛的人，很多时候也容易钻牛角尖。因为蝎子独占、支配强，然鹅蟹子的嫉妒心也挺重，所以生活上难免少不了会有些小波折和冲突。不要仗着以为很了解对方就不把心里的话说清楚，等哪天一时不察的时候就势必会发生冲突。不要不在意你们之间的这些小冲突，若不妥善处理，可能就会引发更惨烈的情况。发生不愉快要和对方好好谈谈，蟹子是十二星座里最需要安全感的，蝎子要多多体谅蟹子阴晴不定的情绪，温柔地对待蟹子。要善待蟹子的家人，特别是蟹子的母亲，因为蟹子是个家庭观念很重的人。",
        "boy_horoscope": "巨蟹座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "两个星座都是同属水象星座，都很敏锐感性。且个性、人生观都相似，经常会产生一见钟情的感觉。蟹子和蝎子都是讲求感觉的星座，你们的感情一切尽在不言中，有一种惺惺相惜的默契。在刚开始恋爱时，你们未必会缠绵热恋，但相处时间久了，热情就会日渐升级，是十分速配的一对CP！蟹子和蝎子在一起相处是十分和谐的，一般而言，蟹子是个很麻烦的星座，蟹子的情绪变化让人难以捉摸；但蝎子对却对蟹子的特性和感觉，一眼看穿，了解蟹子所需要的安全感。蟹子相当依赖蝎子，能够安抚蝎子的多疑，蝎子可爱富有决心，在很多时候也能给蟹子更多的信心。蟹子和蝎子都以自己二人的家为第一位置，蟹子也甘心被蝎子操控，知道怎样可以令蝎子享有一个温暖愉快的家！"
    },
    "B双子座+G双鱼座": {
        "girls_horoscope": "双鱼座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "42:58",
        "precautions": "其实，双子座对新事物的接纳度和追求力，是很能够刺激爱幻想的双鱼座，特别是艺术创造方面。善变的双子不会觉得鱼儿的幻想构思不切实际，双子的敏感性一点也不比鱼儿差，因此，鱼儿对着双子不会有对牛弹琴的感觉。但是鱼儿要了解你们之间的敏锐是不同，鱼儿是敏锐是动物性，双子的是科学性，所以双子通常不会像鱼儿一样感情用事。鱼儿对待双子时千万不要用一哭二闹三上吊的法子，这样只会使双子更快地衡量情势而合理化地逃跑。 只要别让双子觉得鱼儿是爱哭又爱闹的女生，以双子好新鲜、好学习的特质，一定会乐于与多才多艺又浪漫多情的双鱼座女孩长相伴的。",
        "boy_horoscope": "双子座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "双子座和双鱼座两个人并不是很默契的一对，因为两个人都不属于同一类型，且有着多面性格和多变的情绪。鱼儿是南鱼加北鱼的复杂性格，双子是东子和西女的双重性格，复杂加复杂，将使您们陷入一种极其微妙的复杂关系中。两个人的性格中都有分裂矛盾的因子存在，尤其是这些延伸出的多变性，会令您们相互吸引。你们除了最初会因性的吸引力被对方迷倒外，相处一久，就会发现很难融入到对方的陌生世界中，因此也就越来越想脱离对方。另外，以感情为前提的鱼儿，在与双子交往的过程中，会因双子的玩世不恭而产生没有安全感的感觉。同时双子座的锐利言词也会使鱼儿难以招架。"
    },
    "B双鱼座+G水瓶座": {
        "girls_horoscope": "水瓶座",
        "results_rvw": "小吵小闹的一对",
        "paired_proportions": "46:54",
        "precautions": "鱼儿和瓶子的组合虽然分数不错，但不要忘了你们之间的差异点：鱼儿一切以情感、情绪为抒发点，瓶子则是一切以理性为出发点。鱼儿是敏感脆弱的，对于瓶子这种理智重于感情的人而言，想要维持这份易碎的感情可不易。瓶子在鱼儿谈恋爱的时候，讲求浪漫的同时也会注重物质的要求。瓶子要注意自己的博爱，不要到处花花心肠，这样只会让鱼儿感到没有安全感而“向外发展”。你们在一起虽然会存在一些争吵，但要多站对方的角度去为对方想想。相辅相成，以长补短，这样你们相处起来很更轻松愉快。",
        "boy_horoscope": "双鱼座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "虽然风与水、阳性星座和阴性星座不合，但由于你们是相邻的星座，可以说是风象和水象组合里最好的一对。鱼儿是“梦幻星座”，喜欢幻想富有文艺气息；而瓶子是“未来星座”，有开拓精神，想象力丰富，脑海里装着未来世界，两个都是脱离现实，喜欢沉迷于在自己梦幻中的星座，两人在一起能找到共同的步调。鱼儿的温柔和善解人意都符合瓶子的爱情观。而瓶子也很欣赏鱼儿的牺牲奉献精神，很容易坠入鱼儿的情网中。两个人在一起看起来还是蛮不错的一对。"
    },
    "B白羊座+G天秤座": {
        "girls_horoscope": "天秤座",
        "results_rvw": "相吸相斥的一对",
        "paired_proportions": "50:50",
        "precautions": "秤子会被羊儿的果断、明亮开朗的个性深深得吸引；而羊儿也为秤子的聪明、机智所吸引。但交往后，秤子会发现羊儿虽体贴，但做事冲动。羊儿很自我，遇到不同意见就会抱怨，而秤子总能适时给予建议和疏导。秤子不要试图去改变羊儿，自我的羊儿最受不了的就是自己的想法被别人指指点点。而羊儿也要记得秤子是平稳有序的，不爱新鲜和尝试，羊儿不要过于干预秤子，而是要去保护秤子的内心世界。羊儿对事的看法很前卫，可在家庭两性关系中却有着传统思想，这对于秤子来说是一大忌。秤子在和羊儿相处时，遇事不能与羊儿正面冲突，得想法子哄着羊儿。",
        "boy_horoscope": "白羊座",
        "pairing_idx": "60",
        "longevity_idx": "2",
        "compassion_idx": "4",
        "love_advc": "粗鲁豪迈的白羊座配气质优雅的天秤座，这是一对令人大跌眼镜的组合，俩人初了同属阳性（男性）星座外，其他方面都是相反的。羊儿欣赏秤子的品味，但又相当受不了秤子凡事都要思量，没主张的个性；相反秤子也对羊儿那种藏不住喜怒哀乐，藏了不了心事，做事不够聪明、鲁莽的性格。"
    },
    "B天秤座+G摩羯座": {
        "girls_horoscope": "摩羯座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "58:42",
        "precautions": "秤子过日子就像享受人生一样，他们人缘很好，却有着调情圣兽的味道，在感情上你分不清他们是真情还是游戏。摩羯不愿让人知道她的内心想法，但却希望爱的人能理解她。摩羯的独立个性，让她即使拥有了爱情，也依然保持女强人的形象，这样一幅独立架势在外人面前让秤子感到很没面子，这对秤子来说是一种无法忍受的自尊践踏。摩羯试着去欣赏秤子人生就是游戏的哲学，放开心去享受秤子的创意，他也是有很多你没有的才能。你们在很多地方确实存在着很大的差异，如果是谈恋爱的话还挺合适，可以为彼此留下没空回忆，但要牵手一辈子生活，那你们就要面对、认清你们的差异，找出彼此优点，做出适当的改变，互相尊重，懂得为对方着想，或许你们之间还是会结出爱情的果实。",
        "boy_horoscope": "天秤座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "秤子是风象，摩羯是土象，从星象组合来看，你们是不太合拍的一对，土需要风带动，而风却不需要土。所以，风与土还真是不怎么协调，你们的组合只能算普通。摩羯一见秤子就会被他的优雅和风采所吸引，但秤子却不一定能识摩羯的内在美。秤子优雅自信，会听取别人的意见，是很好相处的人，而摩羯是个强势的人，有着统治欲望，凡事都要占上风。也许在别人眼中摩羯是个女强人，有聪慧的美。但对秤子来说，摩羯这种女强人形象让人倍感压力，敬而远之。"
    },
    "B摩羯座+G天秤座": {
        "girls_horoscope": "天秤座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "42:58",
        "precautions": "秤子乐观向上，而摩羯遇事总往坏处想，你们两个无论因什么原因相遇在一次都很难相处融洽，但彼此了解后，就会成为密友。鱼与熊掌不可兼得，爱情中总得舍弃些什么，才能得到些什么，爱情需要两个人的配合。特别是像摩羯这种严父型的星座，秤子得以柔克刚，把心中的想法说出来，让摩羯知道。摩羯喜欢严于律己，而且又固执。这对喜欢自由、觉得人生就该享受的秤子来说实在是难以接受。就工作方面来说，你们俩是不错的搭档，摩羯的强大野心和谨慎正是秤子所缺乏的，而秤子擅长处理人际关系和随性的性格也刚好可以弥补摩羯。秤子开朗乐观，愿意听不同的意见，也勇于认错改正，是很好相处的人。",
        "boy_horoscope": "摩羯座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "务实的摩羯和自由的秤子在星座排列上并非成吉角，你们两个既不相似也不互补，想凑在一起有点难度。你们之所以会触电，多数是因为彼此身上有你们所没有的特质。摩羯很崇拜秤子社交手段和处理感情欲擒故纵。摩羯的老派和不浪漫对秤子来说一点都不像她的白马王子。但秤子的应变能力强，会在适当的时候做让步。秤子在经历多次感情失败后，遇上老实的摩羯，会被摩羯的稳定吸引，但发展下去后，会发现摩羯让她没有了自由性。"
    },
    "B双鱼座+G狮子座": {
        "girls_horoscope": "狮子座",
        "results_rvw": "未来渺茫的一对",
        "paired_proportions": "40:60",
        "precautions": "鱼儿和狮子是属于水深火热的一对，你们的差异有如天上地下，但却十有八九互相喜欢。狮子座男性是真正的男子汉，狮子座女性是阳刚的女强人；双鱼座男性温文尔雅，双鱼座女性则是女人中的女人。无论狮子座是男是女都可以从双鱼座身上获得最大的满足感。霸道的狮子会因为有人将她视为全部而感到满足，而鱼儿也觉得狮子明艳的气质让自己倍感面子。但经过一段时间，鱼儿就会受不了狮子的强势，一般温文尔雅的鱼儿都是处于弱势，时常被狮子压着。鱼儿面对问题时不要总是逃避，要学会面对解决，要不然狮子会觉得你软弱无能，看不起你，那你们这对真的前途堪忧了。",
        "boy_horoscope": "双鱼座",
        "pairing_idx": "40",
        "longevity_idx": "1",
        "compassion_idx": "3",
        "love_advc": "水象的鱼儿和火象的狮子有着绝对的差异性，他们不能想鱼儿和瓶子那样至少还有点互补，他们在一起就像两条不会相交的平行线，完全没有交集，想拉都拉不近。狮子若是想和鱼儿在一起，那狮子先得理解鱼儿的和颜悦色完全是演的，其实心里对你的自以为是很是不满。鱼儿总是一副多愁善感的样子，而狮子则是散发着自信和热情，这些特质看起来你们是可以互补的，但实际上，狮子有着很强的占有欲和控制欲，时间长了，会把鱼儿压的透不过气来，相反，狮子也受不了鱼儿的优柔寡断。"
    },
    "B金牛座+G金牛座": {
        "girls_horoscope": "金牛座",
        "results_rvw": "相处和谐的一对",
        "paired_proportions": "50:50",
        "precautions": "两只牛儿在一起，就像照镜子一样，看的都是自己，在个性和行为模式上都太像。都久缺开拓冒险精神，所以两个在一起经常会在有效时间内，做不出决定性的事。在语言上，你们欠缺表达能力，你们的语言仿佛只有你们自己才懂；你们过于谨慎，不易表达情感，这样就很容易发生与爱失之交臂、爱恨离别的惨剧。你们性格固执且一条筋，很多事容易各执已见，不懂得退一步为对方着想。在这方面，你们要懂得用你们独特的沟通方式去化险为夷。",
        "boy_horoscope": "金牛座",
        "pairing_idx": "80",
        "longevity_idx": "4",
        "compassion_idx": "4",
        "love_advc": "金牛座男生和金牛座女生相配度相当高，俩人性格相似，有着相同的价值观、世界观，有共同话题。你们感情发展并非一见钟情，而是如同炭火般，越烧越旺。随着时间推移，你们会越发了解对方。你们的感情酝酿过程相比其他星座组合而言要来的久，但却是最温馨的一对。在这么多星座里，没有其他星座比金牛座男生更吸引金牛女的目光，因为你俩有太多相同点，性格也相似，实际、忠实有耐心，对未来憧憬同是行动比动作慢；缺乏积极性，但骨子里却是固执又倔强。你们很少发生矛盾，即使有少许的矛盾也是思维摩擦的火花。"
    },
    "B射手座+G双鱼座": {
        "girls_horoscope": "双鱼座",
        "results_rvw": "需要维持的一对",
        "paired_proportions": "58:42",
        "precautions": "鱼儿对待诱惑是难以抗拒的，射手就像一个猎人似的，对鱼儿是随发随中，鱼儿根本毫无抵抗力。所以当射手向暧昧信号时，敏感纤弱的鱼儿一定要睁大眼睛认清情况，不要随便动心。射手虽然喜欢谈恋爱，但射手的自由天性不见得会和鱼儿厮守一生，如果鱼儿想要得到这个猎人的心，那鱼儿一定得动脑子想计谋，而且一定要比射手聪明，比如对射手若即若离，吊吊射手的胃口。还有提醒鱼儿一点：你是个容易情绪波动的人，而射手的脾气容易心浮气躁，而且直来直往，像头蛮牛一样。那鱼儿得学着放开心胸，有时神经也跟着射手大条一下，鱼儿和射手找到了平衡点后，就会发现和射手在一起也是蛮快乐的唷。射手不雅嫌弃鱼儿没主见，有时鱼儿看东西的广度能缓和射手个性的专横。",
        "boy_horoscope": "射手座",
        "pairing_idx": "50",
        "longevity_idx": "2",
        "compassion_idx": "3",
        "love_advc": "射手和鱼儿容易一拍即合，但你们想要长久相处就得多花点心思。射手对待爱情是自由不羁的，一不合适就会二话不说转移目标；鱼儿对待爱情则是得过且过，往往是稀里糊涂地就爱上了，从来不会放眼未来。当鱼儿知道射手想退出，开始一段新恋情时，就会用各种纠缠方式让射手脱离不得，最后就会造成难以收拾的局面。鱼儿的似水情深被射手触碰的结果就像：水壶里的水一下子就沸腾。所以在爱情中鱼儿对射手简直就是弱势中的弱势。鱼儿若是想扭转弱势，那首先得收起敏感的心，因为射手挺神经大条的，然后做一条好奇心强，且健康有活力的鱼儿。在长远角度来说，你们还得靠沟通才有将来。"
    },
    "B天蝎座+G射手座": {
        "girls_horoscope": "射手座",
        "results_rvw": "小吵小闹的一对",
        "paired_proportions": "54:46",
        "precautions": "双方应给予彼此自由，不要试图去改变对方固有的生活方式。蝎子如果爱上外向的射手，首先蝎子得引起射手与你交朋友的兴趣，然后在延续两个人爱的火花。在这里，蝎子得先认清一个事实，虽说你的星座比重高于射手，但想驾驭射手，还是有难度的；要想抓住射手，蝎子得欲擒故纵，懂吗？蝎子要试着去接受射手好冒险，爱自由的天性。射手虽然是有名的花花心肠，但是射手与蝎子一样也会为爱倾注热情。对付射手的最好方法就是给很多很多的宽容。",
        "boy_horoscope": "天蝎座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "蝎子是水象星座，射手座是火象星座，水火不相容，两个人基本看起来都不怎么搭。射手喜欢自由，喜欢热闹的场合，爱好去旅游，要是受到束缚，会感到压抑。而蝎子喜欢独处，不愿被打扰，注重隐私的他，就更不喜欢交际。于是你们就会在待人接物这方面产生矛盾，但只要提前沟通好，互相退让下，还是可以解决的。还有射手似乎对蝎子的深谋远虑怎么也搞不清，对很多事都很在乎；而蝎子则是疑惑射手为何为了自由而逃避责任？不过由于射手位于蝎子之后，你们之间的隔阂不会像其他同质性星座那么大。"
    },
    "B摩羯座+G水瓶座": {
        "girls_horoscope": "水瓶座",
        "results_rvw": "小吵小闹的一对",
        "paired_proportions": "54:46",
        "precautions": "瓶子不要以为摩羯看似简单，实则摩羯并不单纯，而且严肃的很。摩羯做事太过实际，但对瓶子而言，摩羯就像镇静剂，能为瓶子带来安定感。瓶子和摩羯在一起，得学会尊重摩羯的家人，摩羯认为父母为天，他希望自己的爱人也能尊重父母。建议瓶子和摩羯能以工作的配合模式来谈恋爱，这样你们就会因实际的共同目标而携手。摩羯的注意力也会分散，瓶子也会觉得自由。瓶子擅长规划未来和摩羯刻苦耐劳的精神相结合，这样的搭配是无往不利啊！",
        "boy_horoscope": "摩羯座",
        "pairing_idx": "70",
        "longevity_idx": "3",
        "compassion_idx": "4",
        "love_advc": "在一般人看来，土象星座和风象星座是不合的，但也有例外的存在，摩羯和瓶子是相邻的星座，是这两象星座配对里比较好的一对。瓶子会被摩羯沉默有深度的外型而吸引，感觉摩羯沉稳老实可靠，可是当瓶子跟摩羯接触后，就会发现原来摩羯是老谋心算，而且自私。瓶子有事总喜欢写在脸上，相反摩羯比较沉得住气。摩羯跟瓶子一样是不太交心的星座，而且不像瓶子那样表面有亲和力。摩羯外表不但有距离感，连心也不好接近。"
    },
    "B巨蟹座+G金牛座": {
        "girls_horoscope": "金牛座",
        "results_rvw": "相濡以沫的一对",
        "paired_proportions": "56:44",
        "precautions": "巨蟹座和金牛座都是比较内向，蟹子虽然总是可以给牛儿温馨体贴的感觉，但有时牛儿会对蟹子的占有欲和粘人倍感压力。蟹子情绪敏感多变，牛儿固执能熬，两人能否在一起，就要彼此如何看待对方的个性了。而且在恋爱中，大家要多点信任和体谅才能更好地促进感情的升华。虽然牛儿和蟹子，但蟹子的情绪多变，往往会让牛儿摸不着头脑。牛儿通常都是情绪平稳的，所以无法体会到蟹子的多愁善感，务实的牛儿很少会花时间去感伤和抱怨。感伤的蟹子牢骚多了，牛儿就会感到头疼。而牛儿顽固的性格，在表现一种情绪上也是专业户，持续的时间会很长。所以双方要各退一步，蟹子控制她的情绪，牛儿收敛自己的固执。",
        "boy_horoscope": "巨蟹座",
        "pairing_idx": "90",
        "longevity_idx": "4",
        "compassion_idx": "5",
        "love_advc": "水象巨蟹座遇上土象金牛座，俩人不仅位置相近，而且都同属阴性星座，所以两个人在个性和观念上有很多相同之处。虽然两人在相处过程中会发现有很多的相同点，牛儿依然对蟹子的情绪一头雾水，牛儿很少会为打翻的牛奶哭泣，而蟹子则常常为自己的情绪找发泄口，让牛儿的百无一用是感性，因此两人在情绪方面的沟通交流还需多多努力。金牛座的女生喜欢娇惯另一半，会无微不至地关心另一半，凡事会为对方着想。牛儿对于蟹子的温柔体贴很受用，在蟹子有难处时，会适时给予怜悯和帮助，这对于蟹子而言，会使他们很感动。牛儿对于家庭的责任感和感情的执着专一，这正是缺乏安全感的蟹子所需要的。牛儿的踏实肯干，能为家庭带来财富，而蟹子是贤内助，会将家里的一切都打理好。两歌人互相配合，生活将过得很甜美。他们会是对方理想的另一半，两个人能够组建一个完美的家庭。这样的你们是让人羡慕的一对。"
    },
    "B天秤座+G射手座": {
        "girls_horoscope": "射手座",
        "results_rvw": "相濡以沫的一对",
        "paired_proportions": "44:56",
        "precautions": "秤子崇尚美好的事物，认为日子就得过得轻松自在，那才有人生意义。秤子是天生的外交家，和射手一样喜欢结交朋友，把朋友关系看得很重，你们彼此之间不设防，独立并互不干预，都有各自的朋友圈。你们都知道不能用感情来束缚对方，要是把对方抓的越紧那就会失去越快。你们保持新鲜感的秘诀就是保持轻松自在的相处方式。秤子和射手都缺乏对爱的坚持和耐心，很难断绝爱玩、求新鲜的心。虽然你们都互不干预对方的生活，但你们也会争吵。双方要讲出自己的想法，彼此才能谅解，才会更加亲热地在一起。 你们最好能一直维持好朋友式的爱恋关系，即使没有热恋的温度，也能够因相知相契而过一世。",
        "boy_horoscope": "天秤座",
        "pairing_idx": "90",
        "longevity_idx": "4",
        "compassion_idx": "5",
        "love_advc": "风象星座的秤子和火象星座的射手，同属阳性星座，从星座位置排列来看也是吉角，可以说是蛮速配的一对啦！射手不是不体贴另一半，只是她一旦迷上某事，就会对周围的东东莫不关心了，包括她的另一半，犹如透明般存在。遇上深懂人际关系的秤子，射手大可不必时时都管着秤子，这样一来能给彼此自由的空间和距离。射手喜欢自由和随性，不喜欢被束缚，和秤子在一起，不仅能得到被爱的幸福，还可以得到互相追求自由的尊重。在这种相处模式下，你们两个人在一起完全没压力，会感到轻松自在，互惠互利、相得益彰。但射手要注意了，别被快乐冲昏头脑，秤子跟你一样，觉得交友、恋爱跟结婚是不同的两回事，所以可别太“散”。想要维持两人的感情，射手一定要学会适可而止，共同建立相互的信任感。"
    },
    "B双子座+G射手座": {
        "girls_horoscope": "射手座",
        "results_rvw": "相吸相斥的一对",
        "paired_proportions": "50:50",
        "precautions": "你们身上都有阳性星座的特质，但射手不喜欢双子的善变性格和两面性的做法，而双子也接受不了射手的粗心大意和神经大条，老刺激双子的敏感心灵。虽然射手会在双子身上看到自己没有却想要的特质，但又无法接受双子的善变和神经质。虽然射手也是个不稳定的神经型星座，却依然看不惯双子那种换跑道就像逛街一样的“造势”作风。两人都情绪起伏频繁，男方尤甚。这当然很容易产生摩擦，因为两人的出言不逊或唐突在对方低潮时，要克制自己。无论平日多么爱讥讽或随心所欲地放大炮，这时也应克制自己，多向对方表示温存。射手若爱上双子就该了解你们之间的差异。还有你们俩都是非常轻易同时爱上两个对象以上的人，因此，彼此稳定交往的前提，就是要先弄清楚自己的心。你们之间最好的相处方式就是取长补短，要多充实自己，多共同参加所爱的活动。",
        "boy_horoscope": "双子座",
        "pairing_idx": "60",
        "longevity_idx": "2",
        "compassion_idx": "4",
        "love_advc": "你们是的星座排列呈180度，在一起的话只有两个可能，要么极端的好，要么极端的坏。你们面对的问题就是单独相处的时间太少了，你们都是外向性格，而且朋友多、嗜好也不少，很难会享受到二人世界。双子是属于智慧型的，不喜欢一成不变的固定关系，喜爱变化，同时也能掌控与操作变化。对于这样的优质对象，自然会令也热爱变化的射手心动万分。你们两个就如南极和北极，南辕北辙，在一起后不是互补就是互斥。您俩恋情结果的好坏，端看向心力的凝聚。相识时双子觉得射手的人很能聊，而且有一句说一句，直接了当，双子没有的东西，好象射手都具齐。但长久相处下来，麻烦就来啦。在恋爱途中，经常发生大家都另有新欢，而且随时随地是一个四角以上的关系，开始的优点也变成互相憎恨的缺点。"
    },
    "B巨蟹座+G双鱼座": {
        "girls_horoscope": "双鱼座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "52:48",
        "precautions": "蟹子和鱼儿都是感情场上的“老司机”，是风花雪月的高级选手。他们的感性是“感时花溅泪，恨别鸟惊心”，都是能见花而掉泪，赏月圆而心喜的典型。虽然两个人都是情绪化、而且是不稳定的那一类，但蟹子的情绪化程度更甚于鱼儿，翻脸的速度简直比翻书还快；而鱼儿悲天悯人，愿意为爱情奉献一切，在爱情中扮演一个很好的另一半的角色。蟹子的包容力相当窄，所以鱼儿可以很幸福地、徜徉在蟹子那温暖无微不至的宽厚肩膀中。唯一要注意的就是要你们悲观情绪的涌动。你们应该要试着去面对低调的情绪，比如多亲近大自然，在阳光底下多活动活动，调节调节低落的悲伤情绪，让心情好点。不要让生活过于陷入于精神层面，只用脑而不活动肢体的消极生活～～只会有百害而无一利。偶尔也是要回归到三次元的世界里面来啊。",
        "boy_horoscope": "巨蟹座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "两个星座都同属水象星座，两人在个性和思考模式都很类似。蟹子看重实际安稳的爱情，鱼儿需要全心全意的照顾，双方都是缺乏安全感的类型。你们两个都“比较”容易爱上人，但蟹子会比较冷静，不会一头栽进去，会慢慢观察，然后再决定是否要爱上鱼儿。同时两个又是爱字当头的星座，传说中说的有情饮水饱指的就是你们这一对。为了维护感情，你们会尽力地去给对方安全感，你们彼之间十分有默契，彼此都心照不宣，很清楚对方要的是什么，一个眼神就能了解对方，是一对如胶似漆、和谐恩爱的组合。"
    },
    "B双鱼座+G天蝎座": {
        "girls_horoscope": "天蝎座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "52:48",
        "precautions": "鱼儿和蝎子的搭配指数是非常高的，鱼儿很崇拜蝎子的冷静生活态度，特别是蝎子那能拒绝一切没意义的事的态度。这是正是鱼儿所缺乏的，鱼儿从不懂得拒绝，纵使百般不情愿。蝎子最好用这项才能去帮鱼儿理清鱼儿的人际关系和爱情，鱼儿并不是用情不专，只是不擅长拒绝。蝎子要注意不要一再刺伤鱼儿脆弱的心灵，一旦鱼儿的心被刺碎，那你们这段感情就没有结果了。鱼儿最怕孤独，蝎子千万要记住不要让鱼儿孤独太久，多给鱼儿支持和体贴。鱼儿也要加强自己的承受能力。你们如果能在平淡的生活中增添多点情趣，那就可以甜甜蜜蜜的携手一生走下去。",
        "boy_horoscope": "双鱼座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "同为水象星座的鱼儿和蝎子，投缘的比率十分高，两人都敏感多情，是这么多星座配对中最适合的一对。鱼儿弱势，蝎子强势，两个人一刚一柔结合，恰恰互补。鱼儿的温柔体贴、浪漫多情、富有幻想都是独占欲强的蝎子所需要的。两人虽然观点会有所不同，但总是能相互理解，蝎子只要能给鱼儿安全感和支持，让鱼儿消除猜疑心，这样，你们要牵手一生就不难了。"
    },
    "B金牛座+G双鱼座": {
        "girls_horoscope": "双鱼座",
        "results_rvw": "相濡以沫的一对",
        "paired_proportions": "56:44",
        "precautions": "内向沉稳的金牛座和具有奉献精神的双鱼座，都会彼此令对方有心理平顺的感觉，特别是鱼儿对艺术的敏感度和牛儿很契合。牛儿很喜欢鱼儿的浪漫善解人意，对鱼儿的情绪化也很是能容忍，所以你们的情感生活很完满。但对牛儿情绪化的举动勿要常用，一旦牛儿爆发会使鱼儿手无足措。牛儿和鱼儿都不是主动型的人，牛儿要负担起这个责任，虽然牛儿不擅于浪漫，但对于鱼儿，多少还是要配合一点。牛儿是很好的梦想执行者，牛儿会认真为鱼儿的每一个不切实际的梦想寻找实现之法，确实是鱼儿不错的伴侣。所以奉劝鱼儿有话直说，喜怒哀乐要让牛儿知道，不要以自己的幻想习性去跟牛儿玩猜谜游戏。牛儿虽然能给鱼儿很大安全感，也很欣赏鱼儿的柔情和体贴，但要注意，你们对事物的看法有时会出现不同看法，因此在交换、沟通这点上要多注意。",
        "boy_horoscope": "金牛座",
        "pairing_idx": "80",
        "longevity_idx": "4",
        "compassion_idx": "4",
        "love_advc": "金牛座和双鱼座都属于阴性星座，有很多互通之处，你们喜欢从心灵出发，比较注重内在感受。你们的交往过程多数在温馨的氛围中进行，双方都不会有太大压力。你们通常在初识阶段时，感情便在自然中进行着，是一对甜甜蜜蜜的组合。牛儿的深情和沉稳会让鱼儿感到安心，牛儿的占有欲会令鱼儿感到有被重视的感觉。因为鱼儿害怕没依靠，失去方向感，所以牛儿那种独占欲和踏实的气质，会令到鱼儿很有安全感。"
    },
    "B天蝎座+G双鱼座": {
        "girls_horoscope": "双鱼座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "48:52",
        "precautions": "鱼儿不要遇到问题就丢给蝎子，这样随便的心态很容易会引发爱情问题。蝎子天生敏感疑心重，警觉性又高，最主要是不容许背叛，蝎子可接受不了鱼儿这些试练。和蝎子相爱，诚信和专情是关键。鱼儿不像蝎子有高抗压能力，在遇到大鸭梨时，就会默默地游走；这本来不是大事，但鱼儿有时为了逃脱，会做伤害到别人的事。如果鱼儿觉得两个真的合不来，请坦白的告诉蝎子，不要跟蝎子耍心机。就算没有存心害蝎子的意思，可当蝎子受到伤害就会反击，这是蝎子的天性，这点一定要记住。鱼儿不会怨恨苦恼蝎子过强的意志和多疑，相反，会更信任蝎子，这正是鱼儿的聪明之处——以柔克刚。",
        "boy_horoscope": "天蝎座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "蝎子和鱼儿相遇，往往都有相见恨晚的感觉。你们算是这么星座配对中最好的一对。水象星座的人都是为爱情而谈恋爱，目的很单纯，很少掺杂其他目的。同为水象星座，同样重感情，两个人一刚一柔，一强一弱，相辅相成，将浪漫发挥到最高境界。鱼儿不要以蝎子喜欢把秘密藏在心里而游走，如果能耐着性子去发掘他的内心，其实是很容易感受到蝎子的自然魅力。蝎子具有抵抗压力特质，这对遇到压力就知道逃的鱼儿来说，实在太帅！蝎子在爱情之中的霸主地位，配上鱼儿的温柔贤惠，不敢抗拒，甘心认命，真是天造地设的一对。你们的情绪起伏也令感情生活充满戏剧性，你们的爱情可谓如烟花般灿烂迷人。"
    },
    "B水瓶座+G天秤座": {
        "girls_horoscope": "天秤座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "52:48",
        "precautions": "秤子在遇上瓶子后，还在为爱与不爱墨迹半天的话，那你和瓶子的关系可能只有停在好朋友的阶段，瓶子在面对感情时也一样墨迹的，所以你们要勇敢一点，为爱踏出第一步，胆怯只会让你们失去幸福。瓶子和秤子都是很有主见的人，他们喜欢将自己的想法强加于人。瓶子有着大男人主义，这一点有时会让秤子感到非常难堪。瓶子最好收敛一下，好好地听听秤子的想法。而秤子也不要太过于管着瓶子，多给瓶子一点自己的自由空间。你们都有自己的朋友圈，但还是得给双方多一点相处时间。秤子不要想着栓住瓶子，爱他就做他的朋友，这是你们愉快相处的关键。",
        "boy_horoscope": "水瓶座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "瓶子和秤子同是风象星座，给人的感觉忽冷忽热、变幻莫测。是有点像但又有点不同的组合，你们能够产生互动和默契，有相近的价值观，容易产生共鸣。你们最好由朋友开始，零负担的交往，这样会使你们迈向永远。瓶子认为每个人都是独立体，而秤子讲求自我空间的完整；瓶子是博爱的理想主义，而秤子讨厌不安，追求和谐。你们的路线看上去有异，但大方向还是相同的。你们要多进行心灵层面的交流，分享彼此兴趣和想法，这是使你们殊途同归的方法。"
    },
    "B处女座+G处女座": {
        "girls_horoscope": "处女座",
        "results_rvw": "相处和谐的一对",
        "paired_proportions": "50:50",
        "precautions": "处女座的人性格几乎一样，所以他们对爱情同是谨慎且挑剔，都有着对完美的执着追求。彼此之间会被对方追求完美的气质吸引，看到对方相当于看到自己，所以很容易产生共鸣。两个都是追求完美的人，因此会过度在意对方的感受和自我完美的要求，这样的相处令人感到很窒息。特别是处女座往往会一厢情愿地认为对方也会有同样感受，若是没有会很难受。虽然你们之间的进展很慢，但只要交往后就会急于建立稳固关系，也希望有所承若，如果能一拍即合，那当然是好，但也要小心对方会被你急切心态所吓倒。你们的关系成功与否取决于你们能否容忍对方的弱点，在看待对方优点时，是否持平等真诚的态度。",
        "boy_horoscope": "处女座",
        "pairing_idx": "80",
        "longevity_idx": "4",
        "compassion_idx": "4",
        "love_advc": "两个同为处女座的人在一起，彼此间会有一份亲切感，很了解与欣赏对方的“质感”，可是你们都不够主动积极，你们之间进展很慢，两个人需要经过长时间的摸索，去了解对方究竟是怎么样，才会才去进一步行动。你们总不能老是在分析对方的每一步，爱情不能一直暧昧的猜来猜去，有时得厚脸皮去试探，这样才会有所进展，若能突破这一关你们将是安静怡谥的一对。你们之间有太多的挑剔、不顺眼和职责，这样会让你们感情恶化。两个处女座想要好好发展下去，就应该彼此相互了解协调。"
    },
    "B金牛座+G处女座": {
        "girls_horoscope": "处女座",
        "results_rvw": "天作之合的一对",
        "paired_proportions": "48:52",
        "precautions": "金牛座和处女座都是主导性强的星座，所以你们在相处上往往会因为太过于尊重对方或迁就对方而让对方难以做决定。处女座是金牛座最好的倾诉对象，相对，牛儿给予的压力都要比别人大。你们会彼此宽容，总能使牛儿倾诉出心里的事，但不要太期待牛儿凡事有感觉，毕竟金牛座没有处女座那么敏感。还有牛儿也要注意避免出现孩子般的嫉妒心与占有欲。若能以成熟人的面貌与之交往的话，关系将会一帆风顺。",
        "boy_horoscope": "金牛座",
        "pairing_idx": "100",
        "longevity_idx": "5",
        "compassion_idx": "5",
        "love_advc": "你们两个同属土象星座，在一起会彼此产生相知相融的感觉。处女座善于发现牛儿的优点，在别人眼中都是笨的存在的牛儿，能吸引处女座的目光，说明处女座发现了牛儿隐藏的某项才华。在感情上，金牛座和处女座做都不是那种主动示爱类型 ，需要经过一段相当长若有若无的酝酿期，才能进入正轨。尤其是牛儿，他的酝酿期本就超乎常人，因此，处女座要更细心和体贴地去感受牛儿！！对感情金牛座和处女座都是非常忠实忠诚的，他们的耐力比常人高一等。牛儿喜欢温柔端庄的女性，而处女座恰好是他们心中的理想人选。牛儿眼光高，而追求完美的处女座，气质外表都刚好符合牛儿的审美。"
    }
}